{"text":"Oil and the ISIS: Another US-NATO War on Libya is Imminent"}
{"text":"North Korea says it has conducted hydrogen bomb test - CNN.com"}
{"text":"Don't Be Fooled By The Political Game: The Illusion Of Freedom In America"}
{"text":"Its likely intelligence agencies predicted the North Korean test in late December: \"High Resolution Satellite Imagery Shows Continued Tunnel Construction at Punggye-ri\""}
{"text":"Judge Napolitano: Why Obama's Executive Action On Guns Is Unconstitutional"}
{"text":"I've seen predictions dollar and US economy collapsing this year. Do you guys believe this could actually happen?"}
{"text":"One of the world's most mysterious organizations gets a new boss"}
{"text":"The Information War by Richard D Hall"}
{"text":"S. Arabia &amp; Qatar among top US arms buyers despite human rights abuses"}
{"text":"How Obama Enables Atrocities"}
{"text":"Robert Hunziker: “The United States of America has never Deviated from the Monroe Doctrine”"}
{"text":"Jew here. AMA"}
{"text":"Hillary thinks drinking vodka with McCain is hilarious"}
{"text":"Would it be a good idea or is it possible to lock voting on posts that no longer have activity in r\/conspiracy?"}
{"text":"ISIS is working on Mossad\/CIA plan to create greater Israel"}
{"text":"Is Ted Cruz a Natural Born Citizen? Ask the Founders"}
{"text":"Before Obama bowing before a king, General Eddy, a high-level American officer went down on his knee before King Abdul Aziz, as President Roosevelt listens, aboard a U.S. warship in the middle of the Great Bitter Lake, Egypt, Feb. 20, 1945."}
{"text":"[1985] Wikipedia - Sinking of the Rainbow Warrior. French government plots to sink Greenpeace ship in New Zealand harbor, killing one, to prevent it from protesting nuclear weapons testing."}
{"text":"British parliament to debate ‘Ban Trump’ petition"}
{"text":"Oregon “Militia” Says Feds Stole Their Land – Turns Out It Was Stolen from Paiute Tribe"}
{"text":"MH17 Coroner’s Inquest: More Questions than Answers | New Eastern Outlook"}
{"text":"[SERIOUS] If United States currency is not backed by gold, what is it backed by? And does that currency-backing 'material' fluctuate in 'price'? Thx."}
{"text":"Come back with a warrant : Very funny \/s"}
{"text":"Unusual Fog\/Mist."}
{"text":"Debian Founder Ian Murdock Dies Mysteriously"}
{"text":"Daesh is part of the Israeli army"}
{"text":"Hi I just watched he new pbs frontline documentaries episode on Benjamin Netanyahu and I have a few questions I have never thought of before and I'm wondering if you guys could give me some answers ."}
{"text":"Constitutional attorney talking about the Oregon situation"}
{"text":"'93 drug conviction blocks McKeesport man from city council despite election"}
{"text":"Europe Legalizes Bail In- Basically If The Banks Fail, The People Pay By Law... Business As Usual Because No One Understands These Concepts"}
{"text":"Europe Legalizes Bail In- Basically If The Banks Fail, The People Pay By Law... Business As Usual Because No One Understands These Concepts"}
{"text":"My Thoughts on the \"Militia\" in Oregon"}
{"text":"Does this photo look odd to anyone else?"}
{"text":"An extensively detailed, diagram-loaded, annotated, huge infographic of all data pertaining to JFK assassination."}
{"text":"\"Militia\" PSYOP - Bundy \"Leader\" Characters"}
{"text":"President Obama Flashes V Hand Sign At Executive Order Press Conference"}
{"text":"Template Articles of Impeachment for Barack Something Something Soebarkah"}
{"text":"New Year's Eve Troubles in Cologne and \/pol\/"}
{"text":"We did it again, \/r\/conspiracy."}
{"text":"So what is the Cosby story distracting us from?"}
{"text":"A Cruise Missile Slammed Into the Pentagon on 911"}
{"text":"What else happened ?"}
{"text":"UN peacekeepers in CAR hit with fresh sex abuse allegations"}
{"text":"UFOs aliens invented by the government?"}
{"text":"Is bitcoin mining really just mining for a machine that computates and predicts what everyone on the internet will see from their news feeds\/google results?"}
{"text":"Obama Issues 20 Executive Actions on Guns"}
{"text":"Where the fuck can I watch the documentary An Open Secret??"}
{"text":"Here's Why Obama's Gun Control Proposal Is A Dishonest Fraud"}
{"text":"Coup Plotters Asked for US Government Permission Three Months Before Guinean President's Death, Secret Documents Detail"}
{"text":"The hutchison effect"}
{"text":"Netanyahu at War"}
{"text":"Record number of police officers were charged with murder or manslaughter in 2015 — not a single one convicted"}
{"text":"President Obama \"sheds tears\" During Gun Violence Speech"}
{"text":"Ukraine's government bans films with actors designated as persons posing threat to national security"}
{"text":"It seems Alex Jones is selling brain pills now. What do you guys make of this?"}
{"text":"The False Flag Formula – 15 Ways to Detect a False Flag Operation"}
{"text":"US Military-Industrial Complex Also Includes Big Corporations And Congress; “The CIA particularly represents the views of the Wall Street investment firms and the multinational corporations that they invest in”"}
{"text":"UK Investigatory Powers Bill surveillance plans 'totalitarian,' NSA whistleblower says (Wired UK)"}
{"text":"Netanyahu: Hitler Didn't Want to Exterminate the Jews"}
{"text":"The good lesson Hezbollah gave the Zionist regime"}
{"text":"1999: NRA Exec VP Wayne LaPierre speaking before congress in support of firearm background checks for everyone."}
{"text":"5 Hong Kong booksellers go missing"}
{"text":"Will you qualify as mentally ill? It depends if you're against the regime or not. Obama's underhanded executive action"}
{"text":"Why Key Performance Indicators Often Aren't: And How It Hurts Organizations"}
{"text":"ISIS in the news: comparing reactions of netizens and media outlets in China and the United States."}
{"text":"An eyewitness account of the immigrant riots in Cologne Germany on NYE"}
{"text":"How Authoritarianism Flourishes on Social Media"}
{"text":"Nearly 20 prevent of posts on first 3 pages are either anti Democrat or pro Republican while only one post out of the top 100 questions the events in Cologne, Germany on New Years. Think about that."}
{"text":"Emanuel opposes federal probe of Law Dept. after city lawyer lied in police shooting"}
{"text":"Rahm Emanuel opposes federal probe of Law Dept. after Chicago lawyer lied in police shooting"}
{"text":"Obama measures wouldn't have kept guns from mass shooters"}
{"text":"I am a medically targeted individual. Ask me anything! I will submit proof for mods."}
{"text":"UN to call on governments around the world to decriminalise all drugs, says Richard Branson; releases embargoed report in case they \"change their minds\""}
{"text":"Executions Show Saudi Arabia Beholden to Sectarianism"}
{"text":"Reporters and gawkers outnumber occupiers at Oregon site"}
{"text":"Trump unafraid to address Cologne attacks"}
{"text":"And the winning numbers are..."}
{"text":"Why did the Secret Service schedule a meeting with military explosives recovery teams on the morning of 9\/11 at the WTC complex?"}
{"text":"URGENT Warning on OR Standoff: Military Special OP Assets Have Been Assigned for Standoff. Keep Women and Children Out of There"}
{"text":"Tiffany Aliano: \"My Son Was Taken From Me By A Corrupt Judge And CPS!\""}
{"text":"You are Born in a Cage You Cannot See"}
{"text":"UN peacekeepers accused of sexually abusing four girls in Central Africa"}
{"text":"Last year, President Obama was the number one weapons dealer in the world"}
{"text":"New years eve 2015, Immigrant riots in Cologne Germany - An eyewitness a..."}
{"text":"Taliban Controls 30% of Afghan Districts, Most Territory Since 2001"}
{"text":"Open Letter: Leave The Wild Bird Sanctuary Boys, Your Socks Are Wet"}
{"text":"Fasicst IRS Gets New Powers to Revoke Passports"}
{"text":"1,000 Crack British Troops Deployed to Libyan Oil Fields to ‘Halt the Advance of ISIS’"}
{"text":"Social Security: Surge of children named Mohammed up 10,000%"}
{"text":"It's official...FAU fires James Tracy who called Sandy Hook shooting a hoax"}
{"text":"The State Department has dramatically revised downward from about 38,000 to one its estimate of the number of pages of messages in Hillary Clinton aides' private email."}
{"text":"Anonymous Hong Kong warns China of mass cyber attacks over missing book publisher.Lee and his four colleagues — believed to be disappeared as a result of their work at the Causeway Bay Bookstore, known for selling banned works critical of the Communist Party."}
{"text":"\"The “Bureau of Land Management” is not an actual unit of the American government. It is a foreign corporation whose only business here is to provide us with “essential governmental services”.\" ~ from Judge Anna Maria Riezinger ~"}
{"text":"Oregon Wildlife Refuge Occupation Powder Keg Just Needs a Spark"}
{"text":"Oregon III% Press Release on Malheur Wildlife Refuge ~ \"The 3% of Idaho, 3% of Oregon, The Oregon Constitutional Guard, and PPN organizations in no way condone nor support these actions. \""}
{"text":"he journalists–and Americans—have been kept in the dark while universities and many allied name-brand companies have quietly imported an extra workforce of at least 100,000 lower-wage foreign professionals in place of higher-wage American graduates, above the supposed annual cap of 85,000 new H-1Bs."}
{"text":"Journalists–and Americans—have been kept in the dark while universities and many allied name-brand companies have quietly imported an extra workforce of at least 100,000 lower-wage foreign professionals in place of higher-wage American graduates, above the supposed annual cap of 85,000 new H-1Bs."}
{"text":"U.S. wars caused current refugee crisis"}
{"text":"EPA finds pesticide harms bees in some cases"}
{"text":"E. Michael Jones's \"The Neoconservative Song.\""}
{"text":"Muslim \"refugee\" man brags about 7-man gang rape of German girl"}
{"text":"Scientists want to do research on your tissues without asking you first"}
{"text":"A Refugee Crisis Made in America"}
{"text":"Obama's gun control measures are astonishingly hypocritical when you consider his track record in arms sales | Voices"}
{"text":"Taxpayer Advocate Warns of ‘Pay to Play’ I.R.S. System"}
{"text":"“Russian” DarkEnergy malware strikes at Ukrainian media and energy firms"}
{"text":"An eyewitness account by Ivan Jurcevic, a hotel club bouncer, what happened on 31th of december 2015 right in front of the cologne cathedral (Kölner Dom)."}
{"text":"Europe’s Refugee Crisis Was Made in America"}
{"text":"Documents Show JFK Was Murdered Days After Demanding Answers About UFO’s From The CIA"}
{"text":"Sooooooo was Sandy Hook real or?"}
{"text":"The Secret Service on 9\/11 - Kevin Ryan \/ James Corbett"}
{"text":"The Iraq war: The root of Europe's refugee crisis"}
{"text":"Is Huma Abedin Hillary Clinton’s Secret Weapon or Her Next Big Problem?"}
{"text":"Ron Garner Deathbed Reel - Interesting take on disclosure and Area 51"}
{"text":"String of attacks kill 20 Syria rebel commanders: activists | THE DAILY STAR"}
{"text":"The simple truth: The U.S. caused Europe's refugee crisis"}
{"text":"New Obama rule allows doctors to declare patriots, conservatives and Constitutionalists mentally ill to ban their gun rights without due process"}
{"text":"Stripped naked and made to perform a sex act on her boss's fiance: How McDonald's worker fell victim to bizarre and cruel hoax"}
{"text":"Chris Christie: Obama 'created the refugee crisis' in Syria"}
{"text":"Tina Rothery: \"Oklahoma Earthquakes Prove Fracking Should Be Outlawed Immediately!\""}
{"text":"Europe has to deal with refugee disaster caused by US – Nicolas Maduro to RT"}
{"text":"Hickock45 banned after posting a vudeo about the RM380"}
{"text":"http:\/\/www.returnofkings.com\/76520\/12-methods-america-uses-to-turn-france-into-a-globalist-nightmare"}
{"text":"Civil Forfeiture Highway Shakedowns in Tennessee"}
{"text":"Why Are Muslims Faking Anti-Muslim Hate Crimes?"}
{"text":"Clinton 2016? Conspiracy Shocker! Absolutely shocking suppressed documentary about both Clintons crime syndicate drug smuggling, money laundering, womanizing, murder, political favors, killing anybody who talked"}
{"text":"'Human Rights Groups' Are Propaganda Fronts, Conceal US Crimes While Accusing Russia"}
{"text":"Tune in now 5 pm GMT to hear 1st hand accounts of assaults in Colongne on NYE. (Evening news show so witness interviews will be on anytime within the next 50 min)"}
{"text":"Clinton Conspiracy - Absolutely shocking suppressed documentary about both Clintons crime syndicate drug smuggling, money laundering, womanizing, murder, political favors, killing anybody who talked"}
{"text":"People who throw the phrase “denier” around, have crossed a line beyond reasonable debate: They indirectly equate the skeptics’ view that global warming is not necessarily all manmade nor a serious problem, with the denial that the Nazi’s extermination of millions of Jews ever happened."}
{"text":"Trump addresses Cologne Rape attacks"}
{"text":"PBS Frontline - Netanyahu at War"}
{"text":"Are the government holding back research into NZT-style cognition enhancement?"}
{"text":"12 Methods America Is Using To Turn France Into A Globalist Nightmare"}
{"text":"The Perfect Storm Is Forming In The Economy And It Will Crash Hard"}
{"text":"The American Cuckservative:How Our Schools Are Helping White Children Become More Progressive"}
{"text":"Obama is an okay president, but probably the best gun salesman ever"}
{"text":"Fascist TSA frisks 10-year-old girl after finding juice pouch (VIDEO)"}
{"text":"Denver’s zoning rules are sending marijuana businesses to poor neighborhoods. Residents of those areas complain about the smell that wafts out of the grows, and say they worry about a rise in crime and youth drug use."}
{"text":"Brave New Europe: ‘Code of Conduct’ Suggested for German Women Attacked by 'Gangs of Arab Men'"}
{"text":"Huge Fire at Downtown Dubai Luxury Hotel - timelapse. \"Any second that building will collapse into its own footprint!\""}
{"text":"Wall Street Kicks Off 2016 With a Faceplant"}
{"text":"How Corrupt Is the American Government?"}
{"text":"Russians avoiding European destinations due to the refugee crisis. “Many resorts are filled with refugee camps - coastal Italy and Greece. And every tourist responds for his own safety"}
{"text":"Zionists busted with invention of \"Jesuit Oath\" to malign Catholics"}
{"text":"Zionist Plot to Invade Europe &amp; the USA With 100 Million Muslim Refugees Working According to Plan"}
{"text":"\/r\/germany censoring \"Mayor of Cologne's comments on keeping an arms length\""}
{"text":"As president bypasses Congress to tighten gun safety regulations, major Jewish organizations express support"}
{"text":"Cologne inquiry into 'coordinated' New Year's Eve sex attacks"}
{"text":"\/r\/germany censoring \"Mayor of Cologne's comments on keeping an arms length\""}
{"text":"Author Maury Tenny has passed away. Best known for his book linking Son of Sam\/Manson murders to satanic cult networks: The Ultimate Evil"}
{"text":"Neocons Protest US Spying on Israel"}
{"text":"Foe of President Erdogan charged in absentia in Turkey"}
{"text":"Common antidepressant 'increases risk of congenital and cardiac defects'"}
{"text":"Former U.S. attorney: Clinton could face criminal indictment"}
{"text":"Ted Cruz is not eligible to be President of the United States"}
{"text":"\"Military age men\" at San Diego's southern border"}
{"text":"Erik on Several Conspiracy Theories"}
{"text":"Are Climate Skeptics Too ‘Mentally Ill’ to Buy Guns Under Obama’s New Rules?"}
{"text":"Hillary Clinton’s “regime change” policies as Secretary of State helped spread the chaos that has turned the Middle East into a killing field and might have done even worse if not for extraordinary obstructions from the Pentagon’s Joint Chiefs of Staff regarding Syria."}
{"text":"Benghazi panel continues interviews, surpasses length of 9\/11 inquiry"}
{"text":"Dental group defends mercury fillings amid mounting evidence of risks"}
{"text":"Bahrain arrests 'terror cell' with alleged links to Hezbollah and Iran"}
{"text":"Syrian President Says US And Europe Created Refugee Crisis By Supporting Terrorism Read More: http:\/\/www.trueactivist.com\/syrian-president-says-us-and-europe-created-refugee-crisis-by-supporting-terrorism\/"}
{"text":"San Bernadino - why so quiet?"}
{"text":"Assad says US and Europe Created Refugee Crisis by Supporting Terrorism"}
{"text":"Is Trump a Genius?"}
{"text":"Police To Use Drones To Control Protesters- A Dangerous Precedent Being Set"}
{"text":"Final tally: Police shot and killed 984 people in 2015"}
{"text":"FAU fires professor who said Sandy Hook shooting may have been staged"}
{"text":"(Truth bomb) Puppet Obama Gun Control BS"}
{"text":"How U.S. Foreign Policy Created ISIS And The Syrian Refugee Crisis"}
{"text":"Eye in the Sky: US Spy Plane Reportedly Monitored N Korea’s H-Bomb Test"}
{"text":"Refugee crisis was caused by a careless West that allowed anarchy and fear to take root in the Middle East"}
{"text":"Syria: Western Intervention Created The Refugee Crisis First appeared: http:\/\/journal-neo.org\/2015\/09\/27\/syria-western-intervention-created-the-refugee-crisis\/"}
{"text":"Special Ops Called to Oregon as \"Fake Militiamen\" Exposed as Fed Provocateurs by Real Militia"}
{"text":"r\/news reacts to someone not going along with the official narrative"}
{"text":"#2 Post on \/r\/all Critical of Oculus Rift Price Removed Day After Oculus CEO Donates $100 to \/r\/Oculus Mod"}
{"text":"9\/11 Boat Lift Evacuation - Coast Guard Caught Off Guard?"}
{"text":"I knew it. I love the Hollow Earth theory."}
{"text":"STUNNED GIRL NEAR AREA 51 SNAPS HD PICS OF ALIEN SHIP BEFORE ABDUCTION! UFOS ARE REAL 2015"}
{"text":"If you do not know who Gerry Spence is, then I would like to introduce you to him. And I would like to mention that in his entire career as a lawyer he never even once lost a case. After you read this I hope you'll understand why he's the best lawyer you'll ever know of. Gerry fought conspiracies."}
{"text":"Crisis Actor Barack Obama Fake Tears Magic Trick For The Gun Control Agenda"}
{"text":"The Rise of Independent (non-state) Crypto-Currencies Washington's Blog"}
{"text":"Your Doctor is now your Dictator: Obama gives doctors power to declare you 'mentally ill' and take away your rights"}
{"text":"Judge Napolitano: Unconstitutional for Obama to Create a New Gun Transfer Crime"}
{"text":"The slow strangulation of Yemen. (very well sourced)"}
{"text":"[Need Help] Theories about why Saudi Arabia is pumping out so much oil"}
{"text":"Thhhhhhhheeee weather?"}
{"text":"Obama is profiting from every gun law he passes"}
{"text":"Will Mideast Allies Drag Us Into War?"}
{"text":"Trial dates set for Marksville police officers accused of killing 6-year-old, The body camera captured 13 minutes, 26 seconds in, it shows \"...Christopher Few's empty hands are raised and visible when gunfire becomes audible.\" The two Officers entered not guilty pleas."}
{"text":"Cosmic Disclosure #32: Inner Earth- David Wilcock\/Corey Goode"}
{"text":"WHY Evangelists and khazars hate this video."}
{"text":"Origins of the \"education\" system in America"}
{"text":"So you want to be Charlie? This is really what Charlie stands for. Hate and division. Don't be Charlie."}
{"text":"I just watched Making a Murder. This is how conspiracies happen."}
{"text":"Descent Into Tyranny Issue #1 (Document Share &amp; Comment)"}
{"text":"How many in r\/conspiracy are Anarchists?"}
{"text":"DHS gives TSA authority to forcibly irradiate Americans against their will"}
{"text":"Libertarian Gary Johnson, ex-NM governor, launches presidential bid"}
{"text":"Making A Murderer: Steven Avery Juror Says Subject Was Framed"}
{"text":"\"By simply submitting the completed activity form, you would have been compliant with no further discipline,\" FAU Vice Provost Diane Alperin wrote in a letter on Tuesday."}
{"text":"Ethiopia Kicks Out US Killer Drone Base"}
{"text":"Fears of Civil War: Oath Keepers Warn Oregon Militants to Evacuate Women and Kids"}
{"text":"Gun Grab Goes Live, It's Time To Remove Obama"}
{"text":"“The Government Has Violence on Its Mind” - Jacobin interviews Ammon Bundy, the militia man behind the Oregon armed standoff."}
{"text":"Doug Stanhope: Occupy Elsewhere, “You comb your dreadlocks over to one side, put on your three-dollar Salvation Army suit and you clog up all [the banks] time.”"}
{"text":"Disturbing eyewitness account from Cologne: Bouncers had to protect women from muslim molesters whilst police did nothing"}
{"text":"My theory on the \"flat earth conspiracy\"."}
{"text":"Kim Jung-Un(o)"}
{"text":"Most Americans are one paycheck away from the street"}
{"text":"Grandmaster Putin beats Uncle Sam at his own game"}
{"text":"Biotechnology Proponent’s Recipe to Defend GMOs Produces a Stew Blending Orwellian Rhetoric with Sheer Demagoguery"}
{"text":"Leftists say they're concerned for the well-being of women. But Leftists will blame the victim if the rape is inconvenient to their narrative\/power"}
{"text":"Just the Beginning: Iran, India Dump Petrodollar, Settle Oil Payments in Rupees"}
{"text":"\"It's a huge transformation for Europe to make - they are now going into a multicultural mode - and Jews will be resented because of our leading role.\""}
{"text":"September, 2014: 9\/11 Commission Chairman Thomas Keane called for the release of the 28 Pages: “I don’t know of a single thing in our report that should not be public after ten years”"}
{"text":"Shay's Rebellion 1787 - REVOLT Against the Blue Blood Masons - REAL American History"}
{"text":"32 Years Ago, KGB Propagandist Explained How America Would Turn Marxist"}
{"text":"Regarding the California Proposal to Make Holocaust Denial Illegal - Jews infiltrated German politics then perped the Holocaust in the name of the German ppl, like they infiltrated US politics perped 911, then established the bogus War on Terror - Full prosecution will engender a biblical death toll"}
{"text":"Violence of Cologne \"nothing new\", it was hushed up, says ex-cop"}
{"text":"Astronomers Find New Object, Possible Super-Earth In Our Solar System"}
{"text":"Hundreds pack gym to oppose Malheur County monument proposal - Oregon - Capital Press"}
{"text":"A modern alchemical hoax exposed"}
{"text":"Hey NASA: Space Debris Doesn't Take A Linear Trajectory In This Video Because...?"}
{"text":"Monsanto says it layoff 1,000 more people; Impact on Reddit uncertain"}
{"text":"Monsanto says it will layoff 1,000 more people; Impact on Reddit uncertain"}
{"text":"'Cover-up' over Cologne sex assaults blamed on migration sensitivities...Police and Media coverup.....Europe is falling apart."}
{"text":"NSA's Prism should be repurposed to produce highest-quality CGI pedophilia snuff films indistinguishable from real. Here's why."}
{"text":"Mark Zuckerberg promoting his new book on his reading list \"World Order\" by Henry Kissinger on Facebook."}
{"text":"Mark Zuckerberg promoting Henry Kissinger's \"World Order\" as the new book in his reading list. Wants his child to live in a New World Order."}
{"text":"Delusional US Claimed 2015 “Success Stories”: Reinventing History on the “Official State Department Blog”"}
{"text":"Global Warming Is Not the Problem. Global Governance Is."}
{"text":"Victims speak out after nightmare sex attack on New Years in Cologne [Euronews news coverage vid]"}
{"text":"2015, Year of Crisis Escalation. What to expect in 2016"}
{"text":"The New Clinton Chronicles 2015 - Clinton insider, Larry Nichols, tears open the Clinton machine."}
{"text":"Monsanto, US, &amp; Gates Foundation pressure Kenya to reverse GMO ban"}
{"text":"Monsanto, US, &amp; Gates Foundation pressure Kenya to reverse GMO ban"}
{"text":"The Invasion of Gaza with Michel Chossudovsky"}
{"text":"I made this video compilation of eyewitness statements, news reports, video footage, etc, about explosions and explosives playing a part in the destruction of the Twin Towers on 9\/11."}
{"text":"Yemen has not only beaten back Saudi Arabia's invasion, but has begun to liberate Saudi territories, Jan. 6, 2016"}
{"text":"Promoting Plutocracy - US-led regime changes and the assault on Democracy. - PDF"}
{"text":"r\/conspiracy wants some new mods"}
{"text":"Has a Peaceful Protest over Government Over-reach Been Corrupted by Outside Influence in Burns, Oregon?"}
{"text":"Dont be scared listen to the whole song! Get the word out people"}
{"text":"\"Pray For Us\": Libya Issues \"Cry For Help\" As ISIS Advances On Oil Fields - Another failed regime change"}
{"text":"New Years COLLECTIVE Resolutions- Part 1 Our Health"}
{"text":"Obama eyes 6 military bases to house surge of illegal immigrants"}
{"text":"Obama: Hypocrite To His Own Advice On Executive Action"}
{"text":"Neoliberalism Raises Its Ugly Head in South America. The USA war on Venezuela, Brazil, and Argentina"}
{"text":"New years eve 2015, Immigrant riots in Cologne Germany - An eyewitness account"}
{"text":"Alibaba.com and the Chinese thieves"}
{"text":"Acompanhando experiências de regulamentação de cannabis, pelo mundo"}
{"text":"Criminality in Rio. Do not go to Rio 2016 Summer Olympics. Now you have been warned."}
{"text":"What Pisses Me Off About The Germany Rape Attacks"}
{"text":"Drivers Licenses from 5 States Not Valid for Domestic Travel, Starting January 10, 2016"}
{"text":"Manifesto. I am the leader of the revolution. You need to bring me food and winter socks. I need to go home and feed my cattle. Together we will win."}
{"text":"“CIA Lying Performance” Then and Now: The JFK Assassination Versus The CIA’s Obstruction of Justice in 2015"}
{"text":"Chipotle is a victim of corporate sabotage... biotech industry food terrorists are planting e.coli in retaliation for restaurant's anti-GMO menu (It does seem strange that a well established popular restaurant should suddenly start making their customers sick)"}
{"text":"Germany, Africans of Muslim Background and the Volkswagen lawsuit."}
{"text":"Texas Trooper Who Arrested Sandra Bland Is Indicted on Perjury Charge"}
{"text":"Has it really come to this?"}
{"text":"The Rule Of Law No Longer Exists In Western Civilization"}
{"text":"State of emergency declared over huge Los Angeles County methane leak"}
{"text":"An eyewitness account of NYE in Cologne."}
{"text":"Obvious shill is bot upvoted to top of comments 20k on Daily Mail article criticising the German rape and sexual assault attacks claiming \"imperialist xenophobia\" - Looks like they're really trying to silence this incident"}
{"text":"Eyewitness Account Of The “Monstrous” Migrant Attacks In Germany: “It’s Like Civil War”"}
{"text":"James Tracy, fired FAU professor, has chance to keep job"}
{"text":"How a New Jersey Jewish Teenager Was Railroaded By Her School for Being Pro-Palestine"}
{"text":"Germany: Migrants' Rape Epidemic (Sourced Analysis from Aug\/Sept 2015)"}
{"text":"Methane Leak In California A ‘Major Catastrophe'"}
{"text":"American Progress"}
{"text":"San Bernadino shooting - MSNBC had reported ATF purchased AR-15 for police (but somehow ended up with Sayed Farook)"}
{"text":"San Bernadino shooting - MSNBC had reported ATF believes someone purchased the AR-15's for police (but they somehow ended up with Sayed Farook)"}
{"text":"Stories On Cologne Assaults Face Censorship On Reddit"}
{"text":"Fox new calls Florida prof \"Wacky\" for doubting Sandy Hook"}
{"text":"The US Helped Overthrow Libya 2011. Here's What's Happening There Now"}
{"text":"Feds, Militias, and Native Americans: A Deeper Look at the Oregon Standoff"}
{"text":"Top Mind believes Jews caused the Holocaust to make the German people look bad."}
{"text":"Our Allies Just Bombed a Center for the Blind and Our Government Doesn't Care"}
{"text":"The Clintons’ Paid-Speech Bonanza"}
{"text":"Don't trust the FDA. (Regarding Chantix.)"}
{"text":"The enemy is Saudi, the enemy aint saudi, the enemy around me"}
{"text":"The alcohol industry is not meeting its 'Responsibility Deal' labeling pledges. \"The pregnancy warning logo was significantly smaller on wine bottles than on beer\/lager\/cider containers. In the UK, men are more likely to drink beer than women, and women are more likely to drink wine.\""}
{"text":"Read The Powerful Saudi Terrorism Article Censored By Al-Jazeera"}
{"text":"What secret cargo are #Saudi 747s collecting from #Bulgaria? Bulgarian Arms Add Fuel to Middle East Conflicts"}
{"text":"The Alcasser girls"}
{"text":"The Truth About The Oregon Rancher Standoff. Very informative - almost half hour video by free domain radio."}
{"text":"DNC Chair, Fueled by Booze PACs, Blasts Legal Pot"}
{"text":"In 1996 David Irving attempted to sue for defamation over claims that he was a Holocaust denier and manipulated and distorted facts, he lost."}
{"text":"Here We Go Again: China Halts Trading For The Entire Day After Another 7% Crash. Time for QE4."}
{"text":"A large earth quake in North Korea immediately after the announce a hydrogen bomb? America definitely has an earthquake machine."}
{"text":"\/r\/debate would be jealous over this one"}
{"text":"N. KOREA ALLEGEDLY DROPS H-BOMB"}
{"text":"Bernie Sander's one weird trick for breaking up the big banks"}
{"text":"The Bail-Ins Are Back! Portugal Slaps Senior Bank Bondholders With €2 Billion Loss"}
{"text":"Ex-Obama Aide Known As “Hedge Funds’ Secret Weapon” Assails Bernie Sanders’ Wall Street Overhaul"}
{"text":"VIDEO: Robert Pickton's Secret Messages - Smells like rat soup, Pickton would know any stranger put into a cell with him would be a police stooge \"wearing a wire\" - The presenter Alfred Lambremont Webre is actually Australian Jew, full time terrorist and Mossad spy Ari Ben Menashi aka Joe Vialls"}
{"text":"Were The CIA Complicit in El Chapo's Escape?"}
{"text":"Vietnam: Officials probe mysterious 'space balls'"}
{"text":"Politicians Use North Korea H-Bomb Fears to Pitch Wasteful Missile Defense Projects"}
{"text":"The Pyramid Code - Full Documentary"}
{"text":"Sandy Hook thread shows off the best of reddit bullying and worst of humanity."}
{"text":"Shadow Government Is at Work in Secret"}
{"text":"Jewish High School Girl Threatened For Supporting Palestinian Rights"}
{"text":"PC culture has extended into political discourse as a cover for deception. Devastatingly accurate analysis of the James Tracy firing."}
{"text":"CERN"}
{"text":"New Era Detroit Call For Action (Video): “I Will Take Care of My Neighbor!”"}
{"text":"Was Browsing the USGS Earthquake site, when suddenly........."}
{"text":"Alex Jones Was the Zionist Sponsored Controlled Opposition Face of 911 Truth, never mentioning the \"Celebrating Jews\" or Put Options traced to Mossad HQ, until he dropped the ball - Three generations of the Jones clan will be investigated for murder, the old boy for JFK the other two for Riad Hamad!"}
{"text":"Obama's FULL Scripted Gun Control Executive Order Speech with FAKE Crying HD (TeamWakeEmUP)"}
{"text":"The Associated Press reports on Eastern European criminal networks seeking out extremist groups to sell bomb-grade radioactive materials to"}
{"text":"Alex Jones Was the Zionist Sponsored Controlled Opposition Face of 911 Truth, never mentioning the \"Celebrating Jews\" or Put Options traced to Mossad HQ, until he dropped the ball - Three generations of the Jones clan will be investigated for murder, the old boy for JFK the other two for Riad Hamad!"}
{"text":"Hammond Ranch, BLM, follow the money, Uranium, Russia, Clintons, Money!"}
{"text":"Obama at UN: \"The future must not belong to those who slander the prophet of Islam\""}
{"text":"\"Once we squeeze all we can out of the United States, it can dry up and blow away.\""}
{"text":"Michio Kaku &amp; Noam Chomsky School Moon Landing and 9\/11 Conspiracy Theorists | Open Culture"}
{"text":"Russia Names United States, NATO As Threats to Its National Security"}
{"text":"Erekat: Netanyahu’s statements explain Jewish terror"}
{"text":"University fires professor who says Sandy Hook was a hoaxhttp:\/\/www.msn.com\/en-us\/news\/us\/university-fires-professor-who-says-sandy-hook-was-a-hoax\/ar-AAgqIgM?li=BBnb7Kz"}
{"text":"It's time to give your comments on the TPP! - It is critical that as many people as possible write comments here. (In 2014, millions of public comments pouring into the FCC saved the Internet, and this could do the same)"}
{"text":"Was Obamas mother actually the daughter of Hitler?"}
{"text":"Is Canada's New PM a Radical Muslim?"}
{"text":"Remember that story about UK prime minister David Cameron having sex with a dead pig? BBC doesn't."}
{"text":"Saudi Arabia Uses Terrorism As An Excuse for Human Rights Abuses"}
{"text":"homeless santa hat guy spittin truth"}
{"text":"CNN Gun Control Debate Today (Most biased debate I've ever seen)"}
{"text":"Skyscraper fire in Dubai but the building did not collapse, so why did 9\/11 happen?"}
{"text":"Tests suggest mercury in air at some dental clinics"}
{"text":"San Bernadino Witness kinda looks a lot like the Virginia tech Shooter http:\/\/www.apfn.org\/apfn\/vatech.htm"}
{"text":"The Beatles were not the people you think they were... Very eye opening."}
{"text":"Dem: CIA Director Petraeus again debunks Benghazi theories"}
{"text":"Stories on Cologne assaults face censorship on Reddit"}
{"text":"Found this video surprisingly poignant."}
{"text":"How Corrupt Is the American Government?"}
{"text":"Things that wash ashore"}
{"text":"Released Shin Bet detainee: they wasted five months of my life"}
{"text":"There was an article on \/r\/news about a boy in California finding a message in a bottle from a long gone soda company, either I'm a time traveller, the news is fake, or something."}
{"text":"America now is Germany then: Analogies"}
{"text":"Freemasons Conspiracy Against the Catholic Church"}
{"text":"\"You know, gentlemen, that I do not owe any personal income tax. But nevertheless, I send a small check, now and then, to the Internal Revenue Service out of the kindness of my heart.\" - David Rockefeller"}
{"text":"Libya oil storage tanks ablaze after assault by IS"}
{"text":"A former Israeli Knesset member is one of several individuals suspected of crimes including fraud, theft and other felonious acts"}
{"text":"Dominican President: \"Cover-up\" in \"Assassination\" of Brazilian General who Faced \"Intense Pressure from Washington\" in Haiti"}
{"text":"Got banned from r\/feminism because I criticized Hillary Clinton."}
{"text":"Unaired SNL Sketch Portrays US congress controlled by Israel, criticized by Anti-Defamation League and not aired on TV"}
{"text":"L.A. prosecutors won't bring two sexual assault cases against Bill Cosby"}
{"text":"Libya truck bomb targets police recruits in Zliten"}
{"text":"Iran accuses Saudi warplanes of attacking Iranian embassy in Yemen"}
{"text":"Iran accuses Saudis of bombing embassy in Yemen"}
{"text":"\"Militia\" PSYOP - Psychological\/Emotional Warfare"}
{"text":"Uh oh - 5:21am, power went out and when I was calling it in on a landline, the phone unexpectedly went dead. Router on battery....how long before they attack?"}
{"text":"FBI probes mystery of San Bernardino shooters' whereabouts for 18 minutes after massacre"}
{"text":"New US food guidelines show the power of lobbying, not science"}
{"text":"“I am Syrian. You have to treat me kindly. Mrs Merkel invited me\" Quote from a suspected sex attacker in Cologne"}
{"text":"Theory on Exécutive Gún Control Actions"}
{"text":"Charlie Hebdo, THE GETAWAY Pt.IV: One Year Later...An Improbable Escape (revisited)."}
{"text":"Will North Korea rule the world?"}
{"text":"TSA agents frisk 10 year old girl after finding Capri Sun juice pouch in carry-on luggage"}
{"text":"Cultural Engineering - Divide and Conquer Psy-Ops"}
{"text":"Largest Collection of Declassified UFO Files - including 10,000 censored Air Force reports"}
{"text":"Dominican President: \"Cover-up\" in \"Assassination\" of Brazilian General who Faced \"Intense Pressure from Washington\" in Haiti, Secret Documents Expose"}
{"text":"The U.S. Is Still No.1 at Selling Arms to the World"}
{"text":"Rape Culture Around the World"}
{"text":"thoughts from inside a tiny curve..."}
{"text":"In Germany, Dieselgate Spurs Accusations Of U.S. Economic Warfare"}
{"text":"30 Year Law Enforcement Expert Witness Testifies in Deposition that officers may have Planted \"knives\" in Wayne Jones Case"}
{"text":"Top Ten Soros Targets in 2016"}
{"text":"Just in: Latest Paris \"Terrorist\" Hoax"}
{"text":"Meet the IDF Facebook-Twitter Commando"}
{"text":"China plunges 7 points on opening, shuts down"}
{"text":"Boston Marathon bombing survivor Kevin White dead at 37"}
{"text":"American charged in bomb attack on U.S. military base in Afghanistan"}
{"text":"The fanatical dogma of Alex Jones: How the right-wing huckster has made conspiracy theories into a religion"}
{"text":"US Taking 100k Muslim Refugees Per Year Since 2009"}
{"text":"Barack Obama, His Mother, and the CIA (repost)"}
{"text":"I feel like this should be left here, just for a reminder of how the system works."}
{"text":"Hillary Clinton on UFO's and area 51."}
{"text":"Colonel Gaddafi warned Tony Blair of Islamist attacks on Europe, phone conversations reveal"}
{"text":"40 Million Badass Birders Just Declared War On Oregon Terrorists"}
{"text":"Oregon stand off: would you guys wwnt them to stay or go?"}
{"text":"Playing the government’s game: When it comes to violence, we all lose"}
{"text":"Ammon Bundy took out $530,000 federal loan - CNN.com"}
{"text":"Saudi Arabia Fueling Sectarianism to Destabilize the Region and Suppress Domestic Dissent"}
{"text":"American War Crimes, Yesterday, Today, and Tomorrow - America Revisits the Dark Side: Candidates Compete to Promise the Most Torture and Slaughter"}
{"text":"Brazil's Lula summoned to testify in bribery case"}
{"text":"People Laughing At The Truth"}
{"text":"Florida professor who suggested Sandy Hook and other mass shootings were a hoax designed by the Obama administration to boost support for gun control was fired"}
{"text":"This is a music video a friend of mine made called The Police State, thought it might be appreciated here! (NSFL)"}
{"text":"Why are you so against global unification?"}
{"text":"The Disingenuous Apologies for Israel’s Assault on Palestinian Education"}
{"text":"Taylor Swift - Out Of The Woods : Illuminati EXPOSED!"}
{"text":"A Recommended Honorable Exit Strategy For Ammon Bundy"}
{"text":"Star Wars Connections"}
{"text":"Oklahoma earthquakes extraordinary? Geologist says they are normal. 151 quakes in 30 days"}
{"text":"BFP Exclusive Report- A Distillation of DOD Funding Priorities for December 2015"}
{"text":"Juanita Broaddrick: ‘It Never Goes Away.’ \"I was 35 years old when Bill Clinton, Ark. Attorney General raped me and Hillary tried to silence me. I am now 73....it never goes away.\""}
{"text":"Polysorbate 80: A Risky Vaccine Ingredient ~ \"May cause adverse reproductive effects based on animal test data. No human data found. May cause cancer based on animal test data. No human data found.\""}
{"text":"A Wider Angle on Vaccines and the Immunity Thing"}
{"text":"The war on drugs; a business decision."}
{"text":"Administering Vaccines Against a Person’s Wishes is Illegal ~ \"For those who oppose coercive vaccination policies and want to convince the government that their discriminatory legislation will backfire, this may just be a quick, inexpensive option.\""}
{"text":"Florida Atlantic University Professor Fired After Publicly Stating Sandy Hook Was a Hoax"}
{"text":"The most checked out book from the United Nations library in 2015 was \"Immunity of Heads of State and State Officials for International Crimes\""}
{"text":"Where Foreign “Experts” and “Political Scientists” on Russian Television Come From"}
{"text":"Is Donald Trump's campaign calculated?"}
{"text":"Media response to mass shootings"}
{"text":"Saudi warplanes attack Iranian embassy in Yemen – Iran"}
{"text":"Texas trooper who arrested Sandra Bland indicted for perjury, fired"}
{"text":"Journalist på Forbes, Frances Coppola on Twitter: \"I think we will find they were indigenous people paid to do it to stir up hatred of refugees.\""}
{"text":"Journalist on Forbes, Frances Coppola on Twitter: \"I think we will find they were indigenous people paid to do it to stir up hatred of refugees.\""}
{"text":"The \"refugee crisis\" and \"gender equality\" - Altruism or self interest?"}
{"text":"Caravan To Midnight - Ryan Bundy Reports In From Oregon Standoff"}
{"text":"NASA Calls Off Next Mars Probe Mission Due to Instrument Leak"}
{"text":"yrian Terror Commander caught on video having sex with his granddaughter + Video"}
{"text":"Why Do Americans Work So Much?"}
{"text":"Obama Oversteps His Authority With Gun Orders"}
{"text":"3-month-old methane leak in Southern California now a state of emergency • \/r\/news"}
{"text":"“Cultural Marxism” is scare propaganda for sad losers"}
{"text":"Chuck Baldwin -- Burns, Oregon, Is Not Bundy Ranch"}
{"text":"The Father of Online Anonymity Has a Plan to End the Crypto War....with goverment backdoor"}
{"text":"Forbes journalist pins Cologne NYE riots on right-wing anti-immigration lobby"}
{"text":"Ugly Shapeshifting Plasma Demon ( Un-deniable proof of the supernatural in our skies)"}
{"text":"FDA Rules Chemicals In Pizza Boxes Are No Longer Safe"}
{"text":"The Hitler Conspiracy in 10 Minutes with Kristan T Harris"}
{"text":"Examining US Twitter Mentions Reveals America’s Top News Distractions in 2015"}
{"text":"At least 65 killed in bomb attack on Libya police training center"}
{"text":"After seeing Obama's gun speech the other day I couldn't help but to think...."}
{"text":"Clearest evidence of Building 7 controlled demolision that I've seen"}
{"text":"EXCLUSIVE: Stolen valor: The militiaman bodyguard of ranchers Cliven and Ammon Bundy is falsely posing as a US Marine who served in Afghanistan and Iraq"}
{"text":"C8 already is the tobacco of the chemical industry — a substance whose health effects were the subject of a decades-long corporate cover-up. C8 is in the blood of 99.7 percent of Americans. Eight companies are responsible for C8 contamination in the U.S. DuPont being the largest."}
{"text":"Hillary Clinton Claims She Will \"Get to the Bottom\" of UFOs"}
{"text":"Obama Illuminati Executive Orders: 666 \"Beast Tech\""}
{"text":"Hey NASA: Space Is Very Windy In Your First Space Walk Because..."}
{"text":"(xpost: TIL) TIL in 2005 a glitch in World of Warcraft allowed a plague to spread in the game leading non-infected players to abandon cities while those infected were forced into quarantines. It was later studied by epidemiologists to see how real life people would react to a pandemic."}
{"text":"US tourists claim to have filmed video of UFO above the Large Hadron Collider"}
{"text":"Documents Show JFK Was Murdered Days After Demanding Answers About UFOs From The CIA"}
{"text":"Anybody watched The Big Short yet?"}
{"text":"Showdown in Oregon: How to - and How Not to Fight Tyranny"}
{"text":"sucking facebook dick. reddit damage control iama about the oculus rift release with a price double of what they promised. top post\/questions deleted because you can't stop sucking facebook dick. they have the money for the advertising on advance publications media network"}
{"text":"My friend made this music video \"Police State\" and I thought you might appreciate it here (nsfl)"}
{"text":"The Simpson's Masonic Truth - Stonecutters Initiation and Song"}
{"text":"Foreign Policy Diary - North Korea: Hydrogen Bomb Test"}
{"text":"Good compilation of recent Chipotle food poisoning news"}
{"text":"China Attacks North Korea over Nuclear Tests"}
{"text":"Clinton: Oregon militia 'should be charged' with trespassing @CNNPolitics"}
{"text":"What does our community have on Mark Levine?"}
{"text":"Founder of Anti-GMO movement apologizes for starting the movement and admits GMO's are beneficial for humanity"}
{"text":"Showdown in Brazil"}
{"text":"Is wikileaks controlled opposition?"}
{"text":"Edward Snowden to his 1.74 million Twitter followers: \"Without Tor, when you walk the streets of the internet, you're always watched\""}
{"text":"Berlin, Cologne, Hamburg, Stuttgart, Dusseldorf... New Year's Migrant Sex Assault In Every Major German City"}
{"text":"Terror trial collapses after fears of deep embarrassment to security services. Swedish national Bherlin Gildo’s lawyers argued British intelligence agencies were supporting the same Syrian opposition groups as he was"}
{"text":"Ken O'Keefe - World Citizen Solutions Crowdfunding"}
{"text":"Refugees in Finland was prepared to do the same mass attacks, as in Cologne, said the Helsinki police"}
{"text":"Has a Peaceful Protest over Government Over-reach Been Corrupted by Outside Influence in Burns, Oregon? - Boiling Frogs Post"}
{"text":"U.S to sell 5,000 hellfire missiles to Iraq, worth $800 million"}
{"text":"Ron Burkle raised $10 million for the Clintons. Now, he has almost nothing to do with them. What happened?"}
{"text":"Free speech? Florida university ousts professor who called U.S. massacres hoaxes"}
{"text":"An EPA report that said fracking was safe is now being disputed by its own scientists"}
{"text":"Israel paid US senator $960,250 to sabotage Iran deal."}
{"text":"Bees threatened by a common pesticide, EPA finds"}
{"text":"Monsanto has invested millions in these 11 startups"}
{"text":"Conspiracy Theory Terrorist"}
{"text":"Mass Sex Attacks in Stuttgart, Hamburg"}
{"text":"geometry 101"}
{"text":"Anonymous Letter to SEC warns of 'Fear Bots'"}
{"text":"Former NSA officer William Binney: The NSA could've prevented 9\/11"}
{"text":"ProPublica Launches the Dark Web's First Major News Site"}
{"text":"Banned from \/r\/news: Police Chief Quits After Shooting Lost Dog At Firing Range"}
{"text":"Special Ops Called to Oregon as \"Fake Militiamen\" Exposed as Fed Provocateurs by Real Militia"}
{"text":"Is the corn\/sugar industry behind aspartame fearmongering?"}
{"text":"How Bibi speaks about 'easily moved' America when he doesn't think the camera is rolling..."}
{"text":"bin Laden's number, geometry 101"}
{"text":"'Domino Effect': Iran’s Revolutionary Guard Warns of Saudi Collapse"}
{"text":"SolarCity Will Eliminate Over 550 Jobs Due to Nevada's Anti-Rooftop Solar Decision"}
{"text":"As the Powerball approaches a record 675 million, remember this."}
{"text":"Shocking Connection: 97% of all Terminal Cancer Patients Previously Had This Dental Procedure"}
{"text":"30 Solid Scientific Studies That Prove Vaccines Are Linked With Autism » The Event Chronicle"}
{"text":"What happened to the SLC daycare??"}
{"text":"Sobering Analysis"}
{"text":"Kentucky Bill to Block ALL Federal Gun Control from Past, Present and Future"}
{"text":"What are these mysterious Vietnamese 'space balls'? Country's defence officials are baffled by metal spheres that have fallen from the sky"}
{"text":"Transcripts Of Tony Blair's Chats With Gaddafi Reveal Former PM Urging Libyan Leader To 'Stand Aside'"}
{"text":"Coming Financial Crash: The Possibility of QE4"}
{"text":"German Minister: Critics Of Cologne Migrant Rapists Are ‘At Least As Awful’ As Rapists Themselves"}
{"text":"Lessons Learned From The Suicide Of A Conspiracy Theorist (2016)"}
{"text":"5,000 Swiss Army Troops Will Protect World's Billionaires During Annual Davos Boondoggle"}
{"text":"DHS Militia Extremist Movement Reference Guide. Excerpt: \"New World Order: This conspiracy is described by militia members as a plot by a secret cabal of powerful individuals whose alleged goal is to create a one-world socialist government under the auspices of the United Nations.\""}
{"text":"Is The World Ready For This? Countries Across Planet Prepare For Crash Landing"}
{"text":"Mysterious rays of light began radiating from the pyramids around the world"}
{"text":"DuPont concealed decades-long chemical pollution linked to kidney cancer, testicular cancer, thyroid disease, high cholesterol, and ulcerative colitis."}
{"text":"Proof the lotto (Powerball) is rigged! video!"}
{"text":"The Order Following Orcs are the instruments of Evil. Our country is dying a painful death, by killing itself within."}
{"text":"DHS Militia Extremist Movement Reference Guide. Excerpt: \"New World Order: This conspiracy is described by militia members as a plot by a secret cabal of powerful individuals whose alleged goal is to create a one-world socialist government under the auspices of the United Nations.\""}
{"text":"Inside Job."}
{"text":"Leaked documents show Comcast data caps are bullshit - Techdirt"}
{"text":"Trucos para ser más inteligente, será cierto???"}
{"text":"60% refugees are men 17% women."}
{"text":"The tconspiracyreyark conspiracy"}
{"text":"With corruption rampant and living standards falling, Ukraine may become the next failed state that “benefited” from a neoconservative-driven “regime change,” though the blame will always be placed elsewhere – in this case, on the demonized Russian President Putin, writes Robert Parry."}
{"text":"CONSPIR-AWW-CY"}
{"text":"CNN- Cold War, Episode 20: Soldiers of God - 1975-1988 [aired 1998]"}
{"text":"Who Helped Andy Kaufman Fake His Death?"}
{"text":"State of Emergency Post Gone?"}
{"text":"The U.S. mainstream media excludes almost all reporting and analysis that challenges the neocon\/liberal-interventionist “group think” about the supposed Russian threat, but once in awhile a backhand acknowledgement of reality slips through, as Gilbert Doctorow was surprised to find."}
{"text":"German Public Broadcaster Apologizes for Suppressing Report About Migrant Attacks"}
{"text":"My Saudi Arabia\/Iran conspiracy theory."}
{"text":"Inside the Garden of Political Town Hall Plants"}
{"text":"Is The U.S. Dollar Going To Collapse?"}
{"text":"U.S. legislators pull another 'Patriot Act,' quietly pass new surveillance law opposed by American voters"}
{"text":"Something fishy going on in gw..."}
{"text":"Rage-clicking in the Divide and Conquer New Year - #NewWorldNextWeek"}
{"text":"Like clockwork.. SPLC at it again."}
{"text":"Conspiracy Theory: all of Leonardo's model girl friends are actually the same woman under different names."}
{"text":"Celebrity Tila Tequila Says She Is A Clone, Microchipped Behind Her Right Eye"}
{"text":"Is Donald Trump's Campaign Calculated?"}
{"text":"do we have harts mabye nt"}
{"text":"An attempt to organize a communal push to outfight the corporate media"}
{"text":"Former U.S. attorney: Clinton could face criminal indictment"}
{"text":"WikiLeaks Reveal What the US Really Thinks of Henry Ramos Allup"}
{"text":"Is there a sub just for conspiracy based music? If not there should be."}
{"text":"Opinion: Squirrels are bigger threat than hackers to US power grid"}
{"text":"Regarding the North Korean Nuclear Test: \"And what’s important to understand is that this is in the context of an unended state of war. You know, the 1950-to-’53 Korean War never ended.\""}
{"text":"Relatives of missing MH370 passengers insist loved ones are being held prisoner"}
{"text":"The Life of Adam (Lanza), a new video from the makers of \"We Need to Talk about Sandy Hook\", providing an in-depth look into the alleged school shooter"}
{"text":"Unprecedented sex harassment in Helsinki at New Year - Finnish police reported Thursday an unusually high level of sexual harassment in Helsinki on New Year's Eve and said they had been tipped off about plans by groups of asylum seekers to sexually harass women."}
{"text":"Abraham's Pharaoh was not King of Egypt"}
{"text":"Europe under Attack. Sex Attacks as a Warfare Tactics. Rape Epidemic Explained."}
{"text":"It's revealed Austrian police have ALSO covered up identical gang assaults"}
{"text":"Dashcam video shows Florida woman died after being forced out of hospital in handcuffs"}
{"text":"Wall Street sinks as China turmoil hits global shares. Dow loses 900 points in 4 days. Prepare for QE4."}
{"text":"Amsterdam square new years eve - the new face of Europe"}
{"text":"Silicon soul: The vain dream of electronic immortality"}
{"text":"Conspiracy con artist Jordan Maxwell Jewish? Yes, says scam artist victim"}
{"text":"A Conspiracy Theory Has Surfaced Positing That The CIA Assassinated JFK Over UFOs"}
{"text":"\"The Vaccinated Girls\" A Danish documentary about HPV Vaccine (now recommended by the US CDC)"}
{"text":"New Jersey High Schooler Sent to Principal’s Office for “Anti-Israel” Tweets (Sorry for Gawker)"}
{"text":"Who is Jeb Bush, Really? - Part 1"}
{"text":"POL Sex Between Legislators And Lobbyists Defined As \u0091Gift\u0092 In New Bill"}
{"text":"Sex Between Legislators And Lobbyists Defined As \u0091Gift\u0092 In New Bill"}
{"text":"Oregon standoff opens another front in old \u0091Sagebrush Rebellion\u0092"}
{"text":"Is \"democracy\" turning into a totalitarian regime?"}
{"text":"How did this guy use a computer to choose the winning lottery numbers when the numbers are (supposedly) picked by air mix or gravity pick machines?"}
{"text":"UFO Appears in Tucson Arizona Electric Skies"}
{"text":"The US Revisits the Dark Side: Candidates Compete to Promise the Most Torture"}
{"text":"Britain's most radical Muslim cleric, MI5 agent?"}
{"text":"\"Millions of Westerners, who had never met a German or Japanese, were inflamed with murderous hatred... If it can be done against Germans and Japanese, it can be done against the Islamic peoples - and it is being done since 1947 against the Palestinians and Israel's neighbors.\""}
{"text":"Sounds like they arent leaving just yet."}
{"text":"Stop the constant Windows 10 nagging"}
{"text":"Important Reminder: Victoria Nuland's phonecall to Wyatt regarding the future of Ukraine's govt."}
{"text":"\"We Came, We Saw, He Died\" – Revisiting The Incredible Disaster That Is Libya"}
{"text":"The 9\/11 Stand Down; How Bush And Rumsfeld created a Stand Down"}
{"text":"Saudis Fan Flames of Sunni-Shi'a Strife Bred in Iraq Invasion"}
{"text":"6 Insane Things The Government Says Are Healthy"}
{"text":"The Coordinated Sex (False Flag) Attacks in Germany"}
{"text":"High Schooler Criticizes Israel on Twitter, Now Faces Expulsion"}
{"text":"Charlie Hebdo cover: The murderer is still at large."}
{"text":"Missing U.S. Hellfire missile located in Cuba"}
{"text":"[1980s] United Press International reports on Israel's early funding of Hamas as a counterweight to the PLO"}
{"text":"Revolutionary Illuminati Numerology: World War 3 &amp; Pythagorean Geometry of Time for New World Order"}
{"text":"Flat earth delusion outed as government psychological operation."}
{"text":"China sets course to defeat poverty by 2020"}
{"text":"Were the Middle Ages devised to construct a fake \"Grand Duchy of Lithuania\" in order to deprive Russia of \"Ukrainian\" territory?"}
{"text":"CrossTalk: Saudi's World, with Alex Vatanka, Pete Hoekstra, and Mohammad Marandi (US rep. gets his head handed to him by the Iran rep.)"}
{"text":"Google, Facebook, et. al. Plan to Blanket the Earth with Microwave Radiation"}
{"text":"r\/worldnews mods have now created their own post on the topic they were censoring just days ago"}
{"text":"Worth Posting Again. \"The American Dream Film Part 1 HD\""}
{"text":"Neal Conan shuts down building 7 caller on NPR's \"What's the talk of the nation?\""}
{"text":"PROJET CAMELOT BLACK EXTRATERRESTRIAL CIA COVERUP"}
{"text":"@POTUS mentions conspiracies, including #JadeHelm during CNN Guns In America town hall"}
{"text":"Milo Yiannopoulos interviews Meredith Patterson and Eric Raymond"}
{"text":"Man exposes Keshe's Magrav technology to be a fraud with a full proof test of Keshe's magrav unit."}
{"text":"Current psyop in TIL. OP's link is about US supplying jihadist literature to Afghan school children. Random Redditor claims it was really hard to find two pages of the book. Another random redditor claims to have translated it. Rest of the comments pretending OP's link is a big lie."}
{"text":"@POTUS addresses the \"conspiracy\" that \"we are creating a plot to take everybody's guns\""}
{"text":"RT Interview with Michio Kaku -- he gets progressively more aggressive with the host, \"Who was behind 9\/11???\" (@4:27)"}
{"text":"Population Control - Not For the Squeamish BUT A Must Watch!"}
{"text":"Ask r\/conspiracy Where are all of the Hillary Clinton supporters? She is clearly doing well in the polls but I haven't met or talked to anyone who supports her."}
{"text":"China's \"Sesame Credit\" A Blueprint For The West"}
{"text":"The Hebrew Year 6000"}
{"text":"Anders Behring Breivik, a Man Ahead of His Time?"}
{"text":"Eight Doctors Who Mysteriously Died Knew This “Hidden Cure” For Cancer And Autism"}
{"text":"Ashkenazi Jew speaks the truth Black people are 12 Tribes‬ of Israel"}
{"text":"George Soros sees echoes of 2008 crisis"}
{"text":"Here's What Happened When These Unarmed Native American Sisters Defended Their Land from the Feds"}
{"text":"Back in December, Rand Paul Introduced a Bill to Block Obama's Executive Order on Gun Control"}
{"text":"Militant Christians Cannot Be True Disciples of the Prince of Peace"}
{"text":"Burns Oregon Paiute Tribe: Militants need to get off 'our land'"}
{"text":"China's \"Sesame Credit\" A Blueprint For The West"}
{"text":"Orchestrated class\/racial\/religious based waged discrimination in the American job market. Destroying the economy from the inside out. Read further for details."}
{"text":"good job guys"}
{"text":"Whose Is It?"}
{"text":"something funny lookin about this, cant put my finger on it.."}
{"text":"Just like Bundy Ranch, the Hammonds’ Ranch is valuable to the BLM – Here’s just how valuable"}
{"text":"Chris Mintz: The \"GoFraudMe\" Second Most Money Ever Raised on this Black..."}
{"text":"This immigrant sexual assault scandal smells like a manufactured Streisand effect"}
{"text":"US Army National Guard Planes Are Literally Falling Apart Mid-Flight"}
{"text":"Axis of Hostility? US Rejected North Korea’s Offer to Suspend Nuke Tests"}
{"text":"The intercept calls the media out for not publishing anything negative about Israel."}
{"text":"TIL there was another skyscraper that was hit by an airplane in Manhattan, but way back in 1946. That 71 story building is now known as the Trump Building."}
{"text":"Thomas L. Friedman in The New York Times calls for further restricting civil liberties in order to prevent another 9\/11-style terrorist attack, \"because if there’s one more 9\/11, many voters will be ready to throw out all civil liberties.\" Basically, destroy the village in order to save it."}
{"text":"Bristol Palin cheated on her former fiancee, got pregnant, but is saying publicly the ex-fiancee is the father. The ex-fiancee knows the truth, but is now seeking custody and child support, either to extort her or to troll her into admitting her sluttyness."}
{"text":"The FBI sniper that murdered Mrs. Weaver and her child at Ruby RIdge was brought in to Waco to murder women and children there, and he did."}
{"text":"Former Dallas Fed President blames Fed not China for stock market plunge. Admits to manipulating equity markets"}
{"text":"Is \/anarchism on the same page as worldnews for covering up immigant rape?"}
{"text":"US Congress Passes Repeal of Obamacare, President Set to Veto - Wow! The criminals in Congress did something right -The Apocalypse must be tomorrow"}
{"text":"Obama Should Focus on Beating Daesh, Stop Violating US Citizens' Gun Rights"}
{"text":"This Is The Disturbing Truth Of How The Elites Stay In Power"}
{"text":"A handy recap of the New Middle East Project"}
{"text":"The response to the mass rape of German women by Arab Men."}
{"text":"ELI5: What's going on in Oregon?"}
{"text":"Court orders Google to pay Dr Janice Duffy $100,000 plus interest for not removing her from Google Search"}
{"text":"2016 Blockbusters"}
{"text":"US Dietary Guidelines Committee funded by fast food corporations"}
{"text":"Missing U.S. Missile Shows Up in Cuba"}
{"text":"INB4 SHILLS CONTROL THE SUB"}
{"text":"Helping your young child prepare for their first TSA encounter"}
{"text":"The 2011 Norway attacks were two sequential lone wolf terrorist attacks by Anders Behring Breivik against the government, the civilian population, and a Workers' Youth League (AUF)-run summer camp in Norway on 22 July 2011. The attacks claimed a total of 77 lives."}
{"text":"The truth about Tenn. traffic cameras"}
{"text":"After Ruby Ridge and Waco, authorities keep a low profile in Oregon"}
{"text":"Hillary Clinton Gun Control, Pure Coincidence"}
{"text":"Ted Cruz forfeited his Canadian citizenship. There are rumors that his mom was a Canadian citizenship. Could he be a stateless person?"}
{"text":"Could somebody link me to the post about the Scientology compound post where the police were refused entry several times, and multiple died within it? Was posted within the last few days"}
{"text":"Refugee from Syria among 2 arrested in US for alleged ties to Islamic State"}
{"text":"Congressman questions if Army Special Forces denied rescue force, fire support"}
{"text":"Band of Brothers; Propaganda?"}
{"text":"Ted Cruz: A stateless person?"}
{"text":"Obama gets owned by intellectual woman at his own gun debate."}
{"text":"CNN engages in government propaganda, lies about doctors not reporting you to the FBI under new Obama gun control measures, while in the same article confirming that under a loophole they invented they do actually report you to the FBI and invade your privacy and doctor-patient confidentiality!"}
{"text":"FBI seeks public's help to fill 18-minute gap in San Bernardino attack | Oh, I think we know..."}
{"text":"Bundy Militia member tells County Sheriff that the government is constitutionally obligated to honor the 'Redress of Grievances' document they submitted in writing"}
{"text":"The Social Media Influence Engine, an \"advanced intelligence weapon...The use of social media as a tool of modern military operations in times of con-flict, war, uprising and terrorism is now mandatory. The time for the passive use of social media is over.\""}
{"text":"Should foreign born persons be able to become President of the United States?"}
{"text":"Turkey Slams Iranian Reports Linking Erdogan to Execution"}
{"text":"Some video of the Cologne mass Muslim attack \/ rape."}
{"text":"US missile disappears, turns up in Cuba"}
{"text":"Obama slams NRA 'fiction,' 'conspiracy' theories at town hall on guns"}
{"text":"German Phone Card, Shaky ID for Paris Police Attacker"}
{"text":"The Life of Adam"}
{"text":"Why Would Lenny Pozner, Alleged Father of Sandy Hook Victim, Be Pushing A Fake Death Certificate Of His Deceased Child?"}
{"text":"China Hospital Bulldozed With Patients Inside, Morgue Buried"}
{"text":"China Hospital Bulldozed With Patients Inside, Morgue Buried"}
{"text":"N.J. Muslims’ concerns remain in NYPD spying case"}
{"text":"Marco Rubio heckled at rally in Dallas, Texas"}
{"text":"Trump and Clinton are friends. Trump's purpose is to ensure Hillary wins."}
{"text":"China Hospital Bulldozed With Patients Inside, Morgue Buried"}
{"text":"US Government For Dummies"}
{"text":"Time Is Running out for US Plan to Smash Russia Finances (Pepe Escobar)"}
{"text":"9\/11 Citizens' Commission - 15. Indira Singh Sibel's Letter Ptech"}
{"text":"Cancer deaths hit their lowest rate in decades"}
{"text":"Obama's Executive Action on Gun Control | True News"}
{"text":"Elvis Presley Didn't Die - Conspiracy"}
{"text":"Do you believe in ghosts? HELP"}
{"text":"Rage-clicking in the Divide and Conquer New Year - #NewWorldNextWeek"}
{"text":"Company Caught Selling Fake Lifejackets to Refugees After Drowned Bodies Wash Ashore"}
{"text":"Netanyahu: Rabin’s Murderer?"}
{"text":"Revealed: White House seeks to enlist Silicon Valley to 'disrupt radicalization'"}
{"text":"Obama admits to a conspiracy to take away your guns"}
{"text":"Can we just take a moment to appreciate the vast gulf between reality and how the Mainstream Media displays reality?"}
{"text":"Calls for Michigan Gov. Snyder's Arrest as Flint Poisoning Scandal Implicates Top Staffers: 'To poison all the children in an historic American city is no small feat'"}
{"text":"53 False Flags that Governments admit to doing throughout history"}
{"text":"Barack Obama slams gun lobby 'fiction' and conspiracy theories"}
{"text":"Citizen Writes To Cancer Organization and Points Out HPV Vaccine Isn't Scientifically Proven To Stop Cancer, But Is Proven to be Deadly - Opens Up Full-Blown Scientific Debate"}
{"text":"Is Marco Rubio a sleeper agent for Netanyahu? Why else would the GOP presidential candidate oppose US intelligence keeping an eye on Israel?"}
{"text":"There's a group of smart people building a sustainable city qetema.org \/ jails need to be homeless houses with farms"}
{"text":"One of the first people to talk about the Illuminati publicly? Anyone know who they are talking about here?"}
{"text":"Wesley Clark Confronted on 9\/11"}
{"text":"Obama: You're a Conspiracy Theorist if You Think He Wants to Confiscate Your Guns"}
{"text":"Project MK Ultra is just one of the shocking CIA's experiments. The question is, how many weird experiments are going on right now that we don't know about."}
{"text":"Former CEO of Federal Reserve Bank of Dallas admits current state of market was manipulated to \"create a wealth effect\" to jumpstart the economy - \"there may well be a payback period\""}
{"text":"Obama -- \"Are you suggesting the notion that we are creating a plot to take everybody's guns away so we can impose martial law is a conspiracy? Yes, it is a conspiracy.\""}
{"text":"Headline: \"Obama mocks 'conspiracy' at forum on gun control\""}
{"text":"A List Obama Lies, Scandals and Quotes."}
{"text":"The Younger Dryas flooding may be the basis for the Biblical Flood story."}
{"text":"Autistic Israeli teenagers who would otherwise be exempt from military service have found a place in Unit 9900, a selective intelligence squad where their heightened perceptual skills are an asset"}
{"text":"911 Commissioner Bob Kerrey claims 911 was a 30 year conspiracy"}
{"text":"Obama Lies, Scandals and Quotes"}
{"text":"Unprecedented sex harassment in Helsinki at New Year: police"}
{"text":"Serbian national lottery is rigged: Arrests made after winning number appeared on screen before it was drawn"}
{"text":"What Will Happen to America in 2016? SOMETHING BIG IS COMING..."}
{"text":"Rules for Radicals. Barack Obama has been following those rules one by one!"}
{"text":"Gaddafi warned Blair his ousting would 'open door' to jihadis. \"They want to control the Mediterranean and then they will attack Europe.”"}
{"text":"Just a feeling about all the \"NYE assaults against women\" in Europe."}
{"text":"9\/11's \"Official\" Story Simplified - Video Comic Book with credit where due(see description and top comment)"}
{"text":"Study Proves Maidan Snipers in Ukraine Were Western-Backed Opposition’s False Flag"}
{"text":"Robert Reich on Ending the Vicious Cycle of Wealth and Power - America has succumbed to a vicious cycle in which great wealth translates into political power."}
{"text":"(How to) Find out who's a Snitch (for Dummies) \/ 10 Ways to Spot an Informant"}
{"text":"Obama on \"Conspiracy\" To Take Away Guns: \"The United States Was Born Suspicious Of Some Distant Authority\""}
{"text":"ISIL claims Cairo attack on Israeli tourists- none killed or wounded, however"}
{"text":"State Department Misses Court Deadline for Clinton Emails"}
{"text":"Silicon Valley firms warn U.K. against 'dangerous' changes to law"}
{"text":"Belgium says found possible Paris attacks bomb factory in December raid"}
{"text":"Belgian police find Paris fugitive's possible bomb-making hideout"}
{"text":"Campbell Soup to voluntarily label all U.S. products for GMO ingredients"}
{"text":"Europe's governments may be desperate to cover it up but Cologne proves that many Muslim men have NO respect for white women"}
{"text":"Former federal prosecutor says Hillary Clinton could be indicted in next 60 days"}
{"text":"General Wesley Clark: Wars Were Planned - Seven Countries In Five Years"}
{"text":"The Powerball PowerScam"}
{"text":"Much of Official Washington still toes the Saudi line against Iran – in part because Israel shares that hostility – but that antagonism is putting the world at greater risk as Saudi Arabia demonstrates increasingly reckless and barbaric behavior, the sign of a declining power, says Trita Parsi."}
{"text":"GM knowingly rejected ignition fix that would have cost 90 cents per unit, leading to at least 125 deaths"}
{"text":"Doctors Urge California Residents \"Leave Now...While You Can\" As Gas Leak Fears Grow"}
{"text":"Libyan Rebels Form Their Own Central Bank. (March 2011)"}
{"text":"Cologne top cop caught in NYE sex-assault cover-up claims"}
{"text":"Lenny Pozner’s HONR Network: The Fine Art of Online Stalking and Harassment"}
{"text":"Leaked Cables: US Bureau of International Information Programs Used to Counter Conspiracy Theories, has Over 700 \"American Spaces\" Abroad"}
{"text":"\"One of Hillary Clinton’s closest advisers told her that Barack Obama should use a deadly hurricane to boost his re-election campaign\""}
{"text":"Ron DiFrancesco (9\/11 survivor)"}
{"text":"[question] is there any real chance for Bernie Sanders to win this election?"}
{"text":"The Obama administration is quietly trying to make it harder to study public officials"}
{"text":"Banks could be decimated at they approach an \"Uber moment\""}
{"text":"Reddit is tracking what you do on the Internet."}
{"text":"Swirling ‘UFO Gateway’ Appears Over Large Hadron Collider In Bizarre Video"}
{"text":"Moderator selection criteria and commitments - discussion."}
{"text":"America Supports the Islamic State, Provides Advanced Weapons to ISIS Terrorists: Iraqi MP"}
{"text":"Kindly suggest some documentary or article to understand from basic to what's there role today about Illuminati and Rothechilds in simple way possible."}
{"text":"Hillary Orders COS to Transmit Classified Material After She Orders Documents Declassified"}
{"text":"TransCanada Sues the U.S. for $15B for Rejecting Keystone XL. Will This Be the New Normal Under TPP?"}
{"text":"Electromagnetic Energy In The Air"}
{"text":"Media Blackout: NATO Returns to Libya"}
{"text":"Organic Farmers Win GMO Fight in Jackson County, Oregon"}
{"text":"‘We Caved’ - What happened when Barack Obama’s idealistic rhetoric collided with the cold realities of war and dictatorship in the Middle East and beyond"}
{"text":"AIPAC is the most prominent governmental lobbying organization on behalf of Israel. Fortune Magazine typically rates it as the second most powerful lobby in the U.S"}
{"text":"Pippa King On Why An Irish Sausage Company Is Pushing RFID Chips On Children"}
{"text":"How Michigan literally poisoned an entire city to save a few bucks"}
{"text":"So.. What's Wrong with a Little Torture?"}
{"text":"Paul McCartney’s 1966 Death Conspiracy Goes Deeper Than We Thought"}
{"text":"Police Use Social Media for Entrapment: Ongoing Facebook\/Craigslist Sting"}
{"text":"Cologne Rapefest: The Top Five \"Best\" Excuses"}
{"text":"Cologne Rapefest: The Top Five Best \"Excuses\""}
{"text":"UK: Police 'used terror powers to spy on officers blowing whistle on racism' | Exclusive: Cleveland constabulary faces claims it used officers' confidential emails to defend against employment cases"}
{"text":"\"This Is Government Land\": The Eternal Refrain of the Federal Occupiers"}
{"text":"Cologne NYE assaults: 31 suspects identified, 18 of them refugees - \"authorities are cracking down on hate speech against migrants. Germany has reached a deal with social media giants\""}
{"text":"Defense Lawyers Claim FBI Peddled Child Porn in Dark Web Sting"}
{"text":"Neoliberalism Raises Its Ugly Head in South America: As Washington Targets Venezuela, Brazil and Argentina"}
{"text":"Is the Oregon Occupation Being Stage-Managed?"}
{"text":"Organization for the Prohibition of Chemical Weapons (OPCW) Confirms: Rebels Used Chemical Weapons – not Assad | Global Research"}
{"text":"Ex-CIA agent Claims Hitler did not die in Berlin but actually escaped to Argentina"}
{"text":"Activists or Terrorists? How Media Controls and Dictates ‘The Narrative’ in Burns, Oregon"}
{"text":"MSNBC Edits Out Footage | Clinton Broaddrick Questions"}
{"text":"US becoming safer compared to Europe in both fatalities and frequency of Mass Public Shootings: US Now ranks 11th in fatalities and 12th in frequency"}
{"text":"Sandy Hook: Adam Lanza A much closer look"}
{"text":"Controlled by shadow government: Mike Lofgren reveals how top U.S. officials are at the mercy of the “deep state”"}
{"text":"IOF declares Seir closed military zone"}
{"text":"Trudeau Pledge Tracker: Trudeau Ignores Executions and Proceeds with Saudi Arms Deal"}
{"text":"Illuminati Headquarters Found On Google Earth"}
{"text":"Mexico captures fugitive drug lord ‘El Chapo’ Guzman – Good day for ISIS"}
{"text":"Alleged plan to assassinate prime minister thwarted"}
{"text":"I've been using Making a Murderer as a lens in which to see the true logistic potential of other conspiracies"}
{"text":"A Turkish firm sold roughly 1200 fake life vests to refugees fleeing to the sea. The vests soak up water and sink instead of floating."}
{"text":"Shakespeare time. Sir Ian McKellen reads a 2minute speech by Shakespeare on how society treats people who are different (speech starts at 1h04m. live linked to 1h3m)."}
{"text":"Mods of \/r\/cringe delete a post about T Mobile CEO John Legere asking EFF \"Who the fuck are you?\""}
{"text":"Obama Top Recipient of Smart Gun Cash. Executive order could drive millions to his donors."}
{"text":"In Age of Extreme Weather, Industrial Farming Threatens Us All"}
{"text":"New Discovery Around Juniper Backdoor Raises More Questions About the Company, adding the NSA backdoored Dual_EC after it was understood as insecure"}
{"text":"Campbell's Soup Announces Support for Mandatory GMO Labeling"}
{"text":"Documentary: Digital Amnesia (VPRO Backlight)"}
{"text":"U.S. Transfers Two Prisoners From Guantanamo Bay to Ghana"}
{"text":"Esquire just Helped Tila Tiquila start a flat earth conversation. HA\/ yay\/"}
{"text":"Philly Officer Ambushed By Terrorist Who Says He Did it For Islam, Pledged to ISIS"}
{"text":"WikiLeaks Reveal What the US Really Thinks of Henry Ramos Allup"}
{"text":"Philly cop ambushed “in the name of Islam” with … stolen police gun; Update: Got slap on the wrist in 2013?"}
{"text":"Oregon militants brawl as friends beg them to go home: ‘You’re surrounded by informants’"}
{"text":"U.S. ships Hellfire missile to Cuba"}
{"text":"The State Department said there were 38,000 pages of Clinton cybersecurity emails. Now it says there’s only 1."}
{"text":"TEEN girls GANG-RAPED by four Syrian ‘REFUGEES’ in Germany"}
{"text":"Why do so many r\/conspiracy people support Bernie Sanders?"}
{"text":"ON WHY ISLAM IS A FALSE RELIGION : Contemporary German Philologist Christoph Luxenberg"}
{"text":"Chris Hedges Speaks about the Blurring Definitions of Dissent and Terrorism"}
{"text":"Disclosure: Another 41 Foreign-Born Individuals Snagged On Terror Charges; Obama administration withholds details as more attacks occu"}
{"text":"Dark Journalist Interviews Chemtrails HAARP &amp; Space Fence Expert Elana Freeland"}
{"text":"Disclosure: Another 41 Foreign-Born Individuals Snagged On Terror Charges; Obama administration withholds details as more attacks occur"}
{"text":"Tila Tequila Has Lost Her Damn Mind, Thinks The World Is Flat"}
{"text":"Barack Obama Talks To Anderson Cooper About Martial Law ‘Conspiracies’"}
{"text":"Six Huge Stories The Mainstream Media Don’t Want You To Know About | True Activist"}
{"text":"The Israel Project’s Secret Hasbara Handbook Exposed The Global Language Dictionary"}
{"text":"UNITED NATIONS is Bringing the NWO 2016 - EBOLA, ISIS, WW3, Martial Law, Police State, Agenda 21..."}
{"text":"FBI Director Can’t Recall How You Get Guns from the Internet"}
{"text":"Scarborough: MSM Won't Mention Bill Clinton Jeffrey Epstein Connection—But Donald Trump Will"}
{"text":"Campbell's Soup - my two dad's commercial"}
{"text":"US 'Hedge Fund King' Banned By Regulators"}
{"text":"The Vela Incident"}
{"text":"The Vela Incident"}
{"text":"The Vela Incident (Israel purchased nukes from SA)"}
{"text":"Why the Nobel Prize for Literature winner Aleksandr Solzhenitsyn was forgotten? He last book '200 Years Together' was never published into English because shines a light on the jewish role in the Russian Communist Revolution and early Soviet Government"}
{"text":"Homeland Security Official Struggles To Answer Basic Questions About Visas And Security"}
{"text":"After 'Cologne', starving Syrian children are 'suddenly' discovered"}
{"text":"United Nations Vs. United Nations: How a Little Punk Band Fought the Biggest Intergovernmental Agency in the World and Won"}
{"text":"Making a murderer need you \/conspiracy"}
{"text":"Declassified emails from Hillary Clinton about Libya may she'd light on the real reason the United States went into Libya."}
{"text":"1974 Canadian Electors’ List Named Ted Cruz's Parents. Canadian Law Restricts Federal Voting Rights to Canadian Citizens."}
{"text":"Oregon Standoff Set Up To Demonize The Second Amendment"}
{"text":"Juicy Interview: Jesse Ventura Tells Alex Jones about Meeting Putin"}
{"text":"What made you a conspiracy theorist?"}
{"text":"Nebraska Is Torturing Incarcerated Youth for Having Too Many Books, Passing Notes"}
{"text":"A JEWISH student who SPOKE OUT AGAINST THE STATE OF ISRAEL and it's OPPRESSION OF THE PALESTINIAN PEOPLE. The school says that they will pursue legal \"anti-bullying\" action."}
{"text":"Smoking Gun: Email Suggests Hillary Broke Law"}
{"text":"The Weird, Wacky Wonderful World of Israeli Hasbara"}
{"text":"Imran Hosein Interview at the Islamophobia Conference held in Paris"}
{"text":"Texas Gov. Greg Abbott Calls For Convention Of States To take Back States’ Rights- What You Guys Think?"}
{"text":"Digital colonization? Facebook opens up internet org with new 'free' basics apps in India."}
{"text":"FirstBank's VP &amp; ISOPush Looks Beyond Political Rhetoric in the Backdoor Encryption Debate"}
{"text":"David Noakes: \"Governments &amp; Big Pharma Are Colluding To Keep Gc-MAF A Secret!\""}
{"text":"Has everyone noticed the recent plethora of movies being available as torrent download much before their release dates? It gets better."}
{"text":"Pfizer hikes U.S. prices for over 100 drugs on January 1"}
{"text":"Want to see an active brigade in process? As soon as my thread had 8k+ upvotes and hit the top section, it received 1k downvotes in less than an hour."}
{"text":"Pentagon Slush Fund is Draining the Economy and Militarizing Foreign Policy"}
{"text":"The latest case of U.S. Secret Service agents blocking reporters from asking Democratic presidential candidate Hillary Clinton are \"dangerous,\" and could lead to media being threatened for getting too close to the candidate, according to a long-time former agent."}
{"text":"Dallas County Case - Evidence Suppression\/Tampering, Manipulation of Psuedo-Science to secure convictions of an innocent man (Similar to the Steve Avery Rape Case)"}
{"text":"DNC Chair Congresswoman Debbie Wasserman Schultz Confronted Again"}
{"text":"Lottery is rigged: Arrests made after winning number appeared on screen before it was drawn"}
{"text":"DoS FOIA email implies that Google and Al-Jazera assisted the DoSA in \"mapping and broadcasting\" \"atrocities committed by Bashar Al-Assad\""}
{"text":"Colonel Wilkerson: George Bush Сhose Between Invading Iraq, Iran and N. Korea"}
{"text":"Department of State Freedom Of Information Act disclosure documents"}
{"text":"75 Times Obama Broke Law During Presidency"}
{"text":"Canadian Weapons Enroute To Saudi Arabia"}
{"text":"Heavily armed North Dakota man claiming to be Jesus Christ, and Son of JFK and Marilyn Obama, Arrested to Kidnap One of the Obama Family's Dogs."}
{"text":"Heavily armed North Dakota man claiming to be Jesus Christ, and Son of JFK and Marilyn Monroe, Arrested to Kidnap One of the Obama Family's Dogs."}
{"text":"Stratfor creator Jewish Neocon George Friedman: \"Europe will fall appart, Poland should play a leading role, as an instrument of the USA, against Germany and Russia.\""}
{"text":"Iran bans imports of all products from Saudi Arabia"}
{"text":"EPA, FDA stocking up on body armor during President Obama’s watch"}
{"text":"HILLARY FOR PRISON 2016: The Clinton Foundation is \"organized crime at its finest,\" a tax free international money laundering scheme that could be the largest political criminal enterprise in US history - SUBVET45, The Bells Toll for Hillary @ Spectator.org"}
{"text":"Feds paid Amtrak worker to spy on passengers"}
{"text":"Is Masturbation Destroying The Climate?"}
{"text":"Sean Stone &amp; Jim Fetzer on Sandy Hook &amp; Boston Bombing conspiracies"}
{"text":"Wondering if anyone is interested in more I have to say or not.. I am not religious. I do a lot of research into the occult and religion and spirituality and am simply looking to engage in meaningful conversation and\/or help someone else who is searching for truth."}
{"text":"What's with all these polls?"}
{"text":"Galactic Earth brand new novel FREE on Kindle! Please kindly leave your review after Tuesday to let the promo finish. Thank you and Happy2016!"}
{"text":"https:\/\/m.youtube.com\/watch?v=tr5hNL4Q2AU I really just wanna have meaningful conversation regarding religion and its dangers"}
{"text":"Dan Carlin on the Joe Rogan Podcast- How US Politics Works"}
{"text":"HILLARY FOR PRISON 2016: The Clinton Foundation is \"organized crime at its finest,\" a tax free international money laundering scheme that could be the largest political criminal enterprise in US history - SUBVET45, The Bells Toll for Hillary @ Spectator.org"}
{"text":"EPILOGUE: The perpetrators of the Charlie Hebdo shooting in Paris 2 days earlier are both killed after a hostage situation."}
{"text":"Sean Stone &amp; Jim Fetzer on San Bernardino, Sandy Hook &amp; Boston Bombing conspiracies"}
{"text":"Simpsons in year 2000 depicts escalator sequence of Trump in 2015, 'predictive programming'"}
{"text":"The Great Deluge"}
{"text":"Rebekah Roth - Mossad, 9-11 &amp; Israel's Samson Option"}
{"text":"The US Gov Is Planning The Next Event That Will Shock The People Into War"}
{"text":"In the 1980s capitalism triumphed over communism. In the 1990s it triumphed over democracy. ~ David Korten"}
{"text":"Guys in Oregon: Bring up internet voting in 2016 with the press, so we can take our country back. Ranching is important, but isn't the main issue here."}
{"text":"“Criminal in Chief” — 78 Times President Obama Broke the Law During Presidency"}
{"text":"US Government Has Been Moving All Military Assets In Place To Start WWIII - Episode 862b"}
{"text":"Marine Combat Vet Kicked Out of Senate Meeting for Speaking Too Much Truth"}
{"text":"Yet Another Fabricated Jobs Report -- Paul Craig Roberts"}
{"text":"Sex And Blackmail In The Deeper State"}
{"text":"Piers Corbyn On Climate Change, Geo-engineering &amp; The Media Treatment Of His Brother Jeremy Corbyn."}
{"text":"A new birth of freedom."}
{"text":"Hungarian Top Economist - \"The civil war is coming\""}
{"text":"Lets Skin Obama and Boil his kids alive"}
{"text":"Michael A. Hoffman - Overcoming Orwellian Groupthink"}
{"text":"Obama’s Secret Post-Presidency Plan Reportedly Uncovered- Netanyahu Plots Immediate Sabotage"}
{"text":"As comments, articles, and users are censored lately online and in Reddit.... Last September, German authorities formed a new task force including the government, companies, industry associations and activists to tackle the problem of anti-refugee opinion."}
{"text":"Why Low Oil Prices are Economic Warfare"}
{"text":"Homicide victim 212 and my stolen car. Welcome to Maryland where your role as a law abiding citizen is to be a victim."}
{"text":"Pro-Trump comments completely censored in \/r\/AskReddit. Still think reddit isn't controlled?"}
{"text":"Anglo-Saxon Federation of America - founded in 1933, is the oldest and largest group in the British Israelite movement"}
{"text":"Debunked: Simpsons depicts Trump escalator scene in 2000, 15 yrs before the actual event \"predictive programming\""}
{"text":"9\/11 - Qualified Experts"}
{"text":"Is THIS the SR-72 spy plane? Mystery aircraft spotted flying over Kansas just weeks after being seen in Texas"}
{"text":"Children tortured before parents, raped, all covered up by Bush\/Cheney and our media"}
{"text":"Has anyone else noticed that the world is getting less liberal?"}
{"text":"[Amazon Prime] -- \"The Russian Woodpecker (2015)\" -- documentary about the cold war's troubling secret, the real reason for the Chernobyl 'accident' and the Russian woodpecker signal whose source was nearby Duga radar tower (electronic warfare)"}
{"text":"Nasa 100% BUSTED using Stop-Motion Animation !"}
{"text":"EPA, FDA stocking up on body armor during President Obama’s watch"}
{"text":"El Chapo Captured? Really?"}
{"text":"Cognitive Diversity: Is The 9\/11 Truth Movement Under Mass Infiltration?"}
{"text":"\"So on the weekend preceding the collapse of the Twin Towers security doors were not secured in the South Tower, security cameras were not operating, there was no lighting, air conditioning, no power at all. And there were many 'engineers' in the building who were not employees of WTC companies.\""}
{"text":"Remember there is always hope and we are not as alone as we think we are."}
{"text":"Bombshell Email Shows Hilary Instructed Advisor to Strip Markings from Sensitive Talking Points"}
{"text":"Video from back in July that I found on my phone. I didn't notice any of that when I was recording."}
{"text":"Saudi Arabia is murdering freedom: How one man was sacrificed to silence a movement"}
{"text":"Why would the CIA run secret brainwashing techniques in current times?"}
{"text":"Hillary Emails Reveal True Motive for Libya Intervention"}
{"text":"Busted! US Helicopters Aiding ISIS in Iraq"}
{"text":"At least 1,340 Clinton emails now known to contain classified material"}
{"text":"Claims by a friend of a friend, contradictory lies to official militia statements, anonymous sources and desperate spin: The media is currently lying and claiming the Oregon militia has divided"}
{"text":"Illuminati fashion mind control"}
{"text":"The FBI Briefly Ran A Child Porn Site On Its Own Servers To Hack Pedophiles"}
{"text":"Brookings Report"}
{"text":"Secret FBI files 'reveal Hitler DID fake death' after WW2 then flew to TENERIFE"}
{"text":"Children tortured before parents, raped, all covered up by Bush\/Cheney and our media"}
{"text":"Former CIA Agent: \"The narrative the government gives us is a lie. You can’t give people the truth because it scares them\""}
{"text":"Apollo 20 Mission"}
{"text":"Remember to vote in the primaries in February and March you have to register 30 or 14 days AHEAD of the following dates. That means NOW Saturday Jan 17 for many of you by mail."}
{"text":"Obama administration plans shake-up in propaganda war against ISIS"}
{"text":"bad news for gang stalkers"}
{"text":"N.J. teen claims school punished her for anti-Israel tweets"}
{"text":"DEA paid Amtrak employee $800K as informant: Report"}
{"text":"Israeli Activist Says He Helps Kill Palestinians Who Sell Land to Jews"}
{"text":"Finally parts of reddit are seeing through the American Sniper fantasies."}
{"text":"Homeland Security Looked Past Militia Movement, Ex-Analyst Says"}
{"text":"Activists or Terrorists? How Media Controls and Dictates ‘The Narrative’ in Burns, Oregon"}
{"text":"nobody but a bigoted conspiracy nut would deny the 6 trillion yen stock gains at the three Japanese megabanks SMFG, Mizuho and Mitsubishi UFJ Financial Group from last year."}
{"text":"This is not a form of brainwashing..."}
{"text":"The Lie That Linked CIA to the Kennedy Assassination"}
{"text":"Philadelphia camera captures ambush of cop by gunman linked to ISIS"}
{"text":"IDF destroy home of terrorist in overnight operation"}
{"text":"A German’s Video Likens Mao to Hitler, and China Wants Him Punished"}
{"text":"This is some Orwellian\/1984 type stuff... Or is this an elaborate hoax?"}
{"text":"Coat of arms of a city called \"Šiauliai\" in Lithuania"}
{"text":"\"The White House meets on Friday with the largest tech companies to discuss how they can help “disrupt” Isis’s online activities. Agenda: censorship and anti-privacy and measures that could affect not just Isis supporters, but everyone who uses the internet.\" (x-post from r\/privacy )"}
{"text":"Insane ways American government is wasting the tax payer money."}
{"text":"Well well, a juror steps forward, steven avery, making a murderer."}
{"text":"Why Sanders is Losing-- SCARED of telling Hard Truths about Hillary"}
{"text":"Former Drone Operator Brandon Bryant talks about the US Drone Campaign (Hardtalk)"}
{"text":"A German’s Video Likens Mao to Hitler, and China Wants Him Punished"}
{"text":"A German’s Video Likens Mao to Hitler, and China Wants Him Punished"}
{"text":"ABSOLUTE BOMBSHELL. THE REAL REASON FOR THE WAR ON LIBYA. STRAIGHT FROM HILLARY'S EMAIL. A CLEAR, BLACK AND WHITE ADMISSION OF NATO'S AMBITIONS IN WRECKING LIBYA. SHARE THIS DOCUMENT WIDELY."}
{"text":"[Intelligence] My ex-girlfriend cheated on me with a friend and I decided to post a link on its page with erotic pictures"}
{"text":"India’s Covert Action Capabilities Stymied By CIA, MI6 Pressure"}
{"text":"\"GCHQ spy agency employs thousands more people than it has publicly declared\""}
{"text":"\"Voice prints are captured at airport immigration counters in some countries, which perhaps explains why you may be asked a meaningless question or two during processing\""}
{"text":"New Better Footage of the Rigor Mortis Dummy in Paris"}
{"text":"A subreddit which violates the Spirit of Reddit and take harassment and brigading to a new level"}
{"text":"Is The Oregon Occupation Being Stage-Managed?"}
{"text":"Panicked US Officials Contacted Merrill Lynch, Continental Bank of Illinois After Alleged Link to False-Flag Bombing in Italy, Secret Document Reveals"}
{"text":"PERMIAN CATASTROPHE UPDATE: On Mars Solar events caused a dramatic fall in air pressure, which vaporized its atmosphere and caused its seas to boil away - On Earth despite all land creatures perished, water pressure prevented the deep sea and lake levels from boiling thus deep water species survived"}
{"text":"Still Report #505 - Elbert Guillory - pretending to fight"}
{"text":"Airbnb unveils ‘Israeli’ vacation rentals in illegal West Bank settlements"}
{"text":"Media lies: 'Veteran' claiming Oregon militia attacked him after he demanded they \"release women and children\". Further trying to push the fake narrative the Oregon militia is split. His group that he belongs to? Their group was only created a few months ago."}
{"text":"Media lies: 'Veteran' claiming Oregon militia attacked him after he demanded they \"release women and children\". Further trying to push the fake narrative the Oregon militia is split. His group that he belongs to? Their group was only created a few months ago."}
{"text":"How deep in a hole must the Saudis be to consider selling the state oil giant?"}
{"text":"The sacred science of the Pineal gland...The greatest secret never told... the sacred secretion..."}
{"text":"\"Conspiracy theories about the conservative party bribing North Korea to act bellicose come election time. In fact, many people in South Korea actually believe this conspiracy theory.\""}
{"text":"'Monsanto get out!' Protests against agro-giant held in Argentina"}
{"text":"'Westminster paedophile ring' police officer DCI Paul Settle investigated by watchdog over claims of leaking material to media"}
{"text":"Captain Janeway on the refugee situation."}
{"text":"CRISIS BY DESIGN: Hungarian PM Reveals ‘Social Engineering’ Role of George Soros in EU Refugee Run"}
{"text":"A Unified Theory of Corruption - The Deep State"}
{"text":"Germany restarts joint intelligence surveillance with US Germany's BND intelligence agency is once again working with its US counterpart on Middle East surveillance. \"Collaboration had been suspended after it was revealed the US was spying on European officials and firms.\""}
{"text":"The Stimulus wanted the Gov. to have expressive medical record disclosure for Gun Control agenda in 2008."}
{"text":"Bombshell Clinton email: The thin veneer of humanitarian intervention falls off NATO, as the truth of the Libya intervention is revealed. It was all about regional supremacy, and particularly about preventing Gaddafi's efforts to establish a gold-backed pan-Afro currency. Please spread."}
{"text":"Czech president: \"[Muslim brotherhood] lacks resources to launch a military invasion of the continent so [is] sending waves of migrants as an alternative force.\""}
{"text":"15 Things That People With High Emotional Intelligence Do!"}
{"text":"“i will never be a slave again”: Chinese immigrant turned citizen defies obama gun grab"}
{"text":"Nazimods at worldnews buried my thread which was 3rd on the front page! https:\/\/www.reddit.com\/r\/worldnews\/comments\/405tub\/police_were_prevented_from_reaching_victims\/?sort=new"}
{"text":"Five mysterious underwater cities that will blow your mind."}
{"text":"Angela Merkel visibly disgusted by German flag - Throws it away during celebration (Not sure where else I could post this with all the censorship these days)"}
{"text":"10,905 results versus 7 results"}
{"text":"Squatters Drill into Sub Laban House"}
{"text":"Tila Tequila Tells The Truth About The Flat Earth"}
{"text":"Jews Lead Gun Control Charge"}
{"text":"My tires have RFID tags in them. Yours probably do also."}
{"text":"Gaddafi accused Blair of ‘supporting Al-Qaeda,’ unseen phone transcripts reveal"}
{"text":"is it possible the blocksize conundrum is being manufactured by conspiracy against bitcoin or am i conspiritarded : Bitcoin"}
{"text":"France suffered more casualties (murders and injuries) from mass public shootings in 2015 than the US has suffered during Obama’s entire presidency (Updated 532 to 396)"}
{"text":"The Life of Adam - Detailed Documentary On Adam Lanza, His Mother, And The Obfuscation Of FOIA Requests"}
{"text":"Entire comment chains missing?"}
{"text":"The US government is using Tax money to bribe company employees to watch \/ spy on customers."}
{"text":"Illuminati Shill Steve Harvey &amp; the Real Miss Universe Scandal"}
{"text":"LIVE: PEGIDA rally to meet counter-protest in Cologne following sexual assault allegations"}
{"text":"Madaya: Syrian regime supporters share food photos to taunt starving civilians trapped in town"}
{"text":"David Wilcock - Wisdom Teachings 19-1: The Wars of Maldek"}
{"text":"Jewish New York High School Student Facing Legal Action for Supporting Palestine"}
{"text":"After Healing His Own Cancer with Cannabis, Self-Taught Doctor Helped over 5000 Patients"}
{"text":"Nebraska Is Torturing Incarcerated Youth for Having Too Many Books, Passing Notes"}
{"text":"After Pot Legalized in Colorado, ALL Drug-Related Charges Drop Significantly, Record Revenue"}
{"text":"Special Ops Called into Oregon as ‘Fake Militiamen’ Exposed as Fed Provocateurs by Real Militia"}
{"text":"Six Huge Stories The Mainstream Media Don’t Want You To Know About"}
{"text":"Campbell Soup to Disclose GMO Ingredients on Labels (cue Campbell ecoli outbreak...)"}
{"text":"Panicked US Officials Contacted Merrill Lynch, Continental Bank of Illinois After Alleged Link to False-Flag Bombing in Italy, Secret Document Reveals"}
{"text":"High schooler accused of violating bullying laws for making anti-Israel tweets"}
{"text":"Iraqi Refugee's Brother Shocked by Terrorism Arrest"}
{"text":"US Government Has Been Moving All Military Assets In Place To Start WWIII"}
{"text":"Berenstain Bears"}
{"text":"When Did Michigan Governor Rick Snyder Find Out About Lead Poisoning in Flint's Water Supply?"}
{"text":"[books] recommended readings... on alternative theories"}
{"text":"The Curious Case of WTC7"}
{"text":"9\/11 Experiments: Newton vs. NIST"}
{"text":"DOJ Acknowledged Significant Gang Stalking Problem In ’06"}
{"text":"WTC 7 - Side by Side Comparison to Controlled Demolition"}
{"text":"How does gravity and fire hurl heavy steel columns laterally 100’s of feet away from the tower?"}
{"text":"Which section will hit the ground first"}
{"text":"Ayn Rand on Fascism"}
{"text":"After Soldier Killed, Circumstances of His Death Met with Skepticism from Special Forces Community"}
{"text":"What does \"Rump, Titty, Rump,Titty,Rump...\" Have to do with Mark Zuckerberg vaccinating his son Max? Maybe it's just all a charade. Take a look at his FB status and you decide."}
{"text":"Twitter Declares War On Conservative Media, Unverifies Breitbart Tech Editor Milo Yiannopoulos"}
{"text":"Monsanto + Syngenta: Agribusiness Giants Get Even Bigger"}
{"text":"Man uses \"Medicated Chest Rub\" to imply that Obama could have staged crying"}
{"text":"The US Has Been Giving Afghan Children Violent Books to Indoctrinate them to Jihad – It Worked"}
{"text":"Warning!!-Companies That Use Technology of the Fallen that every Man and Woman should know about!"}
{"text":"Weird Illuminati\/Antichrist Ritual In Leo Dicaprio's ``The Revenant`` (2016)"}
{"text":"NASA Propaganda - Space Junk Orbits Earth"}
{"text":"Obama Pentagon \"Town Hall\": Attacks Youtube Truthers!!"}
{"text":"A clear, concise list of Hillary Clinton's lies, scandals, and impropriety in government."}
{"text":"The Deeper I Go Into Youtube The More Fascinating Videos I Find. [Adolf Hitler And The Black Jews.]"}
{"text":"Six stories the mainstream media doesn't want you to know about."}
{"text":"Mystery Nazi Box Found in Russian Cave"}
{"text":"Ancient roots to modern geopolitical tensions?"}
{"text":"'Ethical' Co-op Bank leaves Palestinian cause in the lurch"}
{"text":"Katherine Albrecht on Waking Up to Government Tyranny"}
{"text":"White House Raises Encryption Threat in Silicon Valley Summit"}
{"text":"Possible Anti-Trump Conspiracy by Elites"}
{"text":"Jim Willie: ISIS Created by U.S., U.K., Israel, &amp; Turkey"}
{"text":"Shillary Bot at Work [PROOF]"}
{"text":"Protesters set Kosovo govt HQ on fire over deal with Serbia"}
{"text":"A new US law brands journalists and humanitarian workers as terrorist risks"}
{"text":"Clinton Email Hints that Oil an Gold Were Behind Regime Change In Libya"}
{"text":"US gov suggests limiting GM corn cultivation as failed experiment causes superpests to spread"}
{"text":"The Guardian engages in victim-blaming over the Cologne attacks. More evidence that the media is pushing the pro-immigration narrative on us."}
{"text":"Stanley Kubrick's daughter is saying that her father received death threats and had a 45mm semi-auto on or near him always."}
{"text":"Soldiers with autism take on key roles in IDF"}