{"text":"Continuing to believe the 9\/11 Official narrative is a brave act of Humanitarianism"}
{"text":"Revealed:The Capital Of The New World Order"}
{"text":"Winston S. Churchill, Ultimate European Executioner"}
{"text":"Secretary Clinton Comments on the Passing of Robert Byrd"}
{"text":"Live Obama Speech! Let's see what hints he will give us this time!"}
{"text":"Whistleblower alleges corruption inside Office of the Chief Medical Examiner. \"I have a hard time telling families you can`t have an autopsy report if you don`t have $40 when I know we just got paid $6,250 for a brain\""}
{"text":"The government wants your fingerprint to unlock your phone. Should that be allowed?"}
{"text":"Can you say ‘rubber stamp?’ FBI and NSA requests never denied by secret court"}
{"text":"Moon size verses Earth size in photographs prove NASA is hoaxing.."}
{"text":"Had my post removed on r\/Christianity for this! Christians are banning the truth!"}
{"text":"Genetic analysis not so certain after all."}
{"text":"Are FEMA Camps Real?"}
{"text":"\"The New York Times altered and downplayed coverage of the Holocaust in part because of the views on Judaism of its Jewish owner at the time, Arthur Hays Sulzberger\""}
{"text":"\"Holocaust project focuses on what Americans knew and when\""}
{"text":"Zionist lackey Hillary Clinton will Hold Fundraiser in Israel on May 17"}
{"text":"Straight, white QUT students say they are being discriminated against"}
{"text":"Clinton Sex Victims Fear for Their Lives"}
{"text":"TIL that Several of Hitler's Senior Officers were Jews ~ Erhard Milch, Wilhelm Keitel, Walther von Brauchitsch, Erich Raeder, and Maximilian von Weichs."}
{"text":"Reddit is leading to the death of critical thought and open mindedness...."}
{"text":"After trillions, Only One of Six Air Force F-35s Could Actually Take Off During Testing"}
{"text":"Risk of aboriginal insurgency"}
{"text":"Negative health effects from wireless technology exposure linked to Autism"}
{"text":"C-SPAN Stream: Clinton Precinct Chair lied about the vote counting in Precinct 43 and it was all caught on camera."}
{"text":"Weird Circles (Question + More Info In Comments)"}
{"text":"Global Mind: Transhumanism, Freemasonry and the Internet as God:"}
{"text":"US demands halt to Syrian government's bombing of Aleppo"}
{"text":"Does anyone have a link to a video of the object that was claimed to be a part of a missile test? It had a vibrant blue contrail."}
{"text":"How the Oil Industry Conquered Medicine, Finance and Agriculture"}
{"text":"Paris attacks: Video of Brahim Abdeslam suicide bomb at Comptoir Voltaire restaurant - Odd Footage?"}
{"text":"State-Sanctioned Theft - The Failed War On Drugs And Cops' Abuse Of Civil Forfeiture"}
{"text":"Somebody Hacked Trump Audio and Imagery into White House Dinner Livestream!"}
{"text":"Bigotry and Conspiracy"}
{"text":"5 Things You Should Know About Primary Elections"}
{"text":"Vancouver And Other West Coast Communities Are Preparing For 'The Big One'"}
{"text":"WTC7 Rare Raw 911 Footage"}
{"text":"Benghazi Redux? Obama Refusing To Evacuate US Embassy, Baghdad In Chaos Over Revolution | Breaking Now"}
{"text":"Anonymous drags Hillary for lying"}
{"text":"In the past few years it's been a semi-prominent staple of conspiracy theory that Tom Clancy was killed by \"the establishment\" (or Obama). What is the consensus here?"}
{"text":"They are not concerned with proper education, the infrastructure of countries, nor the planet.... but they gotta make damn sure they airdrop abortion pills so women can terminate. Sigh..."}
{"text":"The military calculated how much it would cost to take out an enemy battalion using mosquitoes carrying yellow fever, as outbreak continues killing"}
{"text":"1998 Study Shows Increase Cancer Risk For 98 Million Persons Who Received Polio Vaccine Contaminated With SV 40 (Monkey Virus)"}
{"text":"Fail + Save = Suprise ending"}
{"text":"Gangstalking and magic"}
{"text":"Next US Air Force Chief Battle-Tested and Jewish - furthering the zionist agenda and fucking up America further in support of Israel. America is fucked."}
{"text":"For most Israelis, Palestinian lives don't matter The police’s version of the events doesn’t add up, but nobody in Israel, including the media, feels the need to ask questions."}
{"text":"Message at the end of A$AP Ricky's \"Peso\" video"}
{"text":"I'm not a huge fan of Alex Jones, but he's been on it recently. Here he talks censorship and origins of the ADL. ~16 min."}
{"text":"Report: Germany considering stopping 'unconditional support' of Israel"}
{"text":"So, NBC just accidentally posted the results to the Indiana primary that doesn't happen until next week. If it's true, it could explain a lot"}
{"text":"Hillary Clinton on aiding and abetting America's enemies and supporting the NWO as Secretary of State: 'I relied on Henry Kissinger's advice.'"}
{"text":"Judge Me"}
{"text":"Names of the stones in the Wailing Wall"}
{"text":"Time for an Israeli strategy for the next American administration"}
{"text":"Pyramids Found Around The World"}
{"text":"UnReddit @ R\/WorldNews: Reply to a Vice.Com tract decrying Queensland's drug laws, that calls for the arrest &amp; trial of successive Qld political dynasties, for the July 2000 disappearance of Jew Steven Goldsmith, and for allowing the Mossad cell whence came the \"Celebrating Jews of 911\" right of way"}
{"text":"8 Revelations From 2016 That Completely Vindicate “Conspiracy Theorists”"}
{"text":"\"Waking Up\" &amp; Depression"}
{"text":"Thousands Have Cancer, Hundreds are Dead from a Massive Chemical Attack On Americans"}
{"text":"US strike on Afghan hospital in 2015 not a war crime: Pentagon"}
{"text":"The Day The US Was Sold - The Act of 1871"}
{"text":"Donald Trump and Crooked Hillary are in a bar..."}
{"text":"It would either make us all fools, or him the evil genius we all underestimated, maybe both."}
{"text":"Proof that most Reddit replies are made by A.I. or by a single person with too much time on their hands..."}
{"text":"Trump and Hillary Refuse to Explain Why They Both Share the Same Address in Delaware"}
{"text":"Does it bother you guys that conspiracy theorists are stereotyped as idiots?"}
{"text":"Clinton family a part of construction for the NWO."}
{"text":"Posting Precautions"}
{"text":"Invasion of Europe: Inside the 76-page guide handed to migrants to evade borders through EU"}
{"text":"Eighty percent of all criminals active in the Danish capital city of Copenhagen are nonwhite “foreigners,” according to the Danish police. In particular, Gypsies from Romania and Africans from Nigeria are prominent in the crime figures."}
{"text":"Hungarian President Viktor Orban: Islam is constitutionally illegal"}
{"text":"Media double standard over Turkey shooting illegal immigrants. Turkey has recently shot migrants crossing its border...and Europe was blamed by Amnesty International."}
{"text":"i can't stop thinking about the Jews."}
{"text":"Indiana Primary Results: Trump + Clinton Win - NBC affiliate accidentally posts realistic Indiana primary results nearly a week early."}
{"text":"Trump + Clinton = Win Indiana Primary; NBC Accidentally Leaks Version of Indiana Primary Results Nearly A Week Early. Primary results: Trump: 38% vs. Cruz: 34% vs. Kasich: 12%; Clinton: 55% vs. Sanders: 45%"}
{"text":"The International Oligarchs Intentional Doing It All Intentionally"}
{"text":"Everybody Knows Our Government Has Been Pervaded By Crooks Who Will Do Anything For The Highest Bidder, Even If That Means Intentionally Sabotaging America."}
{"text":"The Demise Of America Is Very Simple, A Complete Idiot Signed A Completely Unconstitutional Act Into Existence In 1913, Now We Have To Reverse It."}
{"text":"UFO spaceships"}
{"text":"Interesting and funny breakdown of the GOP-Right"}
{"text":"UFO Cigar shaped object observed for 90 sec on video Saint Petersburg Florida"}
{"text":"Trump + Clinton = Indiana Primary; NBC Accidentally Leaks Version of May 3rd Indiana Primary Results Early. Indiana Primary Results: Trump: 38% vs. Cruz: 34% vs. Kasich: 12%; Clinton: 55% vs. Sanders: 45%; No Need To Rig Voting Machines When Media Is Owned"}
{"text":"8-10 million Iranians died over Great Famine caused by the British in late 1910s, documents reveal"}
{"text":"The Merry-Go-Round World"}
{"text":"Sunday Hasbara Update: TIL the German word for Holocaust Acceptance"}
{"text":"They finally found out where the money's at!"}
{"text":"Creepy interview: Teen convicted of murdering his mom start's interview by whispering under his breath \"It wasn't me\". Is he drugged or psychotic?"}
{"text":"Noam Chomsky: \"What exactly is the threat of Iran?\" They refuse private central banking. They sell their oil for currencies other than the US dollar. Iran refuses to live under US puppet rule."}
{"text":"Leaked Seminar Footage Dana White Explains Why Its Better To Pay Fighters less 2016"}
{"text":"Theory: Nostradamus predicted Trump's assassination"}
{"text":"Security News This Week: The FBI Gets Creative to Avoid Disclosing Its $1M iPhone Hack"}
{"text":"Congress secret court nullifies fourth ammendment"}
{"text":"Cartoon Explaining why researching independent media claims is important is hysterical."}
{"text":"This may not be the place to post this, but this is what happens every time I come here."}
{"text":"Clinton Foundation Leasing Bundy Ranch To Russian Government Uranium Mining, Move Along, No Police? State"}
{"text":"We have bots."}
{"text":"Moment of explosion near police station in Turkey (Video)"}
{"text":"The Suggestion That Donald Trump, Marine Le Pen and Other Right Wing Populists Represent a Russian Psy-Op Based on 21st Century Information Technology Service Based Propaganda and Scientific Authoritarianism"}
{"text":"I Was the Voice-Over for Bin Laden"}
{"text":"As Obama Preps To Send Troops Into Syria The US Gov’t Is Already Planning Their Next Major Coup"}
{"text":"US Discloses Senior Official Sold Nuclear Secrets to China"}
{"text":"The Unspoken Truth is that America is Supporting Al Qaeda: Heavy Propaganda Rages in the Battle for Aleppo. The Terrorists are Portrayed as “Freedom Fighters”"}
{"text":"The Real Story Behind The True Magnitude Of The New Home Sales Collapse"}
{"text":"Saudi Arabia declares all atheists are terrorists in new law"}
{"text":"Anybody ever read the zombie book series by Joe Mckinney?"}
{"text":"Murder conviction of Chinese MI6 informant referred to appeal court"}
{"text":"\"Pact with The Devil;\" Clintons Justify Backing Paramilitary Voodoo Cult as Bulwark Against Islamic State Infiltration"}
{"text":"Hillary Clinton Approved Delivering Libya’s Sarin Gas to Syrian Rebels: Seymour Hersh"}
{"text":"Professor who says Sandy Hook was a hoax sues the college that fired him"}
{"text":"World Will Run Out Of Fresh Water In 2050 Says Leaked Report, Earth Faces ‘Catastrophic’ Fate"}
{"text":"Australian aid worker kidnapped by men claiming to be from Afghan intelligence agency"}
{"text":"The Ivy League’s favorite war criminal: Why the atrocities of Henry Kissinger should be mandatory reading"}
{"text":"Michael Hudson: The Wall Street Economy is Draining the Real Economy | naked capitalism"}
{"text":"Michael Bloomberg &amp; Bloomberg.com: A Long Overdue Exposé ~ Bloomberg operates at the very nexus of the NWO ruling elites."}
{"text":"Dissolving Illusions: Vaccination Past And Present - Suzanne Humphries &amp; Roman Bystrianyk"}
{"text":"Brent DeBoer of The Dandy Warhols Discusses Truth, Music and Art"}
{"text":"What the hell is going on in r\/politics?"}
{"text":"Anti-Semitism: Zionism's Indispensable Alibi"}
{"text":"TIL that Vince Foster, Hillary Clinton, and convicted Israeli spy Jonathan Pollard were all simultaneously partners at Rose Law Firm, and as federal prosecutor, current FBI head James Comey helped shield Hillary from controversy surrounding the others (the same FBI \"investigating\" Clinton email)"}
{"text":"Clinton’s Email: Israeli Intel Claims Sunni-Shiite War Good for West"}
{"text":"Sad, yet accurate."}
{"text":"Researcher may have Discovered Structures on the Surface of Venus."}
{"text":"Researcher may have Discovered Structures on the Surface of Venus."}
{"text":"Alex Jones Reads ADL the Riot Act About Their Disingenuous America First Cheap Shot"}
{"text":"TIL: Samantha Power, an unpaid advisor to Obama in 2008, was forced to resign because she criticized Hillary Clinton, calling her \"a monster\" and expressed doubt as to Obama's ability to withdraw from Iraq -- both claims vindicated in history as truthful."}
{"text":"Was Hugo Chavez Right About HAARP &amp; The HAITI Earthquake? Is Weather Even Natural Anymore?"}
{"text":"\"Promising new monkey hiv antibody vaccine\" as yet-another offering that will most likely fail or cause more problems than it solves, possibly including giving HIV to seronegative individuals receiving it as a future lobbied-FDA-approved propylactic."}
{"text":"Federal Agent \"We Murdered Michael Jackson\" 2015"}
{"text":"Happiness genes located for the first time - \"A huge study involving over 190 researchers in 140 research centers in 17 countries has located genetic variants associated with happiness and other traits. It is one of the largest studies ever published on genes involved in human behavior.\""}
{"text":"How do you convince people around you regarding the globalists and the nwo"}
{"text":"Was Fidel Castro on the grassy knoll and did he shoot jfk?"}
{"text":"Why are people so bad at spelling Hillary Clinton's name?!?!"}
{"text":"CIA Director John Brennan says the 9-11 Commission Report is \"inaccurate and unvetted.\""}
{"text":"127 million people could come into Europe visa-free"}
{"text":"Del Bigtree explains CDC whistle blower in VAXXED."}
{"text":"Seasoned Investigative Journalist Exposes Inside Strategies to Censor News"}
{"text":"Am I the only one who remembers the landlord of the San Bernardino attackers prying a piece of plywood off with a crowbar and letting reporters into their apartment?"}
{"text":"9\/11 Commission Did Not Exonerate Saudis"}
{"text":"Washington Likes Wars. So Where Next?"}
{"text":"TIL Jerome Hauer, former head of the New York Office of Emergency Management situated in WTC 7, was an expert in building collapses."}
{"text":"TIL Jerome Hauer, former head of the New York Office of Emergency Management situated in WTC 7, was an expert in building collapses."}
{"text":"You're Always Waiting Until the Last Minute (Brussels Bombing Hoax)"}
{"text":"'Make America Mexico Again'"}
{"text":"Why Was an al Qaeda Member Captured Just After 9\/11 Carrying an Envelope from the Saudi Government?"}
{"text":"Anarchy doesn't imply one must know how a society will be organized without a state, but rather that it is never acceptable to use violence or threaten violence against the innocent."}
{"text":"CIA Director: Missing 9\/11 Report Pages Contain 'Inaccurate' Information"}
{"text":"Were these Clinton or Sanders supporters? If Trump''s supporters did this the media would be chimping out over this as I speak."}
{"text":"The CIA is tweeting the 2011 bin Laden raid in 'real time'"}
{"text":"Thule, Vril, Nazis, and UFOs, and Hollow Earth"}
{"text":"CIA Seeks Designers"}
{"text":"Q: How far is it from Kunduz Hospital (Doctors Without Borders) to the U.S. Air Force Spy HQ?"}
{"text":"Bernie Sanders&amp;#8217; Wife: &amp;#8220;It Would be Nice If The FBI Moved Along Hillary&amp;#8217;s Email Probe&amp;#8221;"}
{"text":"Bernie Sanders Wife: It Would be Nice If The FBI Moved Along Hillarys Email Probe"}
{"text":"SIKH MAN DRAGGED OFF GREYHOUND BUS, DETAINED BY FBI FOR 30 HOURS – ONLY CRIME WAS WEARING A TURBAN"}
{"text":"Sikh Man Dragged Off Greyhound Bus, Detained By FBI For 30 Hours - only Crime was wearing a Turban"}
{"text":"Health experts believe Australia is on the brink of virtually eradicating cervical cancer because of vaccine and testing breakthroughs"}
{"text":"Songs promoting drug use disguised as pop songs so they appeal to the masses. A common problem in modern day society."}
{"text":"Australia to spend over $11mn to eradicate carps by releasing a deadly strain of herpes virus into rivers all across the country"}
{"text":"After rabbit, fox, cane toads, Australia to release a deadly strain of herpes into the country's rivers to eradicate carp..."}
{"text":"11yo Alabama boy shoots intruder, mocks him for ‘crying like a baby’"}
{"text":"Juice Rapnews: Israel vs. Palestine (ft. Kerry, Bibi &amp; Norman Finkelstein)"}
{"text":"\"Get out, Traitor!\" - German People chases Minister of Justice Heiko Maas to his armored Vehicle"}
{"text":"The Link Between Aerial Mosquito Spraying and Autism"}
{"text":"EAP"}
{"text":"Noam Chonsky exposes the truth as to why College prices are so expensive."}
{"text":"#Op_Pharma: Anonymous Launches Attack On Big Pharma"}
{"text":"Certain Vaccines Increase Food Allergen IGE: Susceptible Post-Millennials Reacting To Adjuvant Exposure, Researchers Suspect"}
{"text":"International - TTIP Documents Revealed"}
{"text":"Ex-Italian President: Intel Agencies Know 9\/11 An Inside Job Man who blew the whistle on Gladio tells Italy's largest newspaper attacks were run by CIA, Mossad"}
{"text":"The Queen's Former Doctor Just Slammed Big Pharma"}
{"text":"Cleaning up toxic mercury from dental offices | Mountain Xpress"}
{"text":"Venezuela nearing total “collapse” | Could someone explain how this inflation was created?"}
{"text":"8 Revelations From 2016 That Completely Vindicate “Conspiracy Theorists”"}
{"text":"In case you still haven't seen it: Evidence of Revision - Part 1 - The Assassination Of Kennedy And Oswald as Never Seen Before"}
{"text":"Leaked Docs Reveal TTIP Trade Deal In Jeopardy As \"Irreconcilable Differences\" Emerge"}
{"text":"It is starting to become inevitablethat The Donald will be the Republican's choice to run against Hillary in the fall."}
{"text":"It is starting to become inevitable that The Donald will be the Republican's choice to run against Hillary in the fall"}
{"text":"The Rothschild Conspiracy"}
{"text":"He knows what he's saying"}
{"text":"Real or Fake, you decide"}
{"text":"Robert Baer, a former CIA agent and the author of \"The Fall of the House of Saud\" (May Atlantic), discusses the perils of our dependence on Saudi Arabia and its precious supply of fuel"}
{"text":"The Slow Decline Of Liberty"}
{"text":"US once again forced to turn to Russia for help on Syria"}
{"text":"Growing List of Celebrities Speaking Out About Chemtrails\/Geoengineering: Chuck Norris, Vin Diesel"}
{"text":"The 33rd parallel and its relationship to death ( repost)"}
{"text":"GUARDIANS TRAILER (2017) - Superhero."}
{"text":"US spying apparatus actually controlled by Russia?"}
{"text":"America now has nearly 5 PR people for every reporter, double the rate from a decade ago"}
{"text":"Lebanese journalist: 'Aleppo would have been safe like the Golan were it annexed by Israel' -- sad but true..."}
{"text":"Marching to Zion, an examination of Jesus in the Talmud"}
{"text":"Hmmm... I wonder why..."}
{"text":"Hillary Clinton’s Damning Emails"}
{"text":"The Body Language - Interesting psychology doc on how our body reveals our real intention.. learning how to control it is a powerful skill. (2015)"}
{"text":"To learn of who controls you, find out who you can't criticize..."}
{"text":"The French conspiracy theory to end all conspiracy theories | Media Network | The Guardian"}
{"text":"Surprising Findings of Adoption Studies"}
{"text":"Aggression And Culture: A Brilliant Experiment"}
{"text":"Paul Collier On The Problems With The Current (Lack Of) Migration Policy And A Proposal To Fix It"}
{"text":"Get Back To My Dad, Please Help Me.. Girl kidnapped by Sampson County DSS and Sampson County Law Enforcement over a year ago. I was returned to my dad by Judge Stevens because my dad never abused or neglected me. DSS wants me back because I was exposing how I was abused and neglected in Foster Care."}
{"text":"The U.S. government doesn’t want to admit that its heady “unipolar” days are over with Russia no longer the doormat of the 1990s, but Washington’s arrogance risks war, even nuclear annihilation, explains Gilbert Doctorow."}
{"text":"Jeremy Corbyn described a convicted terrorist accused of plotting a series of suicide attacks in Israel as an “icon” and compared him to Nelson Mandela"}
{"text":"How to solve US debt NEW &amp; IMPROVED"}
{"text":"Pure propaganda (worth the read)"}
{"text":"Evidence of massive fraud, waste and abuse: Commission on Wartime Contracting in Iraq and Afghanistan"}
{"text":"As Americans Argue Over Which Bathroom to Use, 3 Nuclear Disasters are Unfolding Inside the US"}
{"text":"I'm not much of a conspiracy theorist but can anyone tell me if \"Rule by Secrecy\" is worth reading?"}
{"text":"CIA 'Live Tweets' Bin Laden Raid on 5 Year Anniversary"}
{"text":"CIA Director Says Unverified Material in Secret 9\/11 Pages"}
{"text":"Infuriating Report Shows How Govt &amp; Big Pharma Intentionally Break Laws to Reap Massive Profit"}
{"text":"Bank of England busy preparing for Brexit vote; Bank draws up plans for run on sterling and interest rate dilemma ahead of vote"}
{"text":"Basically every other day there is a feel-good police story on \/r\/all"}
{"text":"upload images Search sign in sign up Next Post Newly released photos of James Holmes' apartment and Aurora Theater aftermath."}
{"text":"Newly released photos of James Holmes' apartment and Aurora Theater aftermath."}
{"text":"CNN: Barack Obama Says \"We Got Him,\" and Hopes \"Master Terrorist Osama bin Laden\" knew the US had \"come for him\" to avenge the deaths of 3,000 ppl Sept. 11, 2001 - Except OBL who died in Pakistan Dec. 14, 2001 denied guilt as a Moslem, while the official death toll of under 3000 is grossly distorted"}
{"text":"New to all of this. Anyone notice the same project management company that was involved in the building of One World Trade is also involved in the rebuilding of Sandy Hook Elementry?"}
{"text":"The Mystery Man Behind Evidence Of Revision"}
{"text":"I gave a dirty robot a piece of my mind on behalf of the human race today."}
{"text":"Seymour Hersh Says Hillary Approved Sending Libya's Sarin To Syrian Rebels"}
{"text":"Is Zero Hedge a Putin propaganda website?"}
{"text":"What are the chances Hugo Chávez was assassinated and Maduro is a puppet put there to destroy the Bolivarian Revolution in Venezuela?"}
{"text":"IDF Guns Down Pregnant Woman as U.S. Readies Largest Military Aid Package in History for Israel"}
{"text":"David Suzuki Wants Political Prisoners Over Climate Change \"Willful Blindness\""}
{"text":"New Snapchat features"}
{"text":"Iran's new parliament has more women than clerics"}
{"text":"Thoughts on the \"Couch Commander\" video the White House posted?"}
{"text":"Is this the actual reason why people are fighting for Transgender Bathrooms? (x post r\/The_Donald)"}
{"text":"Virtual reality will completely transform children into zombies"}
{"text":"Puerto Rico says it will default on Monday"}
{"text":"David Suzuki Wants Political Prisoners Over Climate Change \"Willful Blindness\""}
{"text":"Isn't this illegal?"}
{"text":"\"Get Out Traitor\" - German Justice Minister Flees In Armored Mercedes After Angry Protesters Boo Him Offstage"}
{"text":"The EU – A CIA Covert Operation"}
{"text":"Tor and VPN users will be target of government hacks under new spying rule"}
{"text":"Red Jihad? US conspiracy theorists think Moscow has a final solution for America &amp; Israel"}
{"text":"CIA director: '28 pages contain inaccurate information."}
{"text":"Christine and Piper Murphy are being heavily stalked in Pueblo Colorado."}
{"text":"They should all be tried: George W. Bush, Dick Cheney and America’s overlooked war crimes"}
{"text":"Sky Trumpets: PsyOp, God's Coming Wrath, or a More Natural Explanation?"}
{"text":"Pirate Bay Gets A Minuscule $9 In Donations, Per Day..."}
{"text":"Human the Movie impressed me until i realized the 2nd richest woman in the world funded it... why would elite make a movie like this??"}
{"text":"Nile to Euphrates. Greater Israel is what our foreign policy has been about."}
{"text":"'Spying Billboards' Under Fire for Tapping Into People's Cellphones"}
{"text":"Bill Burr Reveals Hillary Clinton's Hypocrisy (2016 Elections, MMPC, Breakfast Club, Hot Sauce)"}
{"text":"When Interest Rates Rise Violently The Whole Entire World Will Collapse In Unison: Michael Pento"}
{"text":"\/pol\/ - Americans want to fight with Russia in Poland [ENG subtitles]"}
{"text":"GET YOUR MONEY OUT OF THE BANK Goldman Sachs has just made a historic move in that it will not accept deposits of as _little as $1.00USD. This is an unprecedented move since Sachs tends to only cater to the richest of the rich. Why has Sachs decided to start taking money from the average goy?"}
{"text":"The Real Reason Why Princess Diana Was Assassinated"}
{"text":"Chomsky on Guns: \"It's clear that, taken literally, the 2nd Amendment doesn't permit people to have guns. After decades of business propaganda, people feel that the gov is some kind of enemy and that they have to defend themselves from.\" HOLY FUCK. HOW IS THIS GUY TAKEN AS A SERIOUS INTELLECTUAL?"}
{"text":"\/pol\/ - Postmodernism"}
{"text":"Ted Cruz's Father confirmed for Second JFK Shooter"}
{"text":"Did anyone on here know that creator of Breaking The Barrier (Correct The Record) is the same guy who broke the Paula Jones scandal against Bill?"}
{"text":"Syria's Assad used chemical arms against ISIS [or he's getting set-up again]"}
{"text":"Two Turkish Flags - Angela Merkel gets humiliated by Erdogan | Chinese TV Report"}
{"text":"Angry Foreigner on Black Culture"}
{"text":"Scottish government minister Tweets about “White genocide globalist cause”"}
{"text":"Europe Awake"}
{"text":"29 years ago Soviet defector and KGB operative Yuri Bezmenov talked about the psychological warfare waged by Communist Russia. He describes modern America EXACTLY!"}
{"text":"Today I came across the transcript of a famous thread: \"I am a member of an Elite Family who you despise...ask me a question\". A strange and interesting read. What do you think about it?"}
{"text":"Bizarre results this year have led many Formula 1 fans to suspect that Mercedes is deliberately hampering Lewis Hamilton so that their German driver, Nico Rosberg can win the title. Mercedes have further set antennaes twitching by calling this a \"lunatic conspiracy theory\"."}
{"text":"Secret TTIP negotiation documents leaked"}
{"text":"Feinstein-Burr: The Bill That Bans Your Browser (Yes, that Feinstein -- the zionist extremist that approved NSA spying on Americans -- now she wants a backdoor key directly into to your browser!!!)"}
{"text":"UFO WITNESS TELL HIS STORY TO THE NEWS"}
{"text":"ufo witness tell his story to the news"}
{"text":"SHOCK STUDY: Ten percent of Canadian females receiving HPV vaccines are sent to Emergency Rooms... scientists declare rate to be 'low' for vaccines"}
{"text":"Secret Space Programs and Vril Technology"}
{"text":"\/pol\/ =Mugabe is asking back the white farmers he chased away= The country that was once dubbed “the breadbasket of the region” has suffered an estimated $12 billion in lost agriculture production and has had to rely on donor handouts and food imports from neighboring countries."}
{"text":"Secret Medical Exams in Young People Under General Anesthesia"}
{"text":"Video Shows Time Traveler Using 21st Century Camera Phone At Mike Tyson Fight In 1995"}
{"text":"3 orthodox churches burned on the holiest day of the year. A Greek and FYROM one in Australia and a Serbian one in New York. This can't be a coincidence."}
{"text":"Five Bin Laden Conspiracy Theories Ranging From Mildly Plausible To Downright Bizarre"}
{"text":"Agenda 21 \"harmonization\" being implemented in Santa Cruz and across USA"}
{"text":"FSA rejects local ceasefires, supports halt in Syria peace talks"}
{"text":"Joining Hands: French President and Ministers Hold Ground Against TTIP"}
{"text":"Pressured Partnership: Leaked TTIP Papers Reveal US Drive to Get EU Markets"}
{"text":"Russia Today Declares 9\/11 Was An Inside Job!"}
{"text":"Obama Delighted To Announce Death of Republic, NWO Creates An American Empire, Or Monarchy"}
{"text":"Leaked TTIP Documents Confirm Corporate Power Grab at Heart of EU\/US Trade Deal"}
{"text":"What's your preferred website for conspiracy related stuff outside of reddit?"}
{"text":"Alzheimer's might be caused by a fungus"}
{"text":"OBAMA SECRET SIGN WHAT DOES IT MEAN?"}
{"text":"CIA Head opposes Declassifying 9\/11 Report due to Inaccurate Information"}
{"text":"Holocaust 101, The Art Of Military Propaganda"}
{"text":"obama secret sign? what does it mean?"}
{"text":"Breaking! Released 1 hour ago. Hillary Speech Donations"}
{"text":"Truth censored: response removed from \/r\/AskScience discussing the lack of verifiable evidence that antidepressants are effective..."}
{"text":"Military Analysis: Nano-weaponry"}
{"text":"The Conspiracy Of War — Power, Profit, Propaganda and Imperialism"}
{"text":"FBI Chooses Secrecy Over Locking Up Criminals"}
{"text":"Jewish Bolshevik Murderers, 120 Million European Christians Killed &amp; Sent To The Gulag, They Created WW Two"}
{"text":"Media Watchdog: Israeli Media Government Propaganda"}
{"text":"U.S. Government Has Long Used Propaganda against the American People"}
{"text":"The Salacious Ammo Even Donald Trump Won't Use in a Fight Against Hillary Clinton"}
{"text":"Topics that the Users &amp; Mods in \/r\/politics can't handle and want to hide for everyone!"}
{"text":"Topics that the Users &amp; Mods in \/r\/politics can't handle and want to hide from everyone!"}
{"text":"Coverup: WashPost Buries Uncomfortable Fact: Gruesome, Slashing Killer Is An Illegal Alien"}
{"text":"Wanted"}
{"text":"Congress nullifies 4th Ammendment. Feds can search without warrant anytime they feel the need."}
{"text":"Aerial Pesticide Spraying Tied to Higher Autism Rates"}
{"text":"You'll Soon Have to \"Submit DNA\" to Enter Kuwait"}
{"text":"Gold is Out of Control"}
{"text":"What is “Merkel plan” and who is really behind it: Rockefeller, Soros, UN, World Bank"}
{"text":"Mystery solved? Australian says he's Bitcoin founder"}
{"text":"What's your favorite conspiracy podcast?"}
{"text":"Conspiracy Discussions"}
{"text":"h3h3Productions - The Tai Lopez Conspiracy"}
{"text":"FBI Can Treat Anyone Surfing Net Anonymously as a Criminal"}
{"text":"Judge Calls for US Marshals and FBI to Arrest Congress and the President ~ The criminality of the “US Congress” and the “Presidents” acting since 1933 is jawdroppingly shocking."}
{"text":"Another \"Conspiracy Theory\" Confirmed: ECB Finds Widespread Trading On Leaked Inside Information"}
{"text":"Teacher Fired For Showing Anti-Gay Bullying Film to 8th Graders"}
{"text":"Chinese Billionare Donates $2 Billion to Charity"}
{"text":"The Truth About The bin Laden Raid"}
{"text":"What was Iran's leader prediction 18 years ago in a meeting with Hamas leader?"}
{"text":"NGOs, the Pentagon, and the Human Rights - Industrial Complex"}
{"text":"CIA Director Brennan calls 28 pages in 9\/11 report 'inaccurate'"}
{"text":"Obama Admin Denies Saying \"No Boots on the Ground\" in Syria After Saying It 16 Times"}
{"text":"Inside the Secret Meeting Where Wall Street Tested Digital Cash"}
{"text":"Hillary Clinton: Lying for 12 minutes straight"}
{"text":"Greenpeace Leaks U.S.-E.U. Trade Deal Documents"}
{"text":"Rebel infighting in rural Damascus leads to death of prominent commander"}
{"text":"This is the entitled attitude instilled in rural children by Big Ag. Get them thick headed and resistant to questioning early."}
{"text":"Controlling Memories with Ultrasound: Sonogenetics, the future of memory hacking"}
{"text":"Reminder to take Noam Chomsky--verified media gatekeeper--with a grain of salt \/\/ On the trend of positive Noam Chomsky posts"}
{"text":"Reminder to take Noam Chomsky--verified media gatekeeper--with a grain of salt \/\/ On the trend of positive Noam Chomsky posts"}
{"text":"Crepuscular sun rays are another proof that we live on a Flat Earth"}
{"text":"Jewish Defense League in Action !"}
{"text":"Top Journalist Says Hillary Approved Sending Sarin to Rebels Used to Frame Assad, Start Syrian War"}
{"text":"Australian Man Abducted by Aliens Reported More Than 2000 UFOs Tell his Story to The News"}
{"text":"Reminder to take Noam Chomsky--verified media gatekeeper--with a grain of salt \/\/ On the trend of positive Noam Chomsky posts"}
{"text":"Using Metadata to find Paul Revere"}
{"text":"What a Hillary Clinton Foreign Policy Team Will Look Like: The Frightening Convergence between Hillary’s Liberal Interventionism and Neoconservatism"}
{"text":"Imgur has begun to censor the term \"trigglypuff\""}
{"text":"Haitians Protest Outside Hillary Clinton’s Office Over ‘Billions Stolen’ by Clinton Foundation"}
{"text":"Crepuscular sun rays are another proof that we live on a Flat Earth"}
{"text":"The Financial Industry Just Held A Secret Meeting to Test a Crypto Dollar"}
{"text":"Hillary Fueling Race War Benefit The 1%, She Won't Be In Charge After The Shooting Stops &amp; They Have Taken Power?"}
{"text":"Imgur has begun to censor the word \"Trigglypuff\" in order to protect an SJW-Activst after a new video by a person who was attending \"The Triggering\" talk at UMASS goes viral on Imgur"}
{"text":"When Will Bill &amp; Hillary Send Out Christmas Cards Like These, I Want Mine"}
{"text":"Happy birthday death day of Osama Bin laden everyone! Don't forget that the CIA created his legacy!"}
{"text":"TTIP Leaked Documents Show Obama Demands Killing Paris Accord Against Climate Change"}
{"text":"Sumerian Gods at the Kodak Theater?"}
{"text":"CRISPR And The Three Myths Of Precise Genome Editing"}
{"text":"What does this mean?"}
{"text":"Infuriating Report Shows How Govt &amp; Big Pharma Intentionally Break Laws to Reap Massive Profit"}
{"text":"Green Party Intrigue: Jill Stein’s Tweet To Bernie Sanders Adds Yet Another Wild Card For Superdelegates to Consider"}
{"text":"Analysis of the new Angry Birds movie"}
{"text":"The Danger Of Big Pharma’s Silent Hold Over The US Government"}
{"text":"Conspiracy TV Series looking for hosts"}
{"text":"TTIP Leaked Documents Confirm that Obama Requires “Killing the Paris Accord on Climate Change”"}
{"text":"Gay man confronts Christian man holding a sign"}
{"text":"Hillary Clinton Caught Hoarding 99 Percent of Funds Raised for State Parties"}
{"text":"Media Monarchy: May 2, 2016"}
{"text":"Reasons to Doubt the Official Osama Raid Story — Five Years Later - WhoWhatWhy"}
{"text":"Climate-exodus expected in the Middle East and North Africa"}
{"text":"Dr. Steven Greer - \"Call for New Witnesses\": UFO, Secrecy, Cover Up, Free Energy +"}
{"text":"UFO disclosure now in mainstream media | Governments Reports"}
{"text":"How Big Government helps Big Dairy sell milk"}
{"text":"Skull &amp; Bones Insider: \"Murdered Federal Judge was Jared Loughner's Intended Target\""}
{"text":"\"The Establishment Hates Trump\" - REVERSE PSYCHOLOGY - &amp; The Alex Jones Deception 2.0"}
{"text":"Senior slain rebel commander admits receiving financial support from Saudi Arabia + [Video]"}
{"text":"What Is Agenda 21?"}
{"text":"Growing List of Celebrities Speaking Out About Chemtrails\/Geoengineering"}
{"text":"Skull &amp; Bones Insider: \"Murdered Federal Judge was Jared Loughner's Intended Target\""}
{"text":"'Science skeptics' use guerilla warfare tactics and racketeering behavior to infiltrate Wikipedia and spread corporate propaganda"}
{"text":"Last Week Tonight with John Oliver: U.S. Territories (HBO)"}
{"text":"For Hillary Clinton and John Kerry, Divergent Paths to Iran Nuclear Talks"}
{"text":"\"The Biggest Cover-Up\" RE: 9\/11 The Week Magazine arrived in my mailbox today"}
{"text":"Military bases revealed on Antarctica"}
{"text":"SATANIC RITUAL &amp; CELEBRITIES (STARS)"}
{"text":"Vaccinated students at Harvard"}
{"text":"Conspiracy Directory - Much Knowledge to be seen!"}
{"text":"Where on Reddit apart from here would this not get removed?"}
{"text":"Walter Veith: 9\/11 &amp; A New World Order ~ The intrigues behind the setting up of a universal order dictating to the conscience of men are clearly exposed."}
{"text":"\"Where to Invade Next\", both trailer and film have hiccups (3 sec delay per 5 sec of play). AB testing other amazon vod movies work fine; Netflix, Youtube, stream at their nominal rate (great and crappy-normal, respectively). Suggests political meddling."}
{"text":"Card tricks can't melt steel beams"}
{"text":"Obama speech at Presstitutes Dinner"}
{"text":"Does anyone else think Bernie Sanders is just a product of Trump's campaign?"}
{"text":"Obama budgets $17,613 for every new illegal minor, more than Social Security retirees get"}
{"text":"Why The Obamacare Gold Rush Is Bankrupting America"}
{"text":"Man, this cover is good! Almost like... as good as the original singer. Great job kudos, \"Ava Lily\" on the 'Pia Mia' cover ;)"}
{"text":"For the Undying 911 MORONIC Replies - sottotitolato in italiano"}
{"text":"Serbian church burns in NYC; fire in 3 more Orthodox temples - World"}
{"text":"9\/11 Damage Control Begins: CIA Director Warns \"28 Pages\" Contains Inaccurate Information"}
{"text":"Unraveling the Nonsense about these 28 Pages"}
{"text":"TCR:Ted Cruz,Does Nothing As Carly Fiorina Falls Off Stage in Indiana"}
{"text":"Unraveling the Nonsense about these 28 Pages"}
{"text":"Yellowstone Volcano Report: Monday Earthquake Near Park, and Utah Earthq..."}
{"text":"Officials: FBI thwarts plot against prominent Florida Jewish center"}
{"text":"May 2 WSO Updates First Look at Balloon Data - Green Ray Confirmed"}
{"text":"CRUZ POACHES NEARLY ALL AZ DELEGATES=&gt; Former Gov. Jan Brewer Screams “I Got CheaTED!”"}
{"text":"Weird Weather - Earth Under Pressure: Quadrupole?"}
{"text":"U.S. Senator Calls For Federal Investigation Of Billboards Spying On Public"}
{"text":"The Assad regime reportedly struck an ominous deal with ISIS to take back a strategic city"}
{"text":"How are you doing today?"}
{"text":"Is Charlie Munger Becoming Austrian: \"It Was Massively Stupid For Our Government To Print So Much Money \""}
{"text":"Typhoon Jet authorised to go supersonic over Yorkshire"}
{"text":"Huge explosions heard as jets scramble"}
{"text":"Strange Sounds HAPPENING all over the WORLDWIDE 2016"}
{"text":"Berlin Brandenburg airport corruption 'whistleblower poisoned'"}
{"text":"Obama adviser John Podesta's biggest regret: Keeping America in dark about UFOs"}
{"text":"Traces Of Giants Discovered Worldwide"}
{"text":"Chaotic Live Streaming: 5\/2\/2016 Discussion - Oregon StandOff, LaVoy Finicum, Prince, And Much More"}
{"text":"Israel's ISIS Conspiracy"}
{"text":"Food Giants want to pay Congress in secret. No FOIA"}
{"text":"After being caught tossing around death threats against Hampton Creek's CEO, government-supported Ag groups beg Congress for FOIA exemptions"}
{"text":"Court Takes Child From Mother After She Mentions Chemtrails At School"}
{"text":"Government Is Making Us Homosexual"}
{"text":"Major University JUST Blamed MMR Vaccine on Mumps Outbreak…. – TheWatchTowers.org"}
{"text":"Hegemony Disguised as Charity: NGOs, the Pentagon, and the Human Rights – Industrial Complex (Video)"}
{"text":"Grenada, the 80s forgotten war"}
{"text":"9\/11 CONSPIRACY: ALEX JONES PREDICTS 9\/11 IN JULY 2001"}
{"text":"Court Takes Child From Mother After She Mentions Chemtrails At School"}
{"text":"Cuban-American Filmmaker Warns America Is Morphing Into Communist Country Like Cuba"}
{"text":"'Russel Marsh' vogue and the illuminati?"}
{"text":"What Really Matters: What We Build, Our Natural Rights &amp; Ability to Thrive, Not Elected Leaders"}
{"text":"The Israeli Plan: Frighten the West"}
{"text":"Oculus, The Closed All-Seeing Eye at Ground Zero, To “Open” Each Year On 9\/11 (VIDEO)"}
{"text":"The Phoebus Cartel - \"TIL Light Bulb Manufacturers formed a Market Controlling 'Cartel' that disallowed 1000 Hour+ lightbulbs, and threatened legal action to any company who did.\" [x-post \/r\/todayilearned]"}
{"text":"Fossil Fuel Theory for the Origin of Oil and Gas Debunked"}
{"text":"CIA recaps the night Bin Laden was shot on twitter"}
{"text":"Cops raid legal dispensary, eat marijuana edibles, joke about kicking amputee …and it’s all on video"}
{"text":"Location Location Location (Brussels Bombing Hoax)"}
{"text":"Photos: California Protesters Burn American Flag, Donald Trump Responds"}
{"text":"Alex Jones predicts 911."}
{"text":"Rep. Barbara Lee condemns U.S. escalation without debate in Syria"}
{"text":"Food as a Weapon and GM Crops Unleashed"}
{"text":"scary Commercial from 1988 Life Mysteries of the Unknown"}
{"text":"A New Digital Cash System Was Just Unveiled At A Secret Meeting For Bankers In New York"}
{"text":"Labour Councillor: Israel Behind ISIS, “Zionist Jews are a Disgrace to Humanity”"}
{"text":"Fuel from cars is Dinosaurs entering into our bodies to take control of our society(Government controlled by Dinosaur Possessed People) and Brains[sperm] and Bodies[Fertility Cells] are two separate lifeforms."}
{"text":"Clinton emails ‘far more egregious’ than data breach that has Marine officer facing dismissal"}
{"text":"In the rest of the world it is called a \"Bribe\" in Clinton's America it's called \"Speaking Fees\""}
{"text":"Israeli police attack citizens following funeral in east J'lem"}
{"text":"Not Racist? May You Be Raped!"}
{"text":"The Dirty Truth About Israel"}
{"text":"Former CIA Officer Israel Controls U.S. Government &amp; Media"}
{"text":"Jimmy Carter unveils truth about Israel"}
{"text":"Israel did 9 11 - All the Proof in the World"}
{"text":"Why US and Israel wants to ban this video..."}
{"text":"Israeli Soldiers Breaking The Silence on the Occupation of Palestine"}
{"text":"How the Jews Treat Christians in Israel, the apartheid state."}
{"text":"Ugly Truths About the Jewish Talmud"}
{"text":"Brazil orders to shut down Whatsapp for 72 hours"}
{"text":"Pentagon Finally Gets on Board with Anonymous – Declares Cyber War on ISIS"}
{"text":"How could we get Anonymous to target Israel and the zionists for their evil behavior?"}
{"text":"Trigglypuff BTFO"}
{"text":"Richie Allen and Gilad Atzmon Talking About Zionism &amp; Anti-Semitism"}
{"text":"Deportation Budget Grows 25 Percent While Deportations Plummet"}
{"text":"School shootings planned and carried out with help from the CIA in a plan to disarm America (William Cooper, 1990)"}
{"text":"Where Does Our Money Come From: The Reality Behind The Federal Reserve"}
{"text":"The Wall Street Economy Has Taken Over the Real Economy and Is Draining It!"}
{"text":"Leak Confirms Our Worst Nightmares: TTIP Trade Deal Really IS a Corporate Takeover"}
{"text":"On the KKK and Alchemy"}
{"text":"Bush-Nazi Dealings Continued until 1951 | Federal Documents"}
{"text":"Entire Police Department of Colorado’s Town Resign"}
{"text":"New hypothesis proving flat earth theory!"}
{"text":"It's Time To Talk About Chemtrails And Geoengineering - Matt Landman on PFT Live"}
{"text":"One Year of Silence on Hillary Clinton Uranium Deal"}
{"text":"Tavistock Institute of Human Relations: The Best Kept Secret in America ~ Today the Tavistock Institute operates a $6 Billion a year network of Foundations in the U.S., all of it funded by U.S. taxpayers’ money."}
{"text":"Day 722 of the Benghazi Show Trials- the Pentagon calling shenanigans"}
{"text":"Psyops"}
{"text":"Watch \"Nuclear negligence: Largest nuclear waste storage in US is leaking\" on YouTube"}
{"text":"Oklahoma City Bombing: In a 1997 Washington Post article, the Oklahoma National Guard confirms the authenticity of aerial photographs (found on many conspiracy theory websites) showing a yellow Ryder truck parked at a military base. Without explanation, they then claim that there is no relation."}
{"text":"More Evidence Ted Cruz Might Be the Zodiac Killer"}
{"text":"US Government Has Its Own Court Which Grants 100% of Surveillance Requests"}
{"text":"Other than Bin Laden and the 19 hijackers, how many people had prior knowledge of 9\/11?"}
{"text":"Bitcoin inventor identity remains unrevealed"}
{"text":"Young progressive idealists"}
{"text":"The EU Parliament Building Modeled After The Cursed Tower Of Babel"}
{"text":"Twitter account correctly predicts football match events"}
{"text":"The Royal Tinfoil Hat Society - Comedic Graphic Design, by a Conspiracy Theorist, for Conspiracy Theorists."}
{"text":"This is book burning."}
{"text":"Loose Change 9\/11: An American Coup"}
{"text":"The Weasel That Shutdown CERN, the Foxes Finished First and Obama Bom..."}
{"text":"Prince was Murdered by the Illuminati!!!"}
{"text":"The Crimes of French Imperialism"}
{"text":"Just your every day C.I.A operative"}
{"text":"State Orders Parents: Register Your Unvaccinated Children"}
{"text":"Long-time Iowa farm cartoonist fired after creating this cartoon"}
{"text":"Supreme Court has struck down attempts by two cities to ban or delay fracking"}
{"text":"NBA Conspiracy - 2016 Playoffs"}
{"text":"CIA director says secret 9\/11 report pages full of hearsay, inaccurate info...and you can trust him, he's from the CIA"}
{"text":"Grain Traders Rejecting New Monsanto Soybeans"}
{"text":"The Syria White Helmets Exposed as US UK Agents Embedded with Al Nusra and ISIS"}
{"text":"&gt;The European Commission is to grant Turkey conditional approval this Wednesday for visa-free travel within the EU's Schengen area, sources have told the BBC."}
{"text":"9\/11 investigation will expose CIA, Mossad role: Scholar"}
{"text":"Quaker Oats sued for use of glyphosate in '100% natural' products"}
{"text":"Speaking of strange things on google earth. Australian Outback."}
{"text":"Iran's Khamenei humiliates US operation in the \"Bay of Pigs\" in Cuba"}
{"text":"Secret US spy court approved every surveillance request in 2015"}
{"text":"Why Patriarchy Is The Greatest Social System Ever Created"}
{"text":"Dannon Yogurt to Remove GMO Ingredients and Source Milk from Non-GMO Fed Cows"}
{"text":"\"The world’s 10th largest cotton producer... giving up Monsanto’s GM Bt cotton because it had proved uneconomical.\""}
{"text":"‘Stay away from Russian borders or keep transponders on’: Russian MoD on US spy planes in Baltics"}
{"text":"r\/conspiracy starts criticizing Hillary Clinton, gets a front page video disregarding it's validity."}
{"text":"A Thought about Ken Livingstone's recent \"anti-semitic\" Remark"}
{"text":"I heard somewhere that some country built a jail only one prisoner. does anybody knows about it?"}
{"text":"I heard somewhere that some country built a jail for a single prisoner. does anybody knows about it?"}
{"text":"75 million Turks on course for visa-free travel in EU, despite not meeting key targets in refugee swap deal"}
{"text":"The invading islamic war on Europe: The Road to World War 3"}
{"text":"TTIP: United States blackmailing EU to accept their GMO food"}
{"text":"Sadiq Khan, London mayor candidate 2016, shared platform with five Islamic extremists. Women were told to use a separate entrance at the meeting which the mayoral hopeful attended."}
{"text":"A post about the role of Catholic\/Jesuit Power Got Deleted"}
{"text":"Electric Cars Could Wreak Havoc on Oil Markets Within a Decade"}
{"text":"Undercover police cleared 'to have sex with activists'"}
{"text":"Nine theses about the war we are engaged in"}
{"text":"The Geopolitics of the Odessa Massacre"}
{"text":"Recommend this article to anyone interested in 9\/11 who would like to see how the disinformation campaign immediately after 9\/11 almost hit a fatal snag. [Repost, but it's good.]"}
{"text":"Hempcrete Will Change The World"}
{"text":"Lawsuit challenges TSA’s use of full-body scanners in airports"}
{"text":"Canadian Real Estate: Ready to Pop?"}
{"text":"Edgerton Police Use EXCESSIVE FORCE?? Against Black Man During Arrest?"}
{"text":"Identity politics: Swedish girl shows the stupidity in denying facts (English subtitles)"}
{"text":"Jewish\/Zionist conspiracies and false flag attacks. Should Jews have a country or not?"}
{"text":"Stunning video of crime in Berlin today"}
{"text":"The Supreme Court has allowed the FBI to hack any computer in the world with a warrant"}
{"text":"UK Labor Party Witch Hunt: â\u0080\u009cAre You Now or Have You Ever Been Anti-Zionist?â\u0080\u009d"}
{"text":"Why sunglasses are expensive. Luxottica, the world's largest eyeware manufacturer, revolutionized the industry and essentially created a vertically integrated monopoly. [12 min] (2012) (x-post r\/Documentaries)"}
{"text":"EPIC Commercial Aliens Attack | UFO DISCLOSURE"}
{"text":"Got Mumps?"}
{"text":"EU to offer Turkey visa-free travel as Ankara ‘satisfies most requirements’"}
{"text":"We Will Bring Israeli Law to Judea and Samaria Within A Year"}
{"text":"“Earth has shifted”-Inuit elders issue warning to NASA and the world"}
{"text":"Israel’s justice minister pushes for Israeli law to be applied in West Bank"}
{"text":"Facebook Cencors And Manipulates What Your Friends Post and What You See"}
{"text":"Chaotic Live Streaming: 5\/3\/2016 Discussion - Oregon StandOff, Agenda21, Mandela Effect, Apathy"}
{"text":"Why Are There Still Palestinian Refugees?"}
{"text":"Russian creator of malware ordered to pay $6.9 million"}
{"text":"TOP 7 theories why Craig Wright is coming out as Satoshi Nakamoto"}
{"text":"Lynne Patton \"The Trump Family That I Know\" - A Black Female Trump Executive Speaks"}
{"text":"Chickenpox (Varicella) Vaccine Creates Shingles Epidemic"}
{"text":"Homeless Man Owes Government Over $110,000 In Fines For Being Homeless"}
{"text":"Merck's efforts for more than a decade to defraud the United States through Merck's ongoing scheme to sell the government it's mumps vaccine that is mislabeled, misbranded, adulterated and falsely certified as having an efficacy rate that is significantly higher than it actually is.(pdf)"}
{"text":"Massive vaccine protests erupt in China over widespread deaths of children ... Govt. responds by arresting protesters"}
{"text":"A World Waking Up: Damage After Vaccination; It’s No Longer An “Anecdote”"}
{"text":"Two dozen civilians killed in Aleppo hospital attack"}
{"text":"Traces Of Giants Discovered Worldwide"}
{"text":"7\/11 was an Indian job"}
{"text":"Solitary confinement is 'no touch' torture, and it must be abolished Chelsea E Manning"}
{"text":"US Army Unit Implicated in Yellow Fever Outbreak that Threatens to Kill Hundreds of Thousands"}
{"text":"found a new subreddit. aliens and ufos."}
{"text":"Israel aids ISIS - Israel chief of staff gets hacked"}
{"text":"Conspiracy theory about Democratic primary"}
{"text":"Banks Assert Constitutional Right to Billions in Subsidies"}
{"text":"Former FBI agent admits to stealing money seized in drug probes to buy cars and plastic surgery"}
{"text":"Are we in ... Heaven is a Place on Earth — In Pursuit of Happiness"}
{"text":"US Foreign Policy in Africa and the 2016 Elections"}
{"text":"Eugenics: The World is Increasingly Becoming Infertile; Birth Rates ALL Over America Are Steeply Falling"}
{"text":"I don't know if this counts, but I didn't upvote this G7 thing and it's got my vote... It just showed up on my front page."}
{"text":"Doctors Name Monsanto’s Larvicide As Cause of Brazilian Microcephaly Outbreak"}
{"text":"CIA Director John Brennan Warns Against Release of 28 Pages of 9\/11 Report"}
{"text":"Jimmy Kimmel and Scientists on Climate Change"}
{"text":"Seymour Hersh: Bin Laden killing story a fantasy"}
{"text":"Conspiracy theorists ask: Are we being told truth about Yorkshire 'explosions'?"}
{"text":"UFO witness tell his story to the news"}
{"text":"Well...here come negative interest rates!"}
{"text":"Conservative Think Tank President Says Voter ID Helps Conservatives Win Elections"}
{"text":"In the rest of the world it is called a \"Bribe\" in Clinton's America it's called \"Speaking Fees\""}
{"text":"Iowa farmer fired after drawing a cartoon criticizing agribusiness giants"}
{"text":"Unfolding 9\/11"}
{"text":"Hillary Clinton could steal the election with the help of a stealth startup funded by Google Chairman Eric Schmidt"}
{"text":"Mark Zuckerberg is Watching You."}
{"text":"CIA Goofs: The CIA “live-tweeted” the Osama Bin Laden raid that ended with his death five years ago. The “live-tweets,” posted Sunday as if they were happening in the present."}
{"text":"Threats to investigative journalism creep closer with erosion of source protection: Surveillance, national security legislation and data retention laws threaten the sustainability of investigative journalism."}
{"text":"You can't catch the rich!"}
{"text":"Long-time Iowa farm cartoonist fired after creating this cartoon criticizing Monsanto and others"}
{"text":"The 9\/11 cover-up continues"}
{"text":"The coming financial collapse of PENSION programs across America"}
{"text":"USA Today article: NORAD had drills of jets as weapons before 9\/11--'One of the imagined targets was the World Trade Center'"}
{"text":"Obama Jokes About the “End of the Republic,” and the White House"}
{"text":"Johnson &amp; Johnson hit with $55m damages in talc cancer case"}
{"text":"Religion\/AtheismBy The Numbers - The Untold Story of Muslim Opinions &amp; Demographics (2015)"}
{"text":"Liberals can get a paper through peer-review if it slams or demeans White people"}
{"text":"Atlantis Hall Of Records Breakthrough! Dark Journalist &amp; Dr. Carmen Boulter"}
{"text":"Blackwater’s Colombian Mercenaries in Yemen ~ The mercenaries are from outfits like Academi (formerly Blackwater), R2 (Reflex Responses), Dyncorps, and a secretive company called Vinell Corporation that was bought by Northrup Grumman."}
{"text":"Ex-N.Y. legislative leader to be sentenced for corruption: accepted millions of dollars in bribes"}
{"text":"Auditors criticize Pentagon for wasting property and ammunition: accused of misspending federal funds"}
{"text":"The Weed Killer Glyphosate Is Being Found Everywhere"}
{"text":"Quaker Oats faces lawsuit over 100% natural claim: company sprays glyphosate on oats as a drying agent"}
{"text":"NATO Alliance Getting New Supreme Commander"}
{"text":"Heroic FBI saves us from yet another \"domestic terrorist plot\" - which wasn't all that difficult, because as usual, they cultivated the \"terrorist\" from scratch, provided him with the \"bomb\", and walked him to the target."}
{"text":"ADM, Bunge Won't Buy Monsanto's New Genetically Modified Soy: criticize company for selling new strains before EU approval"}
{"text":"LEAKED: Explosive TTIP documents expose corporate takeover, dismantled climate protection"}
{"text":"Jury Orders Johnson &amp; Johnson to Pay $55 Million in Baby-Powder Cancer Suit: Verdict follows $72 million award in February; Plaintiffs say talcum powder caused ovarian cancer"}
{"text":"ISIS executes Iraqis for refusing to join terror group"}
{"text":"Warren Buffett follows Obama in urging UK to stay in EU as Bill Clinton is supposedly next in the queue"}
{"text":"Secret Rulers of the World - The Bilderberg Group - Jon Ronson (Ronson is a prolific author\/documentarian, this is a great series)"}
{"text":"EPA: 2 square mile toxic blob nearing Cleveland water plant: The EPA says the sediment is highly contaminated with cancer-causing chemicals. Cleveland water officials said Monday they are monitoring the water. Officials don’t know how fast the mass is moving or if it will actually reach the pipe."}
{"text":"Hundreds Of Pages of TTIP Agreement Leaked"}
{"text":"Hillary Clinton says she'd take Bill Clinton 'out of retirement' for White House jobs role. They reported $28 million income on 2014 tax returns in case you were interested."}
{"text":"UK – 3rd British city councilman suspended in one day for anti-Semitic posts"}
{"text":"There Have Been Over 100 Hate Crime Hoaxes In The Past Decade"}
{"text":"Why Was A Mile Long Convoy Of U.N. Vehicles Traveling North Through South Carolina?"}
{"text":"Obama budgets $17,613 for every new illegal minor, more than Social Security retirees get"}
{"text":"Hillary Clinton’s Foreign Policy Resumé: What the Record Shows"}
{"text":"Alien Message on Google, Webdriver Torso - down, The Rabbit Hole."}
{"text":"Weird Scenes Inside the Canyon by David McGowan: a review and recommendation"}
{"text":"Putin: Clinton or Trump is Irrelevant, The Real Problem is U.S. ‘Imperial Ambitions’"}
{"text":"Scientists finally agree that Obama is causing global warming"}
{"text":"Rafael Cruz\/Lee Harvey Oswald story going mainstream."}
{"text":"What's validity of this?"}
{"text":"Russia Today Declares 9\/11 Was An Inside Job!"}
{"text":"Bitcoin vs. The Federal Reserve Bank"}
{"text":"WTC7 Collapsed From Fire"}
{"text":"What is the goal of propaganda like this article?"}
{"text":"Zacarias Moussaoui, who was convicted of participation in the plot to hijack airplanes and fly them into the WTC and other US targets, testified that he worked as a courier between Osama bin Laden and the Saudi royal family, including Prince Salman, who is today the King of Saudi Arabia."}
{"text":"The War on Drugs Failed, So Why Isn't It Over?"}
{"text":"There's no legal basis for sending U.S. troops to Syria -- US Sen. Kaine blasts Defense Secretary Carter"}
{"text":"Suspect Hijacks Bus, Striking and Killing Pedestrian in Washington, DC"}
{"text":"Court Takes Child From Mother After She Mentions Chemtrails At School"}
{"text":"Dr. Persinger (purportedly of mind control program \"Sleeping Beauty\") and his God Helmet"}
{"text":"Uncle Sam has no right to preach on human rights"}
{"text":"Deleted from \/r\/syriancivilwar by al-qaeda supporting moderators: video exposes ties between US funded \"white helmets\" and ultimate terrorists of Al Qaeda."}
{"text":"Business Insider and the Department of Defense say Assad has to go. Wait a minute, isn't that exactly what ISIS wants?"}
{"text":"SSA Putting Millions of Americans at Risk for Identity Theft"}
{"text":"Can someone convince me that the illuminati conspiracy is a fact in our times?"}
{"text":"US Official Addressing Graduating Class Mentions Hybrid Armies &amp; Little Green Men"}
{"text":"9\/11 widow Kristen Breitweiser: \"as someone who has looked for specific documents on the National Archives website, I can state emphatically that many of the 9\/11 Commission’s most vital and damning documents remain redacted, withheld, classified and\/or unavailable to the public.\""}
{"text":"‘Saudis Did 9\/11’ is a Zionist Ruse"}
{"text":"V for Vendetta was cool; but the Real Guy Fawkes was a Jesuit spy who tried to kidnap and make a catholic monarch puppet out of a young protestant woman prior to her wedding, to a man that would be King for one winter"}
{"text":"The Danger Of Big Pharma’s Silent Hold Over The US Government"}
{"text":"Instantly Down Voted On Video Submission"}
{"text":"Check out this Israeli shill in World News"}
{"text":"Dead could be brought 'back to life' in groundbreaking project"}
{"text":"What's your favourite conspiracy theory?"}
{"text":"USGS Major Screw-UP Major mag. 7.9 and M 7.2 Earthquake Not Reported"}
{"text":"Media Monarchy: May 3, 2016"}
{"text":"‘Our economic system is designed to fail’ – Ron Paul"}
{"text":"Remember how we learned the protesters are paid?"}
{"text":"Pay Back (2013)"}
{"text":"The Deafening Silence Surrounding Fish Kills"}
{"text":"Obama defends Pedophiles -- \"As you know Spotlight is a film, a movie...with the resources and autonomy to chase down the Truth. Best Fantasy film since Star Wars.\""}
{"text":"Prominent Democratic Consultants Sign Up to Defeat Single Payer in Colorado"}
{"text":"Opening some eyes at The_Donald with some well known facts"}
{"text":"Speaker Maker Bowers &amp; Wilkins Sells Out to a Tiny Silicon Valley Startup"}
{"text":"Popular heartburn medication linked to chronic kidney disease"}
{"text":"Why Are So Many Healthy People Dying from the Flu After Receiving the Flu Shot?"}
{"text":"Got Your Vaccine at CVS, Walgreens, Rite Aid, Etc.? Better Keep Your Receipt In Case You Have a Case!"}
{"text":"Edward Snowden: Whistleblowing Is Not Just Leaking — It’s an Act of Political Resistance"}
{"text":"If you have an android phone, turn off the \"okay google\" features. Story inside..."}
{"text":"Ted Cruz’s dad Rafael played role in John F. Kennedy assassination, Trump claims"}
{"text":"Fungal pathogen related to one that caused the Irish potato famine in the 1800s, is now unstoppable outbreak of \"sudden oak death\" killing forests in California"}
{"text":"Cam Footage of Lieutenant Shooting His Own Detective During Drug Bust"}
{"text":"Trump brings up Rafael Cruz's ties to Lee Harvey Oswald"}
{"text":"WATCH: Donald Trump Connects Ted Cruz's Father to Lee Harvey Oswald - Full Interview May 3rd 2016"}
{"text":"Connecticut Rabbi Who Was Police Chief Accused of Sex Abuse - A former police commissioner in New Haven, Connecticut, who became a rabbi is accused of sexually abusing a teenager in his care from 2001 to 2005, according to a federal lawsuit filed on Tuesday"}
{"text":"An investigative economist has crunched 45 years of official statistics to discover just how much kleptocrats have plundered from 150 mostly poor nations."}
{"text":"We Are the Bottom Class: Trained to Never Recognize Power, Hegemony, Our Enslavement"}
{"text":"Has anyone ever done analysis on this alleged photo of Michael Hastings?"}
{"text":"George Friedman, \"Europe: Destined for Conflict?\""}
{"text":"Public opinion : Does playing violent video games cause violent behavior Survey (should they be banned)"}
{"text":"OxyContin maker moves to block the release of court records to news publication seeking documents related to Kentucky lawsuit (Purdue settled for $24M)"}
{"text":"How the US uses sexual humiliation as a political tool to control the masses"}
{"text":"Why the Civil War was based on lies"}
{"text":"The U.S. Government Has Been Outsourcing The Gitmo Trials: DoD has given a multimillion-dollar contract to one private company — to serve both the defense and the prosecution in the Gitmo terror cases."}
{"text":"Cops Enter Home Without Warrant After Smelling Marijuana!"}
{"text":"The Concept of Time and Membership in Secret Societies"}
{"text":"There's Only One 'Honest' Position On Obama-Trade - Kill It"}
{"text":"Revealed – US Senate Document Confirms National and Global Weather Modification (Geoengineering) Programs"}
{"text":"Anonymous Takes Down Police Website After They Killed an Unarmed Man in Front of His Family"}
{"text":"10 Everyday Foods That Monsanto Has Destroyed"}
{"text":"Infuriating Report Shows How Govt &amp; Big Pharma Intentionally Break Laws to Reap Massive Profit"}
{"text":"Just when Sanders got going..."}
{"text":"Russia Has Decided To BAN The Use Of Genetically Modified Ingredients In All Food Production"}
{"text":"TIL NIST hired Underwriter Laboratories to perform testing of the Twin Tower floor assemblies in a 2-hour, 2,000°F fire test. During the tests, the trusses did not fail—and sagged only 4” after 60 min and 6” after 100 min. NIST's final report claims these trusses sagged more than 40” (NCSTAR1-6B)"}
{"text":"Hillary Clinton admits the jesuit controlled CFR gives the Orders ( 2009 )"}
{"text":"Why today’s global warming has roots in Indonesia’s genocidal past"}
{"text":"The REAL reason cars are so expensive: \"Cars are one of the last commodities that don't behave like commodities because of the franchise system\""}
{"text":"UK opposition leader voicing support for groups resisting JSIL"}
{"text":"Donald Trump is obsessed with race-baiting conspiracy theories"}
{"text":"WikiLeaks on Twitter: \"We'd like to thank #Satoshi hoaxer Dr Craig Wright for showing how bankrupt the fact-checking standards are at the BBC, LRB &amp; Economist.\" : Bitcoin"}
{"text":"If Trump is nominated, the GOP must keep him out of the White House"}
{"text":"Many Surprising Foods Found to Contain Monsanto's Deadly Poison"}
{"text":"This is from ex Naval Intelligence member William Cooper in his book Behold A Pale Horse"}
{"text":"Why we need an Investigation into Election Fraud"}
{"text":"\"LulzBoat\" Sets Sail: Anonymous Hacks NSA, CIA, FBI, NASA, &amp; Releases Massive Dox"}
{"text":"Obama comments suggest nepotism and election fraud at White House Correspondent's Dinner -- because he implies that Hillary will be the next president."}
{"text":"Carefully timed deals help big money managers skirt dividend taxes in 20 countries, confidential documents show."}
{"text":"Trump says Israel should keep building settlements"}
{"text":"WTF IS THIS SHIT FOR REAL ? CHINA'S ARMY NEW SONG"}
{"text":"Tower of Babylon?"}
{"text":"wtf is this ? is this for real ? china's army new song ww3"}
{"text":"Too Much Aid for Israel, Says Public ~ Three-fifths of Americans now oppose massive wealth transfer to Zionist state... Yay!"}
{"text":"The Empire's War on Latin America: Wall Street, Washington, and the Neoliberal Conspiracy"}
{"text":"The subtle and not so subtle ways in which the NY Times Whitewashes the Scandal of Israel’s Child Prisoners"}
{"text":"The Mask Comes Off: Putrefaction Most Foul targets Mr. Trump"}
{"text":"Woman Mysteriously Survives Temperatures Hot Enough To Melt 100 Stories of Steel."}
{"text":"Remember the comedy documentary, \"The Aristocrats\" that wasn't very funny. Thomas Sheridan helps to explain what I believe this to be actually about: whistleblowing on occultism among the ruling class."}
{"text":"Remember the comedy documentary, \"The Aristocrats\" that wasn't very funny? Thomas Sheridan helps to explain what I believe this to be actually about: whistleblowing on occultism among the ruling class."}
{"text":"Bank of North Dakota Soars Despite Oil Bust: A Blueprint for California?"}
{"text":"World Press Day: Here's a clip of one of Michael Hastings' last fearless interviews (can anyone find the Full interview?)"}
{"text":"Am I and my business being surveilled by the Oligarchy?"}
{"text":"Google given access to UK patient records for research"}
{"text":"May 3 WSO Updates - HUMONGOUS Planet Capture on H1???"}
{"text":"video: national billboard campaign sighted that exposes the 'legal name' \/ 'strawman' fraud! | ureka.org"}
{"text":"The New American Mobile"}
{"text":"PAZUZU DEMON: Queen Gives Planning Permission for Statue from the EXORCIST MOVIE |"}
{"text":"Inside the Assassination Complex: Whistleblowing Is Not Just Leaking — It’s an Act of Political Resistance (Edward Snowden)"}
{"text":"Trump Voter Confronts \"Lyin Ted\" - So Funny!"}
{"text":"Colorado Department of Health Trying to Start Unvaccinated Persons Registry"}
{"text":"\"I doubt the government pays anyone besides its press secretary to say positive things about the government.\"- Oblivious Redditor. Too many people are not aware that shills are real."}
{"text":"Trump Supporter Confronts Cruz About Mistresses \"Okay Lyin' Ted!\""}
{"text":"What's your thoughts on the Denver airport pictures?"}
{"text":"2014 Xinjiang massacre may have resulted in 3000-5000 deaths [x-post from \/r\/China]"}
{"text":"Fox's Host: Trump is Pivoting Into The \"Alex Jones\" Presidency With His Conspiracy Theories"}
{"text":"Indian Point Power Plant Update and 2 Other Nuclear Power Plant Incidences"}
{"text":"Cruz gets heckled by pro-Trump funny guy in Indiana: ‘America is a better place... without you.’"}
{"text":"20 tasings in 30 mins: No charges for Virginia police officers over man's death in handcuffs"}
{"text":"Fox's Host: Trump is Pivoting Into The \"Alex Jones\" Presidency With His Conspiracy Theories"}
{"text":"Dem AG Targets 90 Conservative Groups in Climate Change Racketeering Suit"}
{"text":"Seven big banks settle U.S. rate-rigging lawsuit for $324 million"}
{"text":"Obama Plan to Cut Refugee Screening Time Raises Concerns About Terrorism"}
{"text":"The 50-year-old mystery behind that photo of Lee Harvey Oswald"}
{"text":"Top \/r\/WorldNews post is pure Israeli shill propaganda: Shipment of farming chemicals (that can't even be used as fuel i or explosives) and FLOUR seized and declared to be \"rocket fuel\" to justify Israel's illegal occupation. Allowef to stay up despite blatant lies and blog site."}
{"text":"NYTimes: Anti-GMO groups \"weave facts, half-truths and pseudoscientific analysis into sinister assertions\" to implicate Monsanto in Zika crisis"}
{"text":"Colombian hacker \"100% sure U.S. elections are rigged\""}
{"text":"'Harmless' Seasoning Contains Cancer Causing Ingredient?"}
{"text":"Buddy Holly"}
{"text":"American Taxpayers Forced to Promote GMOs"}
{"text":"Congressman Says Scale of Clinton’s Wrongdoing May Cause FBI Probe to Stretch Past Election"}
{"text":"Can anyone explain what\/who the Bilderberg Group is and what the conspiracy is behind it?"}
{"text":"Russian artillery devastates rebels in Aleppo as Syrian Army retakes vital fortification"}
{"text":"Watch \"‘I oppose today’s so-called capitalism’ ‒ Ron Paul on free-market economy\" on YouTube"}
{"text":"Police Pepper Spray Baby and 8-Year-Old as Innocent Mother is Dragged From Car With No Reason"}
{"text":"Top \/r\/WorldNews post is pure Israeli shill propaganda: Shipment of farming chemicals (that can't even be used as fuel or explosives) seized and declared to be \"rocket fuel\" to justify Israel's illegal occupation. Allowef to stay up despite blatant lies and blog site."}
{"text":"Gender Neutral Bathrooms--It's OK"}
{"text":"Facebook confirms what we already knew: 'We Pick What's Trending; Regularly Avoid Promoting Conservative News Outlets.'"}
{"text":"PBC News &amp; Comment: Judge Rules Against Arizona Activists Who Demanded Rerun of Botched Primary"}
{"text":"For all of the Bernie supporters out there"}
{"text":"Oregon StandOff: The Road To Burns - A Truth Documentary - Ammon Bundy, Pete Santilli, Blaine Cooper"}
{"text":"University Of North Texas Team Helps Develop Drug-Sniffing Car « CBS Dallas \/ Fort Worth"}
{"text":"Chemtrails and The Bioapi"}
{"text":"Authorities want access to Panama Papers (it's all about money)"}
{"text":"Fox's Host: Trump is Pivoting Into The \"Alex Jones\" Presidency With His Conspiracy Theories"}
{"text":"I am a Hillary Clinton shill AMA!"}
{"text":"HOT WOMEN IN ADS BANNED TO PLEASE FAT FEMINISTS. Thin, attractive girls censored because they trigger obese, ugly Social Justice Warriors*"}
{"text":"Occult Symbolism on The Groundwork's Website"}
{"text":"Is $500 Billion In Political Bribes A Problem?"}
{"text":"FBI Recently Learned to Exploit the Tor Browser, Users May Be In Trouble"}
{"text":"Breaking: Cruz suspends presidential campaign after Indiana rout"}
{"text":"The Rothschilds are Jesuits"}
{"text":"FBI Granted Warrant Forcing Woman to Unlock iPhone"}
{"text":"Bitcoin Creator FORCED to come forward after pressure from high level \"friends\""}
{"text":"12-Year Old Child Reveals One of the Best Kept Secrets in the World"}
{"text":"Thank god for the freedom of information act"}
{"text":"Gay couple wounded in homophobic attack in Israeli resort town of Eilat"}
{"text":"The Land That Broke Its Promise : THE SEVENTH MILLION: The Israelis and the Holocaust, By Tom Segev (Hill &amp; Wang: $27.50; 580 pp.)"}
{"text":"Israel rejects French peace effort proposal"}
{"text":"\"The CIA, after all, is nothing more than the secret police of American capitalism, plugging up leaks in the political dam night and day so that shareholders of US companies operating in poor countries can continue enjoying the rip-off.\""}
{"text":"Britain’s accidental “red pill” moment - Naz Shah was the victim of a “well-orchestrated campaign by the Israel lobby”"}
{"text":"Israel’s Assault On Democracy: Time To Speak Out"}
{"text":"Real-time Facial Reenactment Software Creates Fake Videos of People Talking That Looks Real"}
{"text":"The Clinton's had some interesting friends."}
{"text":"The woman, who was killed by Israeli soldiers along with her brother, was pregnant"}
{"text":"IDF commander: Hezbollah preparing for war, just like in 2006"}
{"text":"Ted Cruz Ends His Campaign for President - NYTimes.com"}
{"text":"An Understanding of the Concept \"Political Ideology\" Explains Why Zionism is Delusional"}
{"text":"The Biggest Scam In The History Of Mankind - Who Owns The Federal Reserve? Hidden Secrets of Money 4"}
{"text":"Trump wins Indiana, and most likely the nomination-- but let's remember that none of 2016's candidates are really running for the people."}
{"text":"The entire genre of Pop Music is designed to reprogram you as the ultimate consumer."}
{"text":"Really Creepy \"Non-Denial\" from Loser Ted Cruz \"Yes, My Father Killed JFK\". Can he just deny the claim outright? Or is it true?"}
{"text":"On r\/Conspiracy...upvote a post, see the tally go up one. Hit refresh, watch it go down. Whats up with that?"}
{"text":"Isn't it creepy how bad Lebron James wants to be Michael Jordan."}
{"text":"Bias against Bernie Sanders. Google I believed in you."}
{"text":"Behind the massive vaccine scandal in China"}
{"text":"Purging the Palestinians - The British try out a new version of free speech"}
{"text":"Study: Mass Surveillance Breeds Meekness, Fear and Self-Censorship"}
{"text":"Which Evil Dictator Killed The Most People?"}
{"text":"I don't know whether Trump really is anti-establishment... but I sure as hell know this guy was."}
{"text":"What is up with my school testing my hearing?"}
{"text":"Has anyone considered the possibility that Trump is a Democrat conspiracy to easily put Clinton in office?"}
{"text":"Google Now Has Access To Millions Of Patients’ Medical Records"}
{"text":"Facial scanning software being tested in NSW nightclubs, can be linked to police data bases."}
{"text":"Israel admits Yasser Arafat deputy's assassination"}
{"text":"I'm hosting an AMA about a Las Vegas DUI school created by a former judge that pays the court for each registration (with an office in the courthouse and $125 more than any other class) Come on over!"}
{"text":"Cynthia McKinney presents to the \"9\/11 Revisited Conference\" in Kuala Lumpur. She discusses her battles with the Zionist lobby and Israel's involvement in the events of 9\/11 [Must-see, Saudi 9\/11 Un-misdirection]"}
{"text":"TO ALL THOSE DOUBTING TRUMP"}
{"text":"Analysis: Israel and the Saudis covert ties - Israel News"}
{"text":"Israeli arrested in Romania for spying on government agency"}
{"text":"To All Those Doubting Trump"}
{"text":"U.S. National Security Agency head paid secret visit to Israel"}
{"text":"I believe these people are the ones launching rockets from Palestine into Israel. (More in comments)"}
{"text":"Medical errors now third leading cause of death in United States"}
{"text":"Birds of prey spread bush fires deliberately"}
{"text":"Kerry wants more propaganda: US increasing funding to train 750 journalists worldwide"}
{"text":"It's Time To Talk About Chemtrails And Geoengineering - Matt Landman on PFT Live"}
{"text":"1.7 million Japanese too much for thousands of crematoria. A few dozen German crematoria burned 6 million Jews in 4 years."}
{"text":"LulzSecGB seems to have hacked multiple organizations and found evidence of secret Apollo 18 mission and UFO photo from space"}
{"text":"\"In the name of profit\" RT's 30 minute documentary exposing the close ties between ISIS and Turkey"}
{"text":"That Sugar Film (2016) - exciting awarded documentary with Hugh Jackman and Stephen Fry, which explores in an entertaining way the effects on your body that sugar has, sugar (the white poison) which is found in over 80% of supermarket foods today"}
{"text":"Trump Landslide Panics Elites, Cruz Craps Pants"}
{"text":"Is this book predicting famous deaths? Are they really dead? Can we save them."}
{"text":"A Vitamin that Stops the Aging Process of Organs"}
{"text":"Prices Of These 10 Foods Have Skyrocketed In The Past Year"}
{"text":"\"I Don't Know How To Explain It\" - Confused Clinton Can't Explain Own Comments To Coal-Miner"}
{"text":"What would happen if the other nominee in a presidential election was assassinated?"}
{"text":"TWL #7: This Number is Illegal"}
{"text":"Why doesn't anonymous set up a reddit like website with independent mods, a reddit without shills etc"}
{"text":"Wildfire in Oil Capital of Canada evacuates entire city of Fort Mcmurray, AB"}
{"text":"The Donald Plays the Cruz-Oswald Trump Card"}
{"text":"Seymour Hersh dishes on the Saudis, the killing of bin Laden, the supply of Libyan sarin gas to Syrian rebels, and Obamas plans for Syria nobody can explain"}
{"text":"Government IS the problem"}
{"text":"As Geo Engineering Has Increased Birth Rates Have Gone Down, And Death Rates Have Gone Up."}
{"text":"The Term “US Hegemony” Really Means Every Country In The World Must Borrow From A International Oligarch Owned Central Bank, And Not Print\/Create Their Own Money, Or Be Attacked Militarily."}
{"text":"Gold Is Money, But It Is Garbage For Backing A Money Supply."}
{"text":"“Illuminati” Is Just A Fucked Up Word Synonymous With “International Oligarchs”."}
{"text":"The International Oligarchs Have Killed Us, Can We Make It?"}
{"text":"The Only Reason They Are The International Oligarchs Is Because Woodrow Wilson And Congress Gave Them An Exclusive Monopoly To Print\/Create The Worldwide Money Supply Through Lending Money To All Governments, Who Are Prohibited From Printing\/Creating The Money Themselves."}
{"text":"C-Span Republican caller definitely don't like Hillary (30 fun seconds, 5\/3\/16)"}
{"text":"FBI: Hitler Didn’t Die, Fled To Argentina by Submarine - Stunning Admission on File."}
{"text":"CDC Scientist Connects Vaccines to Tics, Language Delay - Recording #4 | #CDCwhistleblower"}
{"text":"ISIS may be making chemical weapons, warns watchdog"}
{"text":"ABC’s ‘Quantico’: American Terrorist Cell Shouts ‘Make America Great Again’ Before Attack"}
{"text":"Concept of jewish law explained"}
{"text":"Ignore the smears: Bernie Sanders is right about Israel’s heinous atrocities in Gaza — he just got the numbers wrong"}
{"text":"Roger Waters Exposes Zionist Media Blackout"}
{"text":"Connecticut Governor to Sign Gun Confiscation Bill — Here Are the Key Details"}
{"text":"Lessons from Iraq’s Green Zone Protests"}
{"text":"In what can only be described as scientific fraud, Dr. Thompson is now poised to publish “a rework” of the data in a blatant attempt to exonerate the MMR vaccine."}
{"text":"In historic first, Chinese police to patrol in Italy"}
{"text":"2013 to 2015; the NSA and CIA doubled the number of warrantless searches they conducted for Americans’ data in a massive NSA database ostensibly collected for foreign intelligence purposes, according to a new intelligence"}
{"text":"Why Did NASA Bombed the Moon?"}
{"text":"On James Corbett"}
{"text":"50 million people across the Arab world paid bribes for public services last year, survey says"}
{"text":"CIA Director John Brennan says secret '28 pages' of 9\/11 report about Saudi Arabia should remain secret | Americas | News"}
{"text":"Mysterious Human-like creature found in Mexico"}
{"text":"US is Absurd to Back Police Brutality against African Americans under Obama"}
{"text":"Reddit’s plan to become a real business could fall apart pretty easily but - \"Reddit's sales team has more than doubled since the beginning of this year, and will continue to grow as we launch new products.\" Steve Huffman flicks at the possibility of an eventual IPO."}
{"text":"What will happen when everyone in the Panama Papers is revealed next week"}
{"text":"Chaotic Live Streaming: 5\/4\/2016 Discussion - Oregon StandOff, Mark McConnell, Autism, NLP, Suicide"}
{"text":"Why Activists Today Should Still Care About the 40-Year-Old Church Committee Report"}
{"text":"Trump should pick Bernie Sanders as his running mate if Hillary get's the Nomination."}
{"text":"Israel settlement construction should keep going: Trump"}
{"text":"MH370 conspiracy theories: What happened to the Boeing 777? Wild rumours continue to circulate about the fate of the Malaysian Airlines jet"}
{"text":"Where's The Fair Use Progress"}
{"text":"Did this bill ever get passed?"}
{"text":"Don't let U.S. become next Rome: Entrenched political elites will sacrifice anything to retain power, including their own country."}
{"text":"SONIC BOOM: Conspiracy website says drama was start of WW3 as UFO shot down after rising from sea"}
{"text":"Mark Zuckerberg &amp; Facebook Are Censoring Conservative News Posts"}
{"text":"Greenpeace Netherlands releases TTIP documents"}
{"text":"Pentagon: U.S. bombing of Afghanistan hospital not a 'war crime'"}
{"text":"UN Declares Israel As Having World’s Worst Human Rights"}
{"text":"Do you think that Donald Trump is a plant? He is going to guarantee Hillary Clinton the election."}
{"text":"Banned In Hollywood! The Movie They DON’T Want You To See! Civil War Imm..."}
{"text":"(Warning: GRAPHIC) How the Media Uses Pictures to Protect Islam"}
{"text":"NASA CONFIRMATION: Planet X Is Real!!! Now What?"}
{"text":"Interesting Facts About The Black Knight Satellite"}
{"text":"A CIA conspiracy I think we all can agree is 100% accurate - The Drug Trade."}
{"text":"A Whistleblower Manifesto By Edward Snowden"}
{"text":"Was attack on MSF hospital in Aleppo a US-NATO false flag operation?"}
{"text":"live chemtrail cam"}
{"text":"Lynch’s Climate Gestapo Closely Mirrors Reich “Protections” Doesn't prosecute Hillary or Goldman Sachs"}
{"text":"We're Facing The Most Evil People The World Has Ever Seen"}
{"text":"NATO okays Israel office in its Brussels headquarters"}
{"text":"Watch This Video &amp; You Will Never Eat McDonald’s French Fries Again"}
{"text":"Does anyone else see pentagrams made by Chem trails?"}
{"text":"Seven big banks settle U.S. rate-rigging lawsuit for $324 million | Reuters"}
{"text":"It ain't Easy being Heidi Cruz!"}
{"text":"Semen-Clinton controversy-Front page of Drudge Report- May the force be with You."}
{"text":"East Coast Earthquake Alert, \"The Plate is Peeling\""}
{"text":"Jacob Schiff: A case for the most powerful man in US history"}
{"text":"Clinton, Fried Chicken, and Semen conspiracy?"}
{"text":"TIL Muslim population in France is growing two times, three times, or six times the French average population growth."}
{"text":"Are Assassination Teams Waiting To Kill Trump?"}
{"text":"Study: Type 1 diabetes, allergies, and other autoimmune diseases have taken hold in Western countries with modern economies, while barely making a mark in the developing world"}
{"text":"Open Letter to Kevin Ryan about Israel and 9\/11"}
{"text":"Mary Antin: Jewish Nationalist and Open Borders Advocate ~ The prototype of the common modern jewish belief that jews should have their own country while non-jewish countries should have open borders and allow anyone to immigrate who wants to come in."}
{"text":"I think the USA police actually think they are US IDF more than civil servants they are purportedly are."}
{"text":"London Is About To Elect A Muslim Mayor Who Has Defended Islamists, 9\/11 Terrorists, And Who Is Endorsed By Anti-Semites"}
{"text":"Del Bigtree Uncensored - Interview with the Director of VAXXED - \"The Biggest Story of my Life”"}
{"text":"TTIP—American Corporate Imperialism Paul Craig Roberts"}
{"text":"Book Review: And Nobody Died in Boston Either (2016) [Boston Marathon Bombing]"}
{"text":"Requests for data rise sharply under secretive U.S. surveillance orders: FBI requests for customer data rose almost 50% in just one year, do not require a warrant and usually accompanied by a gag order"}
{"text":"Inside the Dominican Government's Mulatto Breeding Program"}
{"text":"Did reddit bring down Bernie Sanders campaign? \"Feel the bern\" has to be the shittiest meme ever."}
{"text":"Australia Plans To Give Its Invasive European Carp Herpes"}
{"text":"How Big Oil Conquered the World - James Corbett"}
{"text":"9\/11: A Conspiracy Theory - 5 minutes on 9\/11 - original work by James Corbett - Almost 3,000,000 views."}
{"text":"How Facebook, Instagram, Google, and Twitter Use Censorship to Kill Free Speech"}
{"text":"What the hell is going on in the Silver Market?"}
{"text":"Over Half of Americans Now Believe the Voting System Is Rigged"}
{"text":"Blacks In This Country Are Becoming More Racist Than Whites!"}
{"text":"The Real Reason Ted Cruz Dropped Out Of The 2016 Presidential Race!"}
{"text":"Five Steps To Tyranny (2000) One of the greatest threats we face are the masses of normal people conditioned to blindly obey authority"}
{"text":"New Yorkers unleash rage over alleged primary voter fraud"}
{"text":"NFL Warns Players About Eating Too Much Meat In Mexico, China"}
{"text":"How the Jews infiltrated the Vatican &amp; changed the Catholic Church"}
{"text":"Yet Again! U.S. uncovers $20M H-1B fraud scheme. The U.S. government has indicted a Virginia couple for running an H-1B visa-for-sale scheme the government said generated about $20 million."}
{"text":"Russia warns of retaliation if NATO makes more deployments in Eastern Europe"}
{"text":"IED Found Under Bridge Near Rosebud"}
{"text":"NPR money \"expert\" says repeatedly in story that the Federal Reserve is a part of the federal government"}
{"text":"An Army Captain Takes Obama to Court Over ISIS Fight"}
{"text":"6 “Conspiracy Theories” That Are Now Proven Facts"}
{"text":"Panama Tax Haven Scandal: The Bigger Picture"}
{"text":"Montana conspiracy..."}
{"text":"Nearly 40 Percent of Floridians Think Ted Cruz Might Be Zodiac Killer"}
{"text":"Melania Trump is a soviet spy."}
{"text":"Defense Department’s Benghazi Letter Reeks Of Democratic Coordination"}
{"text":"HILLARY THE SPY?"}
{"text":"Books about Israel\/Palestine?"}
{"text":"Warren Buffett Warns of Bank Runs 2016"}
{"text":"Hillary the Spy?"}
{"text":"Snowden: “We Are Like Tagged Animals”"}
{"text":"White House Caught Blackmailing EU to Force Them to Import GMO and Hormone-Laden Products"}
{"text":"Legit NWO whistleblower or shill?"}
{"text":"Israeli minister: Criticizing Israel is the new anti-Semitism"}
{"text":"Short: The very first time a \"Perdue\" chicken-factory farmer allows film crew inside the farm to reveal the cruelty on chickens and the despicable conditions they are rapidly raised in. (2014) [CC]"}
{"text":"Wish more girls would say this to me"}
{"text":"Sign the Petition over at AE911Truth — Architects &amp; Engineers Investigating the destruction of all three World Trade Center skyscrapers on September 11"}
{"text":"Operation Popeye"}
{"text":"why if ur asshole sucks up things and we don't know."}
{"text":"Concerns Over Use of Glyphosate-based Herbicides and Risks Associated with Exposures: a Consensus Statement"}
{"text":"What is going on with glyphosate? EPA’s odd handling of controversial chemical"}
{"text":"Comeback of the STASI in Sweden? - Now the police in Sweden makes house searches if you write the \"wrong\" thing on Facebook."}
{"text":"Turks flock to visa centres as EU backs open borders"}
{"text":"August 2016 martial law?"}
{"text":"Valentino's Ghost: Framing the Arab Image (2012)"}
{"text":"Blogger who exposed Marco Rubio's foam parties dies in suspicious suicide"}
{"text":"AE911Truth on youtube; Watch Controlled Demolitions of 3 Towers"}
{"text":"Hay r\/conspiracy , I'm looking for a host for a new conspiracy theory show"}
{"text":"BLM Leader: ‘We Will INCITE RIOTS Everywhere If Trump Wins!’"}
{"text":"Did Vin Diesel Just Call Out Chemtrails on Facebook?"}
{"text":"Inside the Dominican Government's Mulatto Breeding Program"}
{"text":"NFL Warns Players About Eating Too Much Meat In Mexico, China"}
{"text":"Conspiring While Driving"}
{"text":"EPA Used Monsanto and Industry-Funded Research to Determine if Glyphosate Causes Cancer"}
{"text":"Your American Government (CIA) Planned and Implemented the False Flag Terror Attacks on 9-11-01"}
{"text":"‘Too little, too late’: Obama accused of ‘criminal neglect’ as he heads to Flint"}
{"text":"Did The Rise of Marijuana Awareness Create This Surge of Awakening Happening Around The Country?"}
{"text":"‘Trump is unstoppable, the nomination is his’"}
{"text":"Ted Cruz Drops Out of Presidential Race"}
{"text":"5-4-2016; Thunderstorms Destroyed by Microwave in Central America &amp; Off Mexico"}
{"text":"EU Blackmail: Brussels to fine countries \u0080250,000 for every refugee refused entry"}
{"text":"Co-formulants of glyphosate herbicides are endocrine disruptors"}
{"text":"Google Aquired Access To Millions Of Patients’ Medical Records"}
{"text":"4,609 Killed in Iraq During April"}
{"text":"New JFK Assassination Conspiracy Theory, He watched a movie a week after his assassination."}
{"text":"Drapetomania was a supposed mental illness described by American physician Samuel A. Cartwright in 1851 that caused black slaves to flee captivity."}
{"text":"The Mena Connection: Bush, Clinton, and CIA Drug Smuggling (1995) Full Length"}
{"text":"Churchill: The Unexpected Europhile"}
{"text":"Haavara Agreement and the Balfour Declaration"}
{"text":"North Dakota To Sue Federals Over Dangerous Refugee Resettlement, Planting Terrorists Among Us"}
{"text":"Conspiracy Theory: TPTB will pass the Trans-Pacific Partnership in the wake of Hillary Clinton's indictment."}
{"text":"BBC Documentary Five Steps To Tyranny Full Documentary BBC"}
{"text":"FOX NEWS: Obama signs Executive Order for possible MARTIAL LAW in AUGUST 2016"}
{"text":"Israeli minister: Criticizing Israel is the new anti-Semitism"}
{"text":"Is the Donald Trump we see on TV football manager Steve McLaren in make-up? I leave this video here as evidence."}
{"text":"President Kennedy supposedly watched a home movie a week after being assassinated"}
{"text":"your vote counts?"}
{"text":"BP Settlement Dollars intended for Coastal Areas Hurt Worst by Spill Being Siphoned Off By State Senators"}
{"text":"Democrats Call On Trump To Give More 'Conspiracy Theories' | The Daily Caller"}
{"text":"Keeping Wall Street Speeches Secret Speaks Volumes About Hillary Clinton"}
{"text":"\"It Was Time to Do More Than Protest\": 1971 Burglars Who Exposed FBI Spying Reveal Their Names, COINTELPRO"}
{"text":"This Is How Industries Benefit from Government-Funded Propaganda and FOIA Exemptions"}
{"text":"Serious question: If there was a COUP in USA against the govt., would you guys join?"}
{"text":"[Theory] r\/donald and \/r\/HillaryForPrison are subreddits created by Trump's campaign with hired posters."}
{"text":"UFO Project\/Underground military base fresno"}
{"text":"A CROWN FIT FOR A GIANT?"}
{"text":"Police investigating 'untimely death' of Westport Officer"}
{"text":"Elon Musk: ‘people have to revolt against the propaganda of the fossil fuel industry which is unrelenting and enormous’"}
{"text":"Obama \"BOOM\" Snubs the Marine and the \"F.L.O.T.U.S\" Flower Opens For Lei..."}
{"text":"Hillary Clinton and CIA director David Petraeus had a brilliant idea: they would fund, arm, and train a proxy army in Syria, overthrow the regime of strongman Bashar al-Assad, and jump on the rapidly moving train of the “Arab Spring” to extend US influence in the region. What could go wrong?"}
{"text":"Black Lives Splatter Promise Race Riots Should Donald Trump Become POTUS; Really, What's New?"}
{"text":"Overwhelming evidence that Alex Jones is a double agent, NLP mind manipulator, and Zionist shill"}
{"text":"craig wright and the satoshi conspiracy (bitcoin)"}
{"text":"Obama signs Executive Order National Defense Resources Preparedness"}
{"text":"BRICS and Brexit Countries: Secrets of the Crypt"}
{"text":"Europe has failed to learn the lessons of anti semitism -Ayalet Shaked"}
{"text":"Social Justice Icon TrigglyPuff is a Communist Jew (Cora Segal)"}
{"text":"The Liberal Elite has Betrayed the People They Claim to Defend - Chris Hedges on Reality Asserts Itself"}
{"text":"What happens if you film the front of the Federal Reserve Bank building in D.C.? Police, private police, SMG toting guards, MIB and a chopper. . ."}
{"text":"Tef Poe - Hillary (lyric video)"}
{"text":"The White House And Soros-Backed Open Borders Group Strategize About Bribing Immigrants To Naturalize Before 2016"}
{"text":"The Andrew Crosse Experiment"}
{"text":"CNN Pro Hillary Propoganda"}
{"text":"LSD Micro-Doses Unleash Creativity For Bay Area Professionals. “People are finding that low-dose LSD permits their mind to be more expansive in terms of problem-solving, and yet at the same time they’re able to stay focused,” said Doblin."}
{"text":"Romanian hacker Guccifer: I breached Clinton server, 'it was easy'"}
{"text":"The BEST article on the existence of extraterrestrial life."}
{"text":"Breaking: Syrian Army fights back ISIS in Shaer gas field"}
{"text":"7 Times Nate Silver Was Hilariously Wrong About Donald Trump"}
{"text":"Reverse Engineering the Ancient Vibroacoustic Healing Techniques (Schumann resonance frequency)"}
{"text":"Listen, Son"}
{"text":"IDF General: Israel today shows signs of 1930's Germany"}
{"text":"A local tow truck driver said he refused to tow a woman’s car. A local tow truck driver said he refused to tow a woman’s car"}
{"text":"A local tow truck driver said he refused to tow a woman’s car. When he saw “a bunch of Bernie Sanders stuff” he said he told the woman, “very politely,” that he could’t tow her car because she was “obviously a socialist” and advised her to “call the government” for a tow."}
{"text":"Did Cruz Drop Out To Cover Up Kennedy Assassination Connection?"}
{"text":"Iran: Israel Protecting ISIS in Syria - “Had it not been for Israel’s intelligence backup for the terrorists, the terrorist groups in Syria would have surely been destroyed around 2 to 3 years ago,”"}
{"text":"\"At the end of the day, it’s not the actions of any particular individual that instills true fear in the U.S. establishment and deep state government. What really scares them is a population capable of critical thought beyond false left-right paradigm talking points...\""}
{"text":"Donald Trump: Audit the Federal Reserve"}
{"text":"Kuwaiti airline stops flights rather than accept Israelis"}
{"text":"Let Us Remember the Fallen: 4 Kent State University Students Lost Their Lives on May 4th, 1970 Protesting War in South East Asia."}
{"text":"They're Bringing Back Feudalism... And Nobody Seems To Notice"}
{"text":"How to Prepare for Economic Collapse"}
{"text":"Warren Buffet’s Son Is Using His Father’s Billions To Help Feed The World"}
{"text":"Are polls secretly being rigged to make money on prediction markets?"}
{"text":"Half of immigrant-led households collect welfare as admission rules go unenforced"}
{"text":"ABC TV Show Depicts Trump Supporters As Terrorists"}
{"text":"Stumped by (Soon-To-Be) President Trump: President Vicente Fox Apologizes to Trump, Invites to Mexico. Sure changed his tune now that he knows he's paying for a wall that just got 10 feet higher!"}
{"text":"TIM HORTONS CONSPIRACY"}
{"text":"Clinton or Trump is Irrelevant, The Real Problem is U.S. ‘Imperial Ambitions’"}
{"text":"Bangladesh suggests NY Fed respobsible for theft of $81,000,000"}
{"text":"Still think 9\/11 wasn't an inside job?"}