{"text":"If it became evident that politicians have no intention in letting England leave the EU,and they're simply going to stall the process. Then should the US step in to put the bureaucrats in their place?"}
{"text":"(2014) BBC Caught Red Handed Hoaxing Russian T-72's Invading. They Were Junk Tanks Bought By Ukraine for Propaganda."}
{"text":"On The Bizarre Media Blackout Of Hacked George Soros Documents"}
{"text":"Clintonite Conspiracy Theories"}
{"text":"U.S. state Wyoming makes it illegal to collect evidence of pollution"}
{"text":"Yahoo now censoring whatreallyhappened.com"}
{"text":"Documents Confirm CIA Censorship of Guantanamo Trials"}
{"text":"Officials Pull Water Supply as Dakota Access Protest Swells in Number and Spirit - \"the Standing Rock Sioux protest against the Dakota Access Pipeline is swiftly gaining strength ahead of a federal hearing on the controversial project.\""}
{"text":"Example of what people really think of Hilary Clinton."}
{"text":"Earlier this month, this Earthquake Forecasting website predicted intense seismic activity between 20 August - 4 September, 2016. We have had two major Earthquakes already (Italy and Myanmar) but an even bigger one is due - somewhere - within the next 4-5 days."}
{"text":"Try as He May, John McCain Can’t Shake Falsehoods About Ties to ISIS (maybe Donald Trump should go after his own party)"}
{"text":"Cooning For Cash: I Made $100 in 4 Hours Playing Uncle Tom Role (not me personally)"}
{"text":"JFK Assassination Conspiracy rev - a new JFK documentary by Chuck Marler"}
{"text":"Secret cameras record Baltimore's every move from above"}
{"text":"Emails Hacked Of US Media Elites"}
{"text":"Hillary Clinton hired Donald Trump to run such a terrible presidential campaign that he would never be able to get enough votes to win and she would be the next president."}
{"text":"XXX Hardcore Financial Collapse Coming"}
{"text":"Trump official: Hillary will be dead within a year"}
{"text":"For Those Who Want To Know - A Site with Sources"}
{"text":"Fukushima: Bizarre 4-eyed 'radioactive creature' baffles experts after found by fisherman in Australia"}
{"text":"Turkey\/US Invade Syria – Hillary Gets ‘No-Fly’ Zone"}
{"text":"The CIA’s Most Highly-Trained Spies Weren’t Even Human"}
{"text":"Alex Jones 'Ultra Concerned' Over Looming War With Russia, Media Blackout (Video)"}
{"text":"The tsunami of pro-Trump posts here is interesting"}
{"text":"Why is Joe Biden currently in Turkey and holding a press conference with Turkish Prime Minister Binali Yildirim when Obama or John Kerry who should be doing that? Because Joe Biden will be replacing Hillary Clinton on November's ballot. Look for more of Biden being in the spotlight from now on"}
{"text":"Barack Obama May Have Finally Destroyed America's #1 Advantage"}
{"text":"American defense contractors think you have been brainwashed"}
{"text":"Jill Stein: Clinton emails reveal security risks, ‘special deals’ for donors"}
{"text":"Soros Leaks: The Most Important Story You're Not Hearing"}
{"text":"Sanders: Big Pharma a hazard to our health | Opinion [x-post from r\/politics]"}
{"text":"9 Reasons Why Accountants Make the Best Husbands"}
{"text":"Seems like you can no longer comment on Reddit's Trump ads?"}
{"text":"\"Billionaire Peter Thiel is testing one of the most promising ways scientifically proven to reverse aging: blood transfusions from any of the millions of young blood donors. The results in the previous studies were impressive: subjects experienced reversal of aging symptoms across every organ\""}
{"text":"Synangogue with Satan 1878-2006 by A C Hitchcock"}
{"text":"What is a good backup site in case this site is compromised?"}
{"text":"CNN’s Smerconish threatens Giuliani over “9\/11 inside job”"}
{"text":"WW3 OBAMA IS THE ANTICHRIST,HERE IS YOUR PROOF"}
{"text":"Interesting Reddit comments on an Auschwitz 'gas' chamber"}
{"text":"Provoking nuclear war through media"}
{"text":"The problem with private prisons are over emphasized.ACLU: \"Today, for-profit companies are responsible for approximately 6 percent of state prisoners, 16 percent of federal prisoners, and inmates in local jails in Texas, Louisiana, and a handful of other states.\""}
{"text":"OFA launches ‘Truth Team’ to defend Obamacare, other White House policies"}
{"text":"Red Ice Live - Movie Review: Imperium (Hollywood White Supremacy Neo-Nazi Entertainment)"}
{"text":"Bar some empty rhetoric, Turkey's incursion into Syria has not been opposed by either Damascus or Moscow. Take this as evidence that Erdogan has indeed switched sides and done a deal with Assad\/Putin: Turkey halts hostilities against Damascus in return for a free run at the Syrian Kurds (YPG)."}
{"text":"This is the power of the shills."}
{"text":"Just a thougt on Martin Skhreli and defending him a bit. (first time poster here)"}
{"text":"Florida governor complains U.S. not doing enough to fight Zika"}
{"text":"‘War Dogs’ - Jewish Business practices in Hollywood"}
{"text":"AP statement on Clinton Foundation donors"}
{"text":"MASSIVE BOTNET from the \"Alt-Right\" racists using script that upvotes all reddit posts on the_donald, downvotes posts of targeted users"}
{"text":"Posting this here just in case it happens"}
{"text":"A second Shkreli appears! Seriously, is this lady related to Martin?"}
{"text":"What conspiracy or theory would you like to see a definitive answer to (proven true or false) during your lifetime? xpost askreddit"}
{"text":"4,000 Native Americans in Bundy Ranch-Style Protest as DHS Cuts Water Supply"}
{"text":"need your help"}
{"text":"flying girl in russian wood - stabilized and enhanced"}
{"text":"\/r\/EnoughTrumpSpam accuses \"alt right racists\" of vote manipulation, admin responds and says they are investigating."}
{"text":"Government Trolls Using 'Psychology-Based Influence Techniques' on YouTube, Facebook, Twitter"}
{"text":"US Considers Supporting Turkish-Backed Rebels on Syrian Border to Fight Daesh"}
{"text":"Ceding ICANN and Internet Control to Globalists"}
{"text":"I'm told this was posted BEFORE the leak"}
{"text":"\/r\/EnoughTrumpSpam accuses \"alt right racists\" of vote manipulation, admin responds and says they are investigating"}
{"text":"'Or We'll Force Them Out': Kurdish PYD Demands Turkey's Withdrawal From Syria"}
{"text":"The Only Reason The Dollar Has Not Collapsed Is Because Of Fraud, Manipulation And Graft"}
{"text":"Recently Leaked Documents Confirm Clinton Haitian Gold Scheme"}
{"text":"Not Just Hillary &amp; Pope Francis: Hacked Documents Show How George Soros Owns Obama Too"}
{"text":"Navy Says Iranian Boats Harassed US Ship in Strait of Hormuz (Potential False Flag?)"}
{"text":"'More Crisis = More Money' - Omar Mateen"}
{"text":"CERN LHC Illuminati Cabal Exposed? Satanic Human Sacrifice Video Was Real: USAF Officer Under Attack After Helping To Identify Missing Female Victim claims 'conspiracy theorists'"}
{"text":"Is the Church of the Subgenius an occult gnostic organization or a group of trolls?"}
{"text":"School Girl Found In Streets After Escaping Illuminati Sacrifice"}
{"text":"FBI uncovers 14,900 more Hillary Clinton Email Docs in Probe- 50% More t..."}
{"text":"How Elections Are Won: Voting Machine Fraud"}
{"text":"Bernie’s 'Our Revolution' or Bust: Will Sanders' New Campaign for Change Work?"}
{"text":"(VIDEO) The above Top Secret Space Program built with Reverse-engineered Alien Technology"}
{"text":"WikiLeaks Doesn't Care It's Naming Teenage Rape Victims And Outing People"}
{"text":"Tennessee Insurance Commissioner Warns Obamacare \"Very Near Collapse\""}
{"text":"The United States’ threat to shoot down Russian and Syrian warplanes is a declaration of war against these countries, says American political analyst."}
{"text":"Income tax then and now, 101 years of Income Tax 1913 - 2014"}
{"text":"Why should we believe the Bird brains?"}
{"text":"Obama Is Paving The Way For Future Presidents To Wage Perpetual Illegal Wars"}
{"text":"The \"Philippines' Donald Trump\" Surprises Critics By Unleashing \"Long-Term Economic Boom\""}
{"text":"Police crack ring that smuggled deaf Eastern Europeans into Israel to work as beggars - Israel News"}
{"text":"Trump: 48, Clinton: 37. But This Poll has Been Repeatedly Buried by the MSM."}
{"text":"Eye on the Flu Shot"}
{"text":"Did You Know That Venezuela Banned Guns for Private Citizens Only 4 Years Ago?"}
{"text":"Project Blue Beam? \"Floating City\" Appears in the Sky over China - YouTube"}
{"text":"New York Times Hosts \"\u0080\u009cTop Secret\"\u0080\u009d Meet To Cover-up Hillary Clinton Health, Destroy Fox News - WhatDoesItMean"}
{"text":"SpaceX is Fake | Elon Musk is a Fraud"}
{"text":"The Zionist Jews who run Israel have conspired and set out to destroy more buildings and slaughter a few thousand more men, women and children in the open air prison they created in Gaza. The Zionists running the US Government agree to support the Zionist Jews by not condemning the slaughter."}
{"text":"Washington takes every effort to make Russia attack Ukraine"}
{"text":"David Icke On Donald Trump, Brexit, Child Abuse Inquiry, His World Tour &amp; Much More!"}
{"text":"Assange: \"I Will Bring Hillary Down Before The Debate Stage On September 26th\" (note: Hillary brought herself down. Assange is just the messenger.)"}
{"text":"Assange: \"I Have An Encrypted File With a Dead Man's Switch And It Is About Hillary Clinton!\""}
{"text":"'Trump is a child rapist': Candidate linked to 'Lolita Express' billionaire by local GOP chair"}
{"text":"US War Crimes or \"Normalized Deviance\""}
{"text":"US Government And Turkey Begin Carving Out The Exclusion Zone"}
{"text":"Russian investigators launch war crimes case against Ukrainian defense minister"}
{"text":"US Government And Turkey Begin Carving Out The Exclusion Zone"}
{"text":"How to Break Free From The System w\/ Eric McCool"}
{"text":"Trump is currently being sued for repeatedly raping a 13 year old at Epstein's parties"}
{"text":"Conspiracy theories surrounding Israel's unemployment rates"}
{"text":"Ash Covered Aleppo Boy Was Pure Propaganda"}
{"text":"(X-Post \/r\/BlackOutNews) Truth Polling Site Destroyed By Correct The Record. Owners MISSING"}
{"text":"NY State University Now Offers 'Stop White People' Training"}
{"text":"r\/Hillaryiscorrupt new subreddit!"}
{"text":"Western Propaganda – So Simple But So Effective! | New Eastern Outlook"}
{"text":"Western Propaganda – So Simple But So Effective!"}
{"text":"Operation Mockingbird"}
{"text":"Data leak could sink India’s $3bn fleet of French-built stealth subs"}
{"text":"Words"}
{"text":"Hillary Clinton- Demoness of The New World Order for President of the USA!"}
{"text":"Why is Russia out of Iran \"abruptly\" ? This looks connected to the recent Turkish\/US crossing inside the Syrian border. Anyone has info\/ideas?"}
{"text":"Emails Of Media Elites Hacked - Dr William Mount"}
{"text":"WikiLeaks Julian Assange IT IS TIME"}
{"text":"Hitler Was Right The Goyim Revolution Documentary"}
{"text":"Unpublished article by Gaeton Fonzi (author of \"The Last Investigation\")...JFK assassination researcher visits Cuba to meet up with General Escalante, who was in charge of protecting Castro from assassination"}
{"text":"Once upon a time"}
{"text":"France to become Russia's key European ally after presidential election"}
{"text":"Hitler Was Right The Goyim Revolution Documentary"}
{"text":"Nationally syndicated radio host Michael Savage goes off on George Soros the day after the leaks."}
{"text":"How to join the Illuminati!"}
{"text":"Army Officially Declare Hillary Clinton An “Insider Threat” | Your News Wire"}
{"text":"Orlando Health, Florida Hospital won&amp;amp;apos;t bill Pulse shooting victims\/ because none were treated there?"}
{"text":"Simply Southern logo is a covert Nazi SS logo [mildly interesting]"}
{"text":"George Soros Plans Initiative to Expand Voter Electorate by 10 MILLION by 2018, Headed Up By Top Lawyer of the Clinton Campaign, Marc Elias"}
{"text":"CHINA INCREASES ITS INVOLVEMENT IN THE SYRIAN WAR"}
{"text":"Orlando Health, Florida Hospital won't bill Pulse shooting victims.. Maybe because there were never any real wounded victims treated in this false flag?"}
{"text":"Chairman of the Travis County Republican party tugging at the curtains around the Trump candidacy."}
{"text":"The US Planned to Nuke Russia In the Early 60s - Then Kennedy Nixed It"}
{"text":"China Increases Its Involvement in the Syrian War"}
{"text":"This Is How They Will Use Technology To Control All of Society"}
{"text":"Was General Patton Assassinated?"}
{"text":"It's been over 2 generations since a major popular uprising in the West"}
{"text":"Idiot Wasserman Schultz Says Legal Pot is to Blame For Heroin Epidemic"}
{"text":"The Department Of Defense Cannot Account For The $8.5 Trillion Spent By The Pentagon"}
{"text":"Alex Jones Explains Why He's So Obnoxious"}
{"text":"[Discussion] Thoughts on interest rate hike"}
{"text":"We are Living in the Matrix fo reals"}
{"text":"[They Live] Connection to reality"}
{"text":"Looks like the propaganda against Doctors Without Borders is ramping up in the face of all the war crimes against them. \/r\/WorldNews thread with completely false bullshit being brigaded the hell out of by anti-MSF shills."}
{"text":"[Discussion] Interest rate hike"}
{"text":"Fear the advancement of weaponized drones, for once they're functional our masters won't need obedient human soldiers."}
{"text":"‘UK arms and military support are fueling a brutal war in Yemen’ – Oxfam"}
{"text":"Take a moment to remember that the \"Apocalympics\" idea that was manufactured by the Western media was just another lie. Despite the circlejerk (that literally began a year ago) the 2016 Rio Olympics were perfectly fine."}
{"text":"Old Movie, \"My Dinner with Andre 1981\" Reveals the Matrix"}
{"text":"Top Clinton Campaign Lawyer, Marc Elias Heading Up George Soros Initiative to Expand Voter Electorate by 'at least 10 Million' Voters. [From Document Leaked by DCLeaks]"}
{"text":"Top Clinton Campaign Lawyer, Marc Elias Heading Up George Soros Initiative to Expand Voter Electorate by 'at least 10 Million' Voters. This Should Be a Major Red Flag."}
{"text":"Adding fluoride to public water may cause bone cancer in some, warns expert"}
{"text":"What does \/r\/conspiracy think of Zachary Hubbard's work? Here's his intro to Gematria playlist. Correctly predicted last Superbowl and NBA Finals based on numerology as well as the death of Prince and many others"}
{"text":"Turkey Invades Northern Syria — Truth of Turkish \"Coup\" Revealed?"}
{"text":"Is The Clinton Foundation Corrupt? Does Jeffrey Epstein Like Little Girls?"}
{"text":"Dr. Steven Greer : We DID go to the Moon - But the Footage was Fake"}
{"text":"What if Homosexuality\/Pride is created\/encouraged by the government and special interests to help deal with overpopulation"}
{"text":"VT Exclusive: Largest Pedophile Ring in History, 70,000 Members, Heads of State, the Rats Scramble | Veterans Today"}
{"text":"Pre programming of the impending WW3 and economic collapse?"}
{"text":"HRCTR: Give the acronym your voice!"}
{"text":"Why haven't I been hearing much about a \"New American Century\" lately..."}
{"text":"Reddit is being paid to control \/r\/politics?"}
{"text":"Alex Jones Explains Why He's So Obnoxious"}
{"text":"More Proof Idiocracy is a Becoming Our Reality"}
{"text":"I don't know if this is part of a conspiracy or just incompetence, but why shut down media on literally the same day a new investigation into an assassination on your soil is announced?"}
{"text":"Live Streaming the Moon, chat about conspiracies, etc"}
{"text":"US government has given 1.4 million guns to Iraq and Afghanistan"}
{"text":"Settlers flood Palestinians' agricultural lands with sewage"}
{"text":"Clinton tweet results in someone becoming $56,000 richer: possible insider trading [x post \/r\/wallstreetbets]"}
{"text":"Four More Mega-Banks Join The Anti-Dollar Alliance"}
{"text":"Kaine's wife is a Pence!"}
{"text":"The Logic of Murder in Israel: A Culture of Impunity in Full View of the Entire World"}
{"text":"Assange says WikiLeaks to release 'significant' Clinton campaign data"}
{"text":"\"Republicans, Democrats, Communists. They all look alike to me.\""}
{"text":"Airlander 10 crashing into the ground shed airship"}
{"text":"CIA releases thousands of previously classified briefings to Presidents Nixon and Ford"}
{"text":"Neo-Nazi murder cases suggest a coverup by German police"}
{"text":"How Many Of Your Facebook Friends Are Undercover FBI Agents?"}
{"text":"Terrorist linked propaganda group, fronting as rescue teams, nominated for Nobel Peace Prize."}
{"text":"If Voting Made Any Difference, They Wouldn’t Let Us Do It"}
{"text":"A Disturbing Series of Events: Governments Around the World Seem to Be Preparing for War"}
{"text":"Benjamin Netanyahu EXPOSED"}
{"text":"Deep-state sheep-dipped \"deceased\" FBI agent found by Secret Service at Trump Tower with a Glock that was never stamped and silencer. Add'l source: http:\/\/phibetaiota.net\/2016\/08\/faded-rose-secret-service-stops-trump-assassination-hillary-kills-again\/"}
{"text":"Venezuela Bans Lines Outside of Bakeries that Spread \"Anxiety\""}
{"text":"There is a global water shortage because camels are keeping it all in their backs. They store water in their backs in an attempt to control the world's water supply."}
{"text":"What fields of science or any academic study do you think are most likely corrupted by political and corporate interests?"}
{"text":"Assange: WikiLeaks to release 'significant' Clinton material"}
{"text":"Cyber-Seniors Trailer, documentary that follows a group of seniors as they discover the wonders of the world-wide-web with the help of their teenage mentors."}
{"text":"Time to arrest and prosecute Hillary Clinton for deep corruption... Clinton Foundation a bribery and racketeering scheme of astonishing scale"}
{"text":"2013 Aussie QandA show makes David Suzuki look like a clueless dolt with a CO2 cult hate - claims UAH has a denialist mole manipulating the figures"}
{"text":"What will happen to CTR after the election"}
{"text":"OCCULTOCRACY - How Black Magic Rules the World"}
{"text":"I need some help with finding a 9\/11 video to convince a friend."}
{"text":"US Army Axes Training Materials That Name Petraeus, Clinton as Security Risks"}
{"text":"We Have to Talk About the Boy in the Ambulance..."}
{"text":"Washington threatens Brussels over plan to demand billions in unpaid taxes from Apple"}
{"text":"Leaked memo shows how George Soros planned to overthrow Vladimir Putin and destabilise Russia"}
{"text":"China's Forgotten Emperor (2016) - A look on Wu Zetian, one of China's most controversial ruler and the only female Empress in China history [46:53]"}
{"text":"How vaccine toxins in conjunction with a lack of healthy gut flora increase the risk for autism"}
{"text":"​The Jesus Singularity"}
{"text":"Earliest Intelligent Life In The Universe?"}
{"text":"Are We The Earliest Intelligent Life In The Universe?"}
{"text":"NEXRAD Radar Anomalies: JFK Airport Terminal Radar vs. Ft. Dix"}
{"text":"Bush &amp; Cheney Asked Sen. Tom Daschle Not To Investigate 9\/11"}
{"text":"Breaking: Explosion in DC home kills DNC staffer"}
{"text":"Most Welfare Dollars Don’t Go Directly To Poor People Anymore"}
{"text":"A Clinton Family Value: ‘Humanitarian’ War - The transformation of the Democratic Party from the relative “peace party” to a belligerent “war party” occurred during Bill Clinton’s presidency and is likely to resume if Hillary Clinton is elected"}
{"text":"After the burkini ban, people are asking if France can outlaw fat men in Speedos too"}
{"text":"BPD remains tight lipped about helicopter exercise with defense department"}
{"text":"Assange: New Hillary Info Could Swing Election “If it Catches Fire”"}
{"text":"Welcome to the Trump-Clinton conspiracy election"}
{"text":"Leaked Soros Strategy: ‘Globalization’ Will ‘Increase Migration Pressures’"}
{"text":"Zika Is Just the First Front in the 21st-Century Biowar"}
{"text":"Clinton on Foundation Accusations: \"I Know There's A Lot Of Smoke And There Is No Fire\" | Video | RealClearPolitics"}
{"text":"Exclusive interview with Sheyann Webb: Martin Luther King Jr.’s Smallest Freedom Fighter and participant of 'Bloody Sunday'"}
{"text":"The duality has always been a lie. Clinton, Trump, they're working for the same people. Trump was never meant to fix the schism of the republican party, but to solidify and discredit the remnants."}
{"text":"H.A. Goodman AMA critical of Clinton gets heavily brigaded in comments and voting by CTR trolls"}
{"text":"All the Ways Your Wi-Fi Router Can Spy on You"}
{"text":"The True Story and the Hidden Symbolism Behind \"Stranger Things\" - The Vigilant Citizen"}
{"text":"Police Call In FBI To Stop Native Americans From Protesting Dakota Access Pipeline"}
{"text":"CLINTON ARRESTED"}
{"text":"At War For Control of the Stargates – U.S. Backs Invasion of Syria - Project Camelot Portal"}
{"text":"Canadian Government Drastically Increases Spying On Its Citizens"}
{"text":"Clinton Arrested"}
{"text":"A Visit to Ancient Extraterrestrial Outposts on Venus &amp; in Saturn Orbit - Exopolitics"}
{"text":"Why did the Saudi regime and other Gulf tyrannies donate millions to the Clinton Foundation?"}
{"text":"Is Hillary Clinton avoiding press conferences because she's afraid she might have another seizure\/convulsions during one?"}
{"text":"The Hypocrisy Of The West's Relationship With Saudi Arabia"}
{"text":"Dominican Police Raid Three Clinics as Investigation into Organ Harvesting Conspiracy Deepens"}
{"text":"Does anyone know how to vote for Gary Johnson in the polls that will determine if he is eligable for the debates?"}
{"text":"Saudi-led coalition airstrikes #1 cause of civilian deaths in Yemen – UN body"}
{"text":"$400 billion dollars later, Lockheed'\u0080s F-35 still falls short, Pentagon tester says: plane doesn't even have a working gun."}
{"text":"\"According to Kremlin insiders, President Putin has named September 11th 2016 as the date he plans to release the satellite footage proving conclusively the US government’s darkest secret: that the 9\/11 attacks were a false flag terrorist event committed against their own citizens.\""}
{"text":"WikiLeaks' Assange Warns Clinton Campaign: More Game-Changing Emails Loom | Zero Hedge"}
{"text":"Clinton Foundation Investigation Update: Key Details About Financial And Political Dealings"}
{"text":"Top Clinton Campaign Lawyer Marc Elias is Head of George Soros Initiative to Expand Voters by \"10 million\" by 2018. Elias Has Worked With at LEAST One Organization That Has Committed Voter Fraud."}
{"text":"ELI5:what if Hillary wins the general election then gets indicted?"}
{"text":"Years ago Russia researched the biological effects of microwave ovens, then banned them - Prepare for Change"}
{"text":"Shots fired near Passmore Lane; businesses locked down"}
{"text":"Paul McCartney’s Death in 1966 Goes Much Deeper Than an MI5 Replacement Operation - BeforeItsNews"}
{"text":"Rockefeller, Ford and the Secret History of Alcohol"}
{"text":"Joe Biden Admits Breeding Out The White Race Through Immigration Is The End Game \"The source of our power\""}
{"text":"Rolling Stone: Why You Shouldn't Vote for Libertarian Nominee Gary Johnson - (Every reason they give is exactly why you SHOULD vote for him)"}
{"text":"Whoopsie: Russian hackers post same document twice, but with glaring differences"}
{"text":"Sirens Wail As Russia Awakens To Full Combat Alert, NATO Alliance Begins To Shatter - WhatDoesItMean"}
{"text":"I made a neat Facebook cover photo if anyone wants to use it. Dimensions are correct for FB cover photos."}
{"text":"How The Media Is Covering Up The Truth About Hillary's Health"}
{"text":"The Mandela Effect-Conspiracy Corner"}
{"text":"One of Donald Trump's Virginia campaign managers called Islam a \"barbaric cult\" in Facebook post"}
{"text":"Why Amazon and the CIA want algorithms to understand satellite photos"}
{"text":"Forget CO2 Warming, Plasma Heating in the Atmosphere is the Real Global ..."}
{"text":"Anton Yelchin\/Odd Thomas Prophesized death?"}
{"text":"On this day in 1835 the 'Great Moon Hoax' was published"}
{"text":"Video of Cory Booker (D-NJ) dancing with Shmuley Boteach on his back in a clown suit - Zionist Power"}
{"text":"Video of Cory Booker (D-NJ) dancing with Shmuley Boteach on his back in a clown suit - Shmuley Boteach is the uncle of international arms dealer Efraim Diveroli of the Jonah Hill movie War Dogs."}
{"text":"Garbage Truck escort on the 5 freeway in Los Angeles, CA"}
{"text":"Israel armed Argentina to deadly effect during Falklands War"}
{"text":"Is Something Big About to Happen? Czech Gov. Tells People to 'Prepare fo..."}
{"text":"Neil Keenan Update - Keenan And Group K To The Rescue"}
{"text":"So Am I Paranoid If...."}
{"text":"HAARP's new owner holds open house to prove facility 'is not capable of mind control'"}
{"text":"Weapons, Pipelines &amp; Wall St: Did Clinton Foundation Donations Impact Clinton State Dept. Decisions?"}
{"text":"\"Our Revolution\"? Bernie Sanders Launches New Organization, But Key Staffers Quit in Protest"}
{"text":"So I finally watched A Rich Mansion Trick."}
{"text":"Not Like It's New's - But WikiLeaks Confirmed Hillary's Parkinsons."}
{"text":"WikiLeaks Provides Further Proof of Hillary's Parkinsons."}
{"text":"Why does Bibi rejoice as Obama administration nears an end? Oh look! Why is the Texas Land Commissioner visiting Netanyahu in Israel?"}
{"text":"Question - Wikileaks motivations"}
{"text":"Yes, There Is “Absolutely” More Info About To Be Released On Hillary"}
{"text":"Private Disaster Relief in Louisiana Outperforms the Government — Lives and Property Saved"}
{"text":"ZigBee Radio Transmitter: How Many Do You Have?"}
{"text":"Why do most conspiracy submissions have a decidedly right wing\/conservative slant? (With the exception of 9\/11 stories.) Do Republicans\/Conservatives do nothing in the shadows to manipulate the general populous?"}
{"text":"Flashback: Obama and Hillary Blame YouTube Video for Benghazi Terrorist Attack"}
{"text":"U.S. CALLS ON AMERICANS TO LEAVE GAZA ‘AS SOON AS POSSIBLE’"}
{"text":"VIDEO: Julian Assange Reveals When He Will Destroy Hillary Clinton"}
{"text":"CERN: Has An Interdimensional Portal Been Opened?"}
{"text":"Julian Assange: Hacked Emails Include Info On Hillary Arming Jihadists, Including ISIS"}
{"text":"Assange Assassination Attempt? Cops Took 2 Hours to Respond to Embassy Breach"}
{"text":"Is Hillary Clinton a Reptilian?"}
{"text":"Did Turkish President Erdogan Just Use a False Flag to Justify Invading Syria?"}
{"text":"Body shaming agenda."}
{"text":"Announcing the National Voter Unregistration Drive 2016!"}
{"text":"Just so you know what is really happening in the world."}
{"text":"\"The Clinton Foundation contributed to the February coup in Ukraine, having longstanding ties to Ukrainian oligarchs who pushed the country to European integration.\""}
{"text":"Are there any easy to read books on propaganda that shows and gives examples on different types of manipulation?"}
{"text":"Reality check: Is Donald Trump a Russian Spy?"}
{"text":"Boiling Frogs Post: Legal Reality Check - Anatomy of a Conspiracy"}
{"text":"The CIA and Amazon training artificial intelligence to spy on Earth from SPACE using ‘computer vision’ | FYI reddit is also working with them. Does anyone know why?"}
{"text":"Alien on Mars?"}
{"text":"The Trump is a Xenophobe Myth Debunked"}
{"text":"CNN Yesterday: Hillary Health Concerns 'Sexist'; CNN Today: Questions Trump's Health"}
{"text":"10-cosas-que-le-pasarn-a-tu-cuerpo-cuando-mueras-y-debes-saberlas"}
{"text":"Pentagon Admits Recent US Airstrikes \"May\" Have Killed Civilians"}
{"text":"Larry King caught on open mic to Bill Clinton: Ted Turner “would serve you” -- CNN and Clintons then lived happily ever after..."}
{"text":"Hillary quotes on Illegal Immigration pre-2015"}
{"text":"US election: Trump calls Hillary Clinton a 'bigot' - BBC News"}
{"text":"Wikileaks Drops Hillary Email Bomb That Could End Her Campaign but FB Censored It"}
{"text":"International Space Station Hoax | Does Gravity Exist?"}
{"text":"US fires warning shots at Iranian vessel after close encounter"}
{"text":"Former \"Degrassi High\" actor Jason Byrd Dickens charged along with 3 women: making child pornography, bestiality, sexual assault. Dickens played Scott Smith, abusive boyfriend of Kathleen Mead."}
{"text":"Why Our Educational System Sucks"}
{"text":"9\/11 Families Start New Project Asking You To Make A Video Calling For The Passage Of JASTA - Justice Against Sponsors of Terrorism Act"}
{"text":"Jill Stein Censored on PBS NewsHour"}
{"text":"Gray State - Official Concept Trailer 2012"}
{"text":"Hillary Clinton Attacks Alex Jones in major speech"}
{"text":"The Money Masters (1996)- the history behind the current world depression and the bankers' goal of world economic control by a very small coterie of private bankers, above all governments [x-post from r\/documentaries!]"}
{"text":"World’s first self-driving taxis roll out in Singapore with millions of jobs under threat"}
{"text":"Most Millennials Have Less Than $1,000 In Savings, Live Paycheck-to-Paycheck"}
{"text":"Did Turkish President Erdogan Just Use A False Flag To Justify Invading Syria?"}
{"text":"How does Stephen Hawking live past 70 with ALSO ?"}
{"text":"Reddit is Dying Out"}
{"text":"How does Stephen Hawking live past 70 with ALS? The average person only lives 3 years after diagnosis. He's had it for over 30!"}
{"text":"\"Fuck Bin Laden\" song by the lonelyisland has a cryptic message right at the end: the Abbottabad raid which supposedly took out Osama was fake."}
{"text":"How We Know ISIS was ‘MADE IN THE USA – Stone Cold Truth"}
{"text":"Yesterday I predicted Joe Biden will make his way more and more into the political spotlight so it will be easier for him to be placed on the Dem ticket after Hillary is removed. Less than 24 hours later, here is Biden giving his opinions on Guantanamo Bay that were requested by absolutely no one"}
{"text":"Hillary Clinton Says ‘Radical Fringe’ Is Taking Over G.O.P. Under Donald Trump"}
{"text":"Psychedelics And Consciousness - A short video about Psychedelics and why they have become illegal in almost all countries around the world."}
{"text":"Olympians talking about god"}
{"text":"I found an attorney who is considering my proposed case against Correct the Record under cyberbullying and online harassment laws that exist in my state. This article explains some of these laws. Win or lose, it will cost them. Check your laws and consider doing the same."}
{"text":"Jeff Morley lawsuit against CIA \/ JFK assassination files Night Fright Show"}
{"text":"Psychopaths: Non-Humans Who Control the World"}
{"text":"I think Facebook is doing some kind of censorship related to stories about hijabs...please read"}
{"text":"Yesterday I predicted Joe Biden will make his way more and more into the political spotlight in the weeks to come so it'll be easier for him being placed on the ticket after Hillary is removed. Less than 24 hours later, he's now in Sweden giving his opinion on Guantanamo Bay during a news conference"}
{"text":"Louis Theroux: Find out what Israel is really like"}
{"text":"'Jews did 9\/11' written on softball field"}
{"text":"HLN drops Dr Drew after he reported concerns about Clinton's health."}
{"text":"A Google Advanced search for \"pedophile site:reddit.com\" returns zero hits. Zero."}
{"text":"Hillary Clinton: \"Alex Jones Who Claims 9\/11 And Oklahoma City Bombing Were Inside Jobs!\" And Sandy Hook!"}
{"text":"Donald Trump Is Not On The Ballot In Minnesota"}
{"text":"A Picture is Worth 1000 Words. \"Just Send Your Cash\""}
{"text":"Saw this on chan"}
{"text":"ALEX JONES GOES OFF ON JEWS! (Before Completely Selling Out)"}
{"text":"Who is the best superhero, as a personification, that embodies optimal characteristics for a citizen?"}
{"text":"Is there Luciferian symbolism in the 2016 election"}
{"text":"Report details workers’ rights violations at Apple’s iPhone 7 supplier Pegatron"}
{"text":"Blow Your Whistle"}
{"text":"Defamation documentary - Official Trailer, full video link in description"}
{"text":"Hillary Clinton Attacks Alex Jones On 9\/11 Truth, Sandy Hook Conspiracy, Oklahoma Bombing"}
{"text":"\"Robert C Byrd led by the power of his example &amp; made all of us who had the honor of serving as his colleagues, better public servants and better citizens.\" New York Senator Hillary Rodham Clinton commemorates former KKK Exalted Cyclops in June 2012"}
{"text":"Legal Marijuana Is Inevitable"}
{"text":"\"Robert C Byrd led by the power of his example &amp; made all of us who had the honor of serving as his colleagues better public servants and better citizens.\" New York Senator Hillary Rodham Clinton commemorates former KKK Exalted Cyclops in June 2010"}
{"text":"Government Hackers Caught Using Unprecedented iPhone Spy Tool"}
{"text":"Apple patenting a way to collect iPhone thieves' fingerprints"}
{"text":"Leslie Jones Hack Under Homeland Security Investigation"}
{"text":"'Assassination attempt' on Angela Merkel"}
{"text":"Illuminati dinner reservation leaked"}
{"text":"Hillary goes full-conspiracy theorist!"}
{"text":"Clinical foundation !"}
{"text":"Dr. Drew Show CANCELED After Admitting Hillary Health Problems !!!"}
{"text":"\"The Day Israel Attacked America\" documentary"}
{"text":"WW3 USA BY OBAMA CLINTON TO BE MADE ISLAMIC STATE UR WARNED WATCH CAREFULLY - YouTube"}
{"text":"The Target boycott is costing more than anyone expected as Target head towards destruction."}
{"text":"JFK playlist the ULTIMATE COLLECTION of videos; everything about Preside..."}
{"text":"What Can We Say About a System that Criminalizes a Safe Painkiller (0 Deaths) and Promotes Big Pharma Opiates that Have Killed 165,000 Americans?"}
{"text":"Israeli Startup Manipulated iPhone to Allow Government Spying, Report Says"}
{"text":"Globalism Is A Barbaric Relic - Voluntary Tribalism Is The Future"}
{"text":"Spin - 1995 Documentary composed of satellite footage of 1992 Presidential Candidates. Behind the scenes glimpse, well worth your time."}
{"text":"Satan is the allegorical savior: a blog on the New World Order"}
{"text":"VP Joe Biden admitting that White Genocide is the goal for the coming future."}
{"text":"ELI5 Nassim Haramein's Theory(ies)"}
{"text":"The USS Liberty Attack In A Nutshell"}
{"text":"HLN drops ‘Dr. Drew’ after he questions Hillary's health"}
{"text":"Off-duty LAPD cop arrested for alleged lewd conduct"}
{"text":"Proof of rampant bot use on reddit"}
{"text":"I have never seen this one. It is a good one for the Nuclear 911 crowd."}
{"text":"Paranoid Hillary Smears Alex Jones During Conspiracy-Obsessed Rant"}
{"text":"Alex Jones Caught by Surprise Hillary Attack"}
{"text":"Sirens Sound In Moscow - Russia On Full alert"}
{"text":"Veteran Kills Himself in VA Parking Lot After Being Denied Treatment"}
{"text":"CTR FEC Summary shows incoming donations and outgoing payments of anti-democracy shill outfit"}
{"text":"Can anyone concisely explain why Israel, a wealthy nation and a false \"ally\" deserves any aid whatsoever?"}
{"text":"A Global Map Of Human Trafficking Incidents And News"}
{"text":"Apple boosts iPhone security after Mideast spyware discovery"}
{"text":"WhatsApp privacy backlash: Facebook angers users by harvesting their data"}
{"text":"Source: Saudi Arabia Launches Chemical Attack on Sana'a, Killing Civilians"}
{"text":"'Assassination attempt' on Merkel"}
{"text":"People like Alex Jones, Mark Dice, and Paul Joseph Watson don't talk about 9\/11 Truth anymore."}
{"text":"Thought: Is the moon producing our gravity?"}
{"text":"A. Swartz would have been so disappointed with what is now front page reddit"}
{"text":"Facebook goes full Orwellian... now blocking all stories mentioning the keyword phrase 'm-nd-t-ry v-cc-n-t--ns'"}
{"text":"Don't Panic: The Truth About Population (2013)"}
{"text":"Police Officer Arrested By FBI For Smoking Crack On Duty"}
{"text":"How Can Hillary Be the Evil Mastermind When She Can Barely Stand?"}
{"text":"Debtors Prisons Trapping Americans In a Spiral of Debt Slavery"}
{"text":"Hillary Clinton mentions Alex Jones by name and smears anyone who believes there were crisis actors in Sandy Hook and that the Oklahoma bombing was an inside job"}
{"text":"Most Millennials Have Less Than $1,000 In Savings, Live Paycheck-to-Paycheck"}
{"text":"Sirens Blare In Moscow - Russia On Full Alert - Dr William Mount"}
{"text":"Hillary Clinton Triggered By Alex Jones and Infowars"}
{"text":"[Light theory] Netflix created crackle and Telecine created Megapix?"}
{"text":"Why Don't you Believe in the Madela Effect?"}
{"text":"Native Americans Had Their Conspiracy Theories Too ..."}
{"text":"What do you make of this?"}
{"text":"What Really Happened Show: Michael Rivero Thursday 8\/25\/16: (Commercial Free Video)"}
{"text":"Americans should be more interested in the Vice President than the President"}
{"text":"FBI Admits Clinton Used Software Designed To “Prevent Recovery” And “Hide Traces Of” Deleted Emails | Zero Hedge"}
{"text":"Leaked Memo Exposes George Soros' Plan To Overthrow Putin &amp; Destabilise Russia | Zero Hedge"}
{"text":"The Frankfurt School"}
{"text":"Dr. Drew Show CANCELED After Admitting Hillary Health Problems"}
{"text":"Why Hillary Rotten Clinton mentioned 9\/11 and OKC in her onstage production today--and why the \"Queen of Chaos\" must be stopped"}
{"text":"Is the \"Alt Right\" a Conspiracy To Take Over the Trump Campaign?"}
{"text":"The Broken Chessboard: Brzezinski Gives Up on Empire...\"the United States is still the world’s politically, economically, and militarily most powerful entity but, given complex geopolitical shifts in regional balances, it is no longer the globally imperial power.”"}
{"text":"\"Outside of popular culture, there are no highly skilled hit men for hire. If it’s a skilled job, that means it’s a state asset.”"}
{"text":"Flat Earth"}
{"text":"The Bizarre Media Blackout Of Hacked George Soros Documents - Russian Insider"}
{"text":"The Rothschilds and the Federal Reserve"}
{"text":"How We Know ISIS Was ‘Made in the USA' - Russian Insider"}
{"text":"Exposure to 9\/11 disaster tied to low birthweight, preterm delivery"}
{"text":"1\/3 OF ABEDIN EMAILS 100% REDACTED"}
{"text":"COINTELPRO (Then and now)"}
{"text":"Fritz Springmeier: The Role of The Illuminati's Occult Philosophy in 9\/11"}
{"text":"Jill Stein Censored on PBS NewsHour"}
{"text":"[PSA] Miles Mathis = Certified Crackpot™"}
{"text":"BREXIT Pioneer Destroys Hillary Clinton"}
{"text":"Why is the media selling out the police?"}
{"text":"Apple zero-days mark a new era of mobile hacking"}
{"text":"4chaner shouts out \"pepe\" during Clinton's Alt Right Speech"}
{"text":"Dr Drew will be the next one to die by them"}
{"text":"Why do SO MANY US politicians have dual Israeli\/US citizenship?"}
{"text":"Does it seem like the media ignores DMT?"}
{"text":"Why do so many US politicians have dual US\/Israeli citizenship? At least 13\/100 Senators, at least 27\/435 House Reps, and many of The Presidents's cabinet. And that's just the democrats!"}
{"text":"Putin on Obama's failed promises"}
{"text":"Why do so many US politicians have dual US\/Israeli citizenship? At least 13\/100 Senators, at least 27\/435 House Reps, and many of The Presidents's cabinet."}
{"text":"EMERGENCY- Hillary Likens 'Alt-Right' to the Third-Reich"}
{"text":"Mylan lobbied to make EpiPen mandatory in US schools — then moved overseas to avoid taxes"}
{"text":"Putin destroys the 'Panama Papers' scandal"}
{"text":"Bow before your true leader!"}
{"text":"So apparently believing in \"Lizard People\" means your incompetent"}
{"text":"Alex Jones Responds To Hillary Clinton's Attack"}
{"text":"Jill Stein Censored on PBS NewsHour"}
{"text":"Theory: James Gandolfini killed because he knew about flat earth. Or he knew something about Antarctica."}
{"text":"Soros is Clinton's biggest financial backer – email leak that goes under..."}
{"text":"Hillary's health is her escape. If she is indicted, it'll be a way for her to escape justice and a reason to drop out of the presidential race. If she isn't, she'll live long and miserable as a president."}
{"text":"\"Democracy\""}
{"text":"Guy attempts to discuss the Dallas shooting with two cops. Out of state police as well as plain clothed agents come and disrupt the conversation - (Very Bizarre interaction) x post from AmIFreeToGo"}
{"text":"CNN Cancels Dr. Drew's Show One Week After He Voiced \"Grave Concern\" For Hillary's Health"}
{"text":"2 Suns and MORE!!!"}
{"text":"This cant be real"}
{"text":"Putin Is Building a Great Russian Firewall"}
{"text":"Turkey And The US Government Ground Invasion Was Planned 2 Years Ago (must watch x22 report)"}
{"text":"Connecting the Dots (FULL) - How the Financial World Will Collapse (1991 Lecture at USC)"}
{"text":"Why don't Black Lives matter to Black People? Chicago's own J Hustle"}
{"text":"Experts Baffled As Microbes Cover Jefferson Monument"}
{"text":"A Timeline of CIA Atrocities"}
{"text":"38% increase in global disasters: natural or covert war?"}
{"text":"ATS is Shill Run"}
{"text":"Salon on Presidential Candidate's medical records"}
{"text":"FALSE: Hillary Clinton Freed Child Rapist, Laughed About It"}
{"text":"What even is this..."}
{"text":"A Noble Lie Oklahoma City 1995 - A Noble Lie peels back what we thought we knew about the bombing and it's perpetrators. This film exposes information never before examined or brought to the attention of the American public."}
{"text":"Dr. Jill Stein On Twitter: .@Wikileaks Shows HRC Identifying Saudi Arabia As A Leading Terrorist Funder While Approving $29B In Arms Exports To Saudis. #HillarysEmails"}
{"text":"The True Size of the Shadow Banking System Revealed"}
{"text":"MasterCard Study Reveals the Rapidly Growing Cashless Economies"}
{"text":"AIPAC - This is what Treason looks like"}
{"text":"#RogerAiles Begs Donald Trump Not To Spill The Beans That Sandy Hook School \"Shooting\" Was A Psychological Operation"}
{"text":"Even Liberal News Outlets are Calling for the Clintons to Close Down the Clinton Foundation. It's No Longer Just a \"Right Wing Conspiracy Theory\"."}
{"text":"Trump Naked Freemason Statue Roast."}
{"text":"Welcome to 1984 - Baltimore police secretly running aerial mass-surveillance"}
{"text":"The Orlando Massacre and the Zionist Propaganda of Alex Jones"}
{"text":"Soros planned to give Planned Parenthood $1.5 million after furor over fetal parts scandal"}
{"text":"How would Zika benefit chemical companies? Let me explain."}
{"text":"Gulf of Tonkin 20.16!!!! Warning shots fired, cnn spins Iranian vessels get within 300 yards but why is our destroyers by Iran."}
{"text":"Gulf of Tonkin 20.16"}
{"text":"Which theory considered to be a \"conspiracy theory\" do you actually believe is true? • \/r\/UnresolvedMysteries"}
{"text":"Which theory considered to be a \"conspiracy theory\" do you actually believe is true? xp \/r\/UnresolvedMysteries"}
{"text":"The Alex Jones Reference From Hillary is Actually A Big Deal"}
{"text":"You infosec guys will enjoy this, it's like being back in the Attacks and Detection lab. x-posted from r\/The_Donald"}
{"text":"Are video games for A.I. to learn our tactics if shit hits the fan?"}
{"text":"The \"Mandela Effect\" Is A Psyop"}
{"text":"YOU WANT TO KNOW THE TRUTH OF 9\/11? READ THIS!"}
{"text":"Obamanation"}
{"text":"Found this dollar at my work. Lots of fun stuff."}
{"text":"Is this election actually a civil war in the information age? Chances that it will turn into an armed conflict when Hillary commits election fraud?"}
{"text":"DJ Shadow feat. Run The Jewels - Nobody Speak (Official Video)"}
{"text":"The FIRST result when Googling \"the kkk\""}
{"text":"China Prepares to Take Over the World?"}
{"text":"Indian man carries dead wife's body for 12km - BBC News"}
{"text":"Meet the living Rothschilds family members. These 6 people have large control of major western nations' central banks."}
{"text":"Alex Jones on the Pickle Jar Conspiracy."}
{"text":"Rothschild Political Cartoon"}
{"text":"CIA Inspector General Report on MKULTRA 1963"}
{"text":"Pentagon Has No Clue Where Hundreds of Thousands of Weapons Went"}
{"text":"Looking forward to the election being over"}
{"text":"1950s Operation Big Buzz and possible Zika connection?"}
{"text":"A Disturbing Series Of Events: Governments Around The World Seem To Be Preparing For Something"}
{"text":"How to break free from the system - Last American Vagabond Podcast"}
{"text":"[x-post \/r\/C_S_T] With all these \"false flags\", isn't it just easier to actually just send in a guy and kill people?"}
{"text":"You want to know the truth about 9\/11? CLICK HERE!"}
{"text":"US justifying war with Iran?"}
{"text":"Globalists take advantage of paralyzed man"}
{"text":"1\/3 of Abedin emails 100% redacted"}
{"text":"Project Bluebeam - Hologram sky - This is some weirdness"}
{"text":"AI Will Demolish jobs and make W&amp;B Collar workers irrelevant...What are Bilderberg planning 2016"}
{"text":"French naval contractor DCNS files complaint following data leak"}
{"text":"Assange Assassination Attempt? Cops Took 2 Hours to Respond - TheAntiMedia"}
{"text":"Staedtler supports Hitler? Or...."}
{"text":"Apparently people trust Trump more with America's Nuclear Weapons than Hilary."}
{"text":"Calling All Conspiracy Theorists: Alaska's \"Mind-Control Lab\" Is Hosting an Open House"}
{"text":"Wikileaks: George Soros Paid $650,000 to Influence Pope Francis’ Closest Friend"}
{"text":"Can anyone substantiate John Todd's claims"}
{"text":"Urgent message from Simon... False flag attack feared from US on Germany and Czechoslovakia!"}
{"text":"Vaxxed. The government owns your baby. You do not."}
{"text":"Murder suspect found biting off victim's face, Florida deputies say"}
{"text":"Guy claims Jewish Mafia out to kill him. Is he crazy or right?"}
{"text":"China Joins Russia in Syria War? “Enhanced Military Aid” against US Sponsored Terrorists?"}
{"text":"Million Pounds of Rat Meat Being Sold As Boneless Chicken Wings in U.S"}
{"text":"Has there been any good compilation of evidence which argues that Trump is trying to intentionally throw the election?"}
{"text":"U.S. Military Now Says ISIS Leader Was Held in Notorious Abu Ghraib Prison"}
{"text":"Martin Armstrong: \"They Will Rig The Game... They Can't Afford A Trump Victory\" | Zero Hedge"}
{"text":"\"To destroy the opposition you must lead the opposition\" V. Lenin AltRightCringe"}
{"text":"Aliens are real and here already - according to some Astronauts, NASA, CIA, FBI, Army, Air Force officials, rocket scientists and physicists"}
{"text":"DWS for Congress?"}
{"text":"worth a watch"}
{"text":"Big Pharma's dirty secret: EpiPen was developed entirely with taxpayer money"}
{"text":"PAID OFF: Clinton Foundation deposits 375K into Khan family's account"}
{"text":"Nullify Tyranny from the Jury Box: \"Unfortunately, the average juror in the US today is likely unaware that they have the right to acquit a defendant, no matter the facts in a case, but rather based on the legitimacy of the law, the appropriateness of the punishment, or simply on their conscience.\""}
{"text":"Hillary Claims She “Kept Americans Safe” As Secretary, Was “Not Influenced By Any Outside Forces” | Zero Hedge"}
{"text":"Look Up Banff"}
{"text":"EpiPen Price Gouge Tied to Clinton Foundation #NewWorldNextWeek"}
{"text":"\"Soros is Clinton's biggest financial backer – email leak that goes underreported\" on YouTube"}
{"text":"Pope Expected To Make ET Disclosure At September Conference | Your News Wire"}
{"text":"Islamic State Leader Al-Baghdadi Was Held At Infamous Abu Ghraib Prison"}
{"text":"Must listen: Leo Zagami, Illuminato\/NWO whistleblower, on The Higherside Chats"}
{"text":"UBS whistleblower exposes 'political prostitution' all the way up to President Obama"}
{"text":"UFO Quotes: Astronauts, NASA, CIA, FBI, Army, Air Force officials, rocket scientists and physicists speak out"}
{"text":"CEO who gouged EpiPen price is daughter of Democratic senator | New York Post"}
{"text":"76-Year-Old Veteran Kills Himself In VA Parking Lot After Being Denied Treatment"}
{"text":"\"Things Are Worse\" - Dollar Stores' Startling Admission: Half Of US Consumers Are In Dire Straits"}
{"text":"Clinton cranks up Trump-Russia rhetoric as Election Day draws closer"}
{"text":"Big Surprise: Company that price gouged EpiPen is Clinton Foundation donor"}
{"text":"Leaked Documents Reveal Israel Armed Argentina During Falklands War | Your News Wire"}
{"text":"McDonalds In Crisis As French Fries Dangerous Ingredients Revealed | Your News Wire"}
{"text":"What are these towers on my local power downgrader?"}
{"text":"Hillary Clinton declares war on Infowars. Alex Jones fires back with devastating Hillary video"}
{"text":"Bolivia minister killed by protesting miners"}
{"text":"One Wierd Airport"}
{"text":"Julian Assange Interview on Fox and Friends"}
{"text":"Depopulation: Global elite, climate change activists call for tax on newborns - NaturalNews.com"}
{"text":"Where Clinton And Trump Stand On Cybersecurity And Privacy"}
{"text":"The future of gaming: Indistinguishable AI"}
{"text":"Israel sold weapons to Argentina at height of Falklands War, declassified files show"}
{"text":"The ethics of transhumanism"}
{"text":"The Day Before 9-11 George Carlin Recorded a Comedy Special, It Never Aired — Until Now"}
{"text":"Julian Assange interview on Fox and Friends"}
{"text":"2016 U.S. ELECTION NOT AS FREE AS ADVERTISED?"}
{"text":"Prediction: No presidential debate will be held this year because third-parties are too strong and would likely get a place on stage."}
{"text":"50% to 60% of college students have a psychiatric disorder"}
{"text":"Apple upgrades security after alleged Israeli group’s spyware attack on Arab activist"}
{"text":"Leaked Emails Show HUGE Saudi Arabia Donations, Hillary’s “Easy Money”"}
{"text":"I don't think it matters who actually was responsible for 9\/11 because the outcome would have been the same."}
{"text":"Millions From Maxed-Out Clinton Donors Flowed Through Loophole"}
{"text":"Sandra Fecht \"Therapists Hear Stories Of Satanic Abuse Regularly But Stay Quiet For Their Careers!\""}
{"text":"Is there more to this EpiPen controversy?"}
{"text":"Mom Sues CIA &amp; FBI for Info on Son's Death"}
{"text":"Is the 2016 U.S. Presidential Election as free as advertised?"}
{"text":"WikiLeaks' #Saudi Cables reveal the Kingdom's foreign media manipulation strategies, News Media organizations and institutions are in the pocket of Saudi Arabia - New York Times, CNN, MSNBC, Daily Beast etc all involved 🔥🔥🔥"}
{"text":"Vijay Prashad: Turkey's Offensive Against ISIS &amp; Press Crackdown is Really Just War on Kurds"}
{"text":"EXCLUSIVE: Witness Reveals Who's to Blame for 2013 Ghouta Gas Attack in Syria"}
{"text":"Regime Change in Libya Mirrors Iraq: Both Efforts Led to Failed States &amp; Destabilized Region"}
{"text":"Vijay Prashad: Hillary Clinton Shows Dangerous Tendency to Go to War No Matter the Consequences"}
{"text":"How The Military Could Turn Your Mind Into The Next Battlefield"}
{"text":"‘PsyOps to build case against Assad’"}
{"text":"Imperium the movie is a great story about how FBI keeps pressure on groups to commit horrible acts on Americans. Sometimes goods even being provided for certain groups to continue with there operations."}
{"text":"Alinsky's daughter: Here's the truth about Hillary the media won't tell you"}
{"text":"The US has blurred the lines on assassination for decades"}
{"text":"The Rise of the Mandela Effect – Are YOU Noticing It?"}
{"text":"Trust Mike Wallace &amp; 60 Minutes? Watch \"The 60 Minutes Deception\" RE: Vince Foster investigation &amp; how MSM presents forensic evidence or lack thereof. Murder was the case..."}
{"text":"Every critical thinker is now a Conspiracy Theorist"}
{"text":"RESPONSE VIDEO links below for music"}
{"text":"John Lang - Guarantee Carpet and Fresno Hitman?"}
{"text":"EU: It’s Now Illegal to Say Drinking Water Prevents Dehydration"}
{"text":"Is the Stage Being Set for a Major Terror Attack? (Videos)"}
{"text":"Snowden Docs Support Claim NSA Cyberweapons Stolen, Report Says"}
{"text":"Dulce Base: Thomas Castello and Dulce War"}
{"text":"Top Russian Ministries Flee To Bunkers As “Hillary Clinton War” Warned May Be Unstoppable"}
{"text":"Why would the media annually attempt to cause hysteria about diseases like Ebola, Bird Flu, Swine Flu, and the Zika Virus?"}
{"text":"Big story burried: NYTimes outsourced all its email to Google which is part of the NSA's PRISM intercept system"}
{"text":"World’s biggest pension fund hit by $52bn loss"}
{"text":"Finland's basic income plans to give out cash to create jobs"}
{"text":"The earthquake in Italy left a spoon shaped deformation"}
{"text":"It's exactly one year since the live TV shooting in Virginia of a reporter and cameraman many think was a hoax to support gun control"}
{"text":"FBI’s stingray quickly found suspect after local cops’ device couldn’t"}
{"text":"CIA using Pokemon Go for mass surveillance"}
{"text":"Vice Chairman Of South Korea Conglomerate Lotte Hangs Himself Hours Before Criminal Probe"}
{"text":"An alarming number of scientific papers contain Excel errors"}
{"text":"Voter Fraud Proved: How Will Democrats Explain This Now? - Freedom Outpost"}
{"text":"Mystery of the Bermuda Triangle solved!"}
{"text":"North Korea claims it’s now able to nuke the US mainland"}
{"text":"Reasons Why Major Global Banks Are Developing Their Own Cryptocurrency"}
{"text":"Iranian ships intercept U.S. destroyer: report"}
{"text":"A simulation of a human interviewing an ultra evolved alien"}
{"text":"Southern California Centric Conspiracy Theories?"}
{"text":"How to beat Stingray, NSA, FBI and Police surveillance"}
{"text":"The Cynical Use of Emotion to Sell an Horrific Agenda"}
{"text":"The Peer-To-Peer Economy Is Taking Shape And Blockchain Technologies Are Poised To Set The Foundation For A Decentralized World... Could This Be How We Decentralize Power?"}
{"text":"Israel Would Be Embarrassed if It Were Known It's Selling Arms to ISIS"}
{"text":"Acute Zika virus infection associated with sensory polyneuropathy"}
{"text":"In Zika-Gripped Florida, Concerns Mount Over Insecticide Use—and Efficacy"}
{"text":"Days After Questioning Hillary's Health, Something Shocking Has Happened To Dr. Drew"}
{"text":"Huma Abedin's journal claims Bill Clinton bombed Iraq to distract from affair"}
{"text":"\/r\/The_Donald has gone so nuts that it makes r\/conspiracy seems like mainstream media."}
{"text":"The Movie 2012 and Millioaires"}
{"text":"Monsanto unleashes new GMO crops"}
{"text":"Just a reminder that Trump is currently facing a lawsuit for child rape"}
{"text":"Iraq War Surveillance Technology Being Used In Baltimore Without Public Debate"}
{"text":"Oklahoma Bombing"}
{"text":"Since this sub is so fixated on vile Hillary, here's a reminder that they're both sick: Court papers that show Trump is currently facing a lawsuit for raping and abusing a child."}
{"text":"Paul Watson &amp; Alex Jones Expose Mainstream Media"}
{"text":"Vijay Prashad on India's Crackdown in Kashmir: \"If This is Not an Occupation, What Else is It?\""}
{"text":"WATCH : FBI Admits Clinton Used Software BleachBit To “Prevent Recovery” And Delete"}
{"text":"Questions Raised Over How Insurgents Infiltrate Capital"}
{"text":"Chrome for android redirects a tab to facebook while on desktop mode"}
{"text":"FDA swats down Teva's EpiPen copy, putting Mylan in cruise control"}
{"text":"Who Would Have Guessed? Clinton Connected to EpiPen Price Gouging!"}
{"text":"Israel’s war on open discourse: State censorship now reaches into international news sources and social media"}
{"text":"Donald Trump surges ahead of Hillary Clinton in Los Angeles Times poll"}
{"text":"Aliens are real and here already - according to some Astronauts, NASA, CIA, FBI, Army, Air Force officials, rocket scientists and physicists"}
{"text":"Blockchain – the innovation behind Bitcoin – seems to be completely transforming the way we think about trust (and everything else)"}
{"text":"Hillary Clinton claimed that Donald Trump was embracing “dark conspiracy theories” before going on a conspiracy theory-obsessed rant in which she attacked Alex Jones and claimed that Vladimir Putin was the villainous mastermind behind the ‘Alt-Right’ movement."}
{"text":"Americans are nothing but a bunch of boot licking, ass kissing, house n----s"}
{"text":"Rule 6: No caps lock in titles other than acronyms\/initialisms. - Lots of posts are getting removed due to the use of all-caps in the titles. If you are copy-pasting a title from a website that utilizes e-screaming you will need to manually fix it before posting here or it will be removed."}
{"text":"Pegasus 'Lawful Intercept' Spyware For iOS Used To Target Activists, Journalists"}
{"text":"CNN Fires Dr. Drew for Statements on Hillary's Health, While Vigorously Defending Clinton on Air and in Print. CNN Contributor Says Questioning Her Health Shows \"Sexism\"."}
{"text":"Richard Gutjahr, the independant journalist who filmed both Nice and Munich terrorist attack still missing from social media."}
{"text":"BleachBit stifles investigation of Hillary Clinton"}
{"text":"Pentagon Has No Idea Where Hundreds of Thousands of Guns Went in Iraq and Afghanistan"}
{"text":"Libertarian candidate Gary Johnson wants to force mercury injections on children. Sold out to Big Pharma, claims government \"science\" overrides medical choice"}
{"text":"Organ Harvesting Investigation Widens After More Bodies Discovered"}
{"text":"Congrats USA: Oxford Scientists Declare BOTH Trump &amp;amp; Clinton Likely Psychopathic"}
{"text":"Richard Gutjahr also covered Paris Bataclan attacks"}
{"text":"‘Dr. Drew’ show canceled days after his negative speculation about Hillary Clinton’s health"}
{"text":"Damaging and Irrefutable Proof Trump's Throwing the Election"}
{"text":"America Has No Interest in the Truth: It Doesn't Even Want to Know What Happened on 9\/11"}
{"text":"Psychopaths Aren’t Human"}
{"text":"TRUMP IS NOT YOUR SAVIOUR"}
{"text":"Trump is NOT your savior"}
{"text":"Divide and Conquer: The Agent Provocateur"}
{"text":"Meet the (alleged) aliens of Proxima b"}
{"text":"Stunning Maps Depict Epic Collapse Of Obamacare \"Coverage\" In 2017"}
{"text":"Did we forget about Snowden?"}
{"text":"Break The Matrix"}
{"text":"Hillary Clinton defends Clinton Foundation, Bullshit !"}
{"text":"These two phrases sound nearly similar. Coincidence, or something more?"}
{"text":"Dr. Drew Pinsky speaks out on Hillary’s Health, 1950 era Healthcare &amp; Goldwater Rule (Full Interview) | McIntyre In The Morning | KABC-AM 8\/16\/2016"}
{"text":"Orlando victims get free treatment"}
{"text":"Lots of Smoke Here, Hillary"}
{"text":"Forced out of a home over a marijuana joint"}
{"text":"Forced out of a home over a joint"}
{"text":"WikiLeaks Founder Julian Assange: The “Most Serious” Leaks for Hillary Are Yet to Come"}
{"text":"'I didn't think of Iraqis as humans,' says U.S. soldier who raped 14-year-old girl before killing her and her family"}
{"text":"Proof Hillary Staged Pickle Stunt"}
{"text":"Exposed: Hillary Clinton Rallies are Staged \/ Fake ... Caught On Camera!"}
{"text":"Israeli firm accused of creating iPhone spyware"}
{"text":"USA Today: Close down Clinton Foundation"}
{"text":"Clinton Unhinged Over 'Alt Right' Exposing Her Health Issues"}
{"text":"Syria blames France Intelligence Forces for nerve gas attack in Ghouta that almost took Britain to war"}
{"text":"Prize-winning pot: top marijuana plants debut at Oregon state fair"}
{"text":"Snopes is losing credibility. Claims this is 'mostly false' because the ceo didn't individually donate to the foundation, but her company did"}
{"text":"Here We Go Again: TIME Just Declared Russia, Syria, and Iran the New \"Axis of Evil\""}
{"text":"Global Elite Prepare For Imminent Solar Storm Apocalypse: Thousands Flee To Underground Antarctica Bases, According To Conspiracy Theorists"}
{"text":"Donald Trump's 22-Year-Old Daughter Is Ruling Instagram"}
{"text":"“If you throw a frog in a pot of boiling water, it will hop right out. But if you put that frog in a pot of tepid water and slowly warm it, the frog doesn't figure out what going on until it's too late. Boiled frog. It's just a matter of working by slow degrees.”"}
{"text":"Selling a Lifetime Subscription to the Politics of Fear"}
{"text":"Tech firm brags about blocking FBI from recovering Clinton emails | Washington Examiner"}
{"text":"Obama Will Bring The Largest Swath Of Ocean Ever Under Federal Control"}
{"text":"‘Their words are lies’: Palestinians furious as Israel clears troops of Gaza war crime allegations"}
{"text":"So why isn't the media asking where these new 15,000 emails are coming from?"}
{"text":"U.S. wants to force lower speeds on truck and bus drivers: The U.S. is seeking to forcibly limit how fast trucks, buses and other large vehicles can travel on the nation's highways. Regulators are considering a cap of 60, 65 or 68 mph, though that could change."}
{"text":"Stefanphen Molyneux &lt; Why you always lying?"}
{"text":"US Navy Fires \"Warning Shots\" After \"Harassed\" by Iran Patrol Boat"}
{"text":"Is this legit? Executive order enacting martial law from September 5-29 @ Fort Carson, CO"}
{"text":"The House of Rothschild: The Money's Prophets"}
{"text":"The Other Side of the Rio Olympics"}
{"text":"BleachBit Brags Of Wiping Hillary's Servers Clean With Claims It \"Stifled FBI Investigation\""}
{"text":"Hillary Clinton stages her rallies."}
{"text":"Passenger Videos Chemtrails on RyanAir Flight"}
{"text":"Has Trump taken over r\/conspiracy?"}
{"text":"New York City Lets You Choose From 31 Different Gender Identities... I'm All For Freedom, But At What Point Is This Too Far And A Form Of Mental Illness?"}
{"text":"The EpiPen Scandal Is Worse Than You Think: What You’re Not Being Told"}
{"text":"The Red Line and the Rat Line - Seymour M. Hersh on Obama, Erdoğan and the Syrian rebels"}
{"text":"The leader of the New Black Panther Party in Houston has endorsed Donald Trump."}
{"text":"Every year around the end of summer, people start talking about some big event happening, predicting war or natural disasters. Is there any chance something will happen?"}
{"text":"COINCIDENCE? DR. DREW’S SHOW CANCELLED \"DAYS\" AFTER QUESTIONING HILLAR..."}
{"text":"Was she lying about her father?"}
{"text":"Democrat Senator’s Daughter Is CEO of Mylan, the Clinton Foundation Supporter That’s Price Gouging on the EpiPen"}
{"text":"Tim Kaine Was In Honduras When Both Drug Trafficking To Mena, Arkansas Began And When US Military Started Increasing Their Presence In Honduras. . • \/r\/HillaryForPrison"}
{"text":"Tim Kaine Was In Honduras When Both Drug Trafficking To Mena, Arkansas Began And When US Military Started Increasing Their Presence In Honduras. . • \/r\/HillaryForPrison"}
{"text":"Close all mosques &amp; ban the Koran: Poll-topping Geert Wilders launches ‘de-Islamization’ manifesto"}
{"text":"Its All Blowing Up - Cuss And Discuss - Dr William Mount"}
{"text":"Stingray documents offer rare insight into police and FBI surveillance"}
{"text":"Documentary on human genetic engineering?"}
{"text":"WikiLeaks' Julian Assange: Hillary Clinton's 'elite immunity' protects her from prosecution"}
{"text":"Stephen Coughlin Red Pill Brief: all 10 videos"}
{"text":"Pirate Bay founder Peter Sunde: \"I have given up. To win the war, we first of need to understand that we are dealing with extreme capitalism that’s ruling, extreme lobbying that’s ruling, and the centralization of power.\" - December 11, 2015"}
{"text":"Mugabe Orders Arrest Of \"Rats We Call Athletes\" After Zimbabwe Wins No Olympic Medals"}
{"text":"Hidden Agenda Perpetrated By Congress &amp; The Fed Exposed In One Simple Chart"}
{"text":"Our Catastrophic Failure of Jihad Denial. Stephen Coughlin reveals the terrifying extent of the blindfolding of America in the terror war."}
{"text":"Signal"}
{"text":"Trump supporter describes the hate she witnessed"}
{"text":"Hope Fades As The Collapse Spreads Across The Country"}
{"text":"US: CLINTON CALENDARS WON'T BE RELEASED UNTIL AFTER ELECTION"}
{"text":"US: Clinton calendars won't be released until after after the election"}
{"text":"Video: BleachBit Brags It 'Stifled' The Hillary Email Investigation"}
{"text":"VT Exclusive: Largest Pedophile Ring in History, Heads of State Scramble (prepareforchange)"}
{"text":"Jim Willie Says Media Blackout! War In Progress!! - BeforeItsNews"}
{"text":"Avoiding A Cure: How Big Phamra And The DEA Collude To Control Your Health"}
{"text":"The Alternative Media is Replacing the Mainstream Media: Here'\u0080\u0099s How You Can Help - Prepare for Change"}
{"text":"Let's Get One Last Record Corrected"}
{"text":"Government Hackers Caught Using Unprecedented iPhone Spy Tool"}
{"text":"Caught On A Hot Mic In 1992, Larry King Assures Bill Clinton: \"Ted Turner Would Serve You\""}
{"text":"Bolivian Minister Kidnapped, Beaten To Death By Striking Mineworkers. The fatal beating came after the killings of two protesters"}
{"text":"Flashback: Leader of Al Qaeda group in Iraq was fictional, U.S. military says"}
{"text":"The Occult Meanings of Israel and the Sinister Agendas of the Zionists"}
{"text":"Flashback: Hillary appeared on Letterman in 2000 while running for the Senate. Letterman's team rigged the interview to help her, by giving her the questions to a \"pop quiz\" in advance, so she could research the correct answers. There is precedent for those who suggest Kimmel rigged the pickle jar."}
{"text":"Jimmy Kimmel Threatens Alex Jones Subliminally Over \"Pickle Gate\""}
{"text":"[113] Lawsuit Against DNC, Army Misplaces Trillions, #NoDAPL Bigger Than Expected"}
{"text":"WikiLeaks Exposes Hillary’s Stunning Connection to ISIS — Mainstream Media Blackout Ensues"}
{"text":"Princess Diana's Murder (We need to stop letting them kill the good people. BM,BH,JFK,MLK,MX....)"}
{"text":"Will They Really Open JFK Files?"}
{"text":"Hillary Clinton: Helping rapists get away with their crimes since 1975..."}
{"text":"Avoiding A Cure: How Big Pharma And The DEA Collude To Control Your Health"}
{"text":"Do you have a question about 9\/11 that nobody seems to ask or discuss?"}
{"text":"Why There's A Media Blackout On The Native American Oil Pipeline Blockade"}
{"text":"Aiding and Abedin"}
{"text":"Underground Newz: Open Letter on Donald Trump from GOP Nation"}
{"text":"Jay Michaelson, a contributing editor for the 'Forward', proclaims that Donald Trump is the candidate of “the losers.” ~ Why does it seem natural for a Jew to label about half of the American people as ‘white supremacist’ i.e., rabid racists."}
{"text":"Establishment Study on Chemtrails Has Not Stymied Activists"}
{"text":"Assange Hints: WikiLeaks Will Be Releasing A Lot More Interesting Intel On Hillary Clinton. Oh, And By The Way, Bernie Should Have Hammered Hillary On Her Experience At The State Department, Because There's A Lot Of Stuff To Go After There..."}
{"text":"Hillary Clinton Promises To Shut Down 'Conspiracy Theory' Websites"}
{"text":"Deceased FBI Agent found alive With Silenced Pistol At Trump Tower August 4th 2016"}
{"text":"Bilderberg Club - The worlds elite meet here every year to discuss how they can increase in power. This place is as bad as the Clinton Foundation"}
{"text":"my girlfriend left me after finding out I spend $400 on \"enhanced lap dances\" at Deja Vu Showgirls..."}
{"text":"Hillary Clinton gives false opposition Alex Jones free publicity to millions, why?"}
{"text":"Bohemian Grove: Where the rich and powerful go to misbehave"}
{"text":"Hillary Clinton Hot Sauce interview"}
{"text":"When half a million Americans died and nobody noticed"}
{"text":"Why Can't Anyone Stop Israel ?"}
{"text":"Subbed to this group to read conspiracy stories, but it's basically r\/thedonald, sorry but leaving this sub."}
{"text":"Alert – Herman Cain Comes Forward to Expose Nasty Truth Behind Epi-Pen Scandal"}
{"text":"Hunter S. Thompson on 9\/11"}
{"text":"Got banned for this with no explanation or warning: A person posts in \/r\/confession that they cannot even get hired at McDonald's. A user says he just needs a better resume, and this seems to be the popular opinion."}
{"text":"Who writes this stuff?"}
{"text":"The stars are moving so much tonight"}
{"text":"Important announcement to ALL Trump supporters"}
{"text":"The tribe should take a long hard good look at what their ancestors did before they consider crying about the Holocaust."}
{"text":"Removed"}
{"text":"Toxic Cookware Chemicals Have Polluted Drinking Water for Millions"}
{"text":"Removed"}
{"text":"How The Hillary ‘Victory Fund’ Uses State Democratic Committees To Launder Money To The DNC | Zero Hedge"}
{"text":"Obama Admin. Forced FBI to Stand Down &amp; Stop Investigating Clinton Foundation - Nesaranews"}
{"text":"UK lawmakers say Facebook, Google, and Twitter are 'consciously failing' to fight ISIS online"}
{"text":"David Rockefeller - replacement body parts, Chase and Bilderbergers - Nesaranews"}
{"text":"How Government Solved the Health Care Crisis - Animation"}
{"text":"French intelligence orchestrated Ghouta poison gas attack: Syria"}
{"text":"https:\/\/np.reddit.com\/r\/LateStageCapitalism\/comments\/4zswz9\/xpost_do_denvers_homeless_people_deserve_the_same\/?ref=share&amp;ref_source=link"}
{"text":"[[xx]x-post] Do Denver’s homeless people deserve the same rights as Monsanto?"}
{"text":"Facebook blatantly censors my video revealing blatant censorship."}
{"text":"Whenever you're afraid to swim out in the ocean, just remember..."}
{"text":"Hillary Clinton Talks About Her Dark Heart"}
{"text":"Duper's Delight: Bush Sr. Laughs at JFK Shooting"}
{"text":"A ton of unfiltered truth in a single video. Mass surveillance, the decline of moral values through porn and the depopulation agenda."}
{"text":"iPhone hack reveals how easily governments can gain sophisticated surveillance software"}
{"text":"Unmasking 9\/11 with Christopher Bollyn"}
{"text":"Private Prison Involved in Immigrant Detention Funds Donald Trump and His Super PAC"}
{"text":"Alex Jones"}
{"text":"The Pentagon has shipped more than a million small arms to Iraq and Afghanistan’s defense forces"}
{"text":"Clean Break or Dirty War? Israel's Foreign Policy Directive to the United States (March 27, 2003)"}
{"text":"President Putin must take control of Bank of Russia"}
{"text":"Zeitgeist: The Movie"}
{"text":"Women lining up for free sterilization in Venezuela as economic crisis deepens"}
{"text":"The NWO's secret to eternal youth spilled by D.R..."}
{"text":"How Many Guns Did the U.S. Lose Track of in Iraq and Afghanistan? Hundreds of Thousands."}
{"text":"Catastrophic Failure: Blindfolding America in the Face of Jihad"}
{"text":"Internet voting update: U.S. government is sending propaganda out to millions of citizens this week to undermine multi factor authentication which will be used to verify internet voting. (Screen shot of email sent by social security)"}
{"text":"Saudi Arabia Cries Foul Play in Yemen"}
{"text":"Is price inflation really inflation, or is todays price inflation the result of deflation?"}
{"text":"iPhone 6 pixel and touch issue: Apple is doing this to get the iphone 6 users to upgrade to 7, its history proves it!"}
{"text":"Is Tupac Shakur still alive? Claims shock selfie 'proves' murdered rap icon is not dead"}
{"text":"Project SIGMA, or How They Began Selling Your Genome to the Greys"}
{"text":"Man Shot, Killed in Hays, Kansas by Police"}
{"text":"This sub is a paid for shill for Donald Trump and to attack Hillary Clinton. Mods are getting PAID by Trump"}
{"text":"CDC Admits Polio Vaccine Tainted with Cancer Causing Virus"}
{"text":"Steemit is Control Grid [Confirmed]"}
{"text":"Blue Part Of The Eraser Isn't For Erasing Pen Marks.. This Is What It Is Used For"}
{"text":"The UAE Spends Big on Israeli Spyware to Listen In on a Dissident"}
{"text":"Reddit's dying, conspiracy's been taken over by thedonald, and steemit looks cool so let's all go there, ok? Also what's your favorite 911 conspiracy and why do you feel that way?"}
{"text":"UK Investigates Freeman Control Of Police Force - Unqualified Freemasons Get Promoted To Top Positions"}
{"text":"The most obvious Hoax Ever SH"}
{"text":"Donald Trump is clearly on the inside and working against the people"}
{"text":"Why I can I not find a historical pictures of earth for the last 30 years."}
{"text":"Turned off by Trump: Republican mega-donors focus on congressional races"}
{"text":"Stop sharing and using the BLM meme"}
{"text":"You've Been Trumped (2011) Documentary Trailer about the construction of a golf course on the Scottish coast by Donald trump."}
{"text":"Kurds Say Something's Fishy About Turkey's Swift Victory in Jarablus"}
{"text":"Post suspiciously vanishes from r\/uncensorednews, what's up with that?"}
{"text":"Dyson will spend $1.4 billion, enlist 3,000 engineers to build a better battery"}
{"text":"George Soros: ‘I Am A God, I Created Everything’"}
{"text":"Any Canadians here? I constantly hear only 3 of 1000 sexual assault cases result in a conviction."}
{"text":"Is Tupac Shakur still alive? Claims shock selfie 'proves' murdered rap icon is not dead"}
{"text":"Favourite to be next Dutch PM vows to Ban the Koran and Close all mosques"}
{"text":"Ben Rich: Shocking Comments About UFO Technology"}
{"text":"Benghazi-Related Documents Found In Hillary Clinton's Deleted Emails"}
{"text":"Hey guys join our Discord chat dedicated to this sub. Invite is valid for 24 hours"}
{"text":"Help!"}
{"text":"Moscow Considers McLaren Report 'Falsified,' Prepares Criminal Offenses"}
{"text":"Hillary Clinton: The Greatest Commodities Trader of All Time"}
{"text":"Judge upholds California state law requiring mandatory vaccinations"}
{"text":"Harvard Economics Professor Suggests Banning Cash Because it's \"Sinister\""}
{"text":"Texas earthquakes likely linked to fracking activity - US environmental agency"}
{"text":"Wife of Oregon militia leader killed by cops to sue FBI"}
{"text":"White genocide: Merkel's Migrant CRISIS: One YEAR ON"}
{"text":"Several Astronauts, including Gordon Cooper (Mercury, Gemini) and Edgar Mitchell (Apollo), believe we're visited by technologically more advanced aliens. Individuals from NASA, CIA, Army, Air Force as well as Rocket Scientists and Physicists agree with them."}
{"text":"A website to show to those who think UFOs are BS"}
{"text":"What Happened in Portugal After They Decriminalized All Drugs, From Weed to Heroin"}
{"text":"The Clinton family’s history of pay-for-play while Hillary was secretary of state is blatant, willful, and indisputable."}
{"text":"Why do we need leaders when we are leaders ourselves?"}
{"text":"America's warmongering policy"}
{"text":"Trump’s Foreign Policy Advisor Teamed Up With Blackwater &amp; A Saudi Prince To Arm Al-Qaida In Syria"}
{"text":"Media silence on the major Israeli group that sees ISIS as ‘a useful tool’ is utterly shameful"}
{"text":"Why Russia Must Break From US Economic Hegemony (Video)"}
{"text":"Bob Lazar's Story"}
{"text":"WHY HAS OUR CREATOR FORBIDDEN EATING PORK?"}
{"text":"If You Use Tor Browser, The FBI Has Labeled You a Criminal"}
{"text":"A Decentralized Revolution: States Standing Up To The Federal Government. Will We Eventually See A Succession Attempt??"}
{"text":"Louisiana Officials Demand That Self-Reliant Locals Stop Surviving The Flood Without Permission"}
{"text":"What ever happened to the FEMA camps and Martial Law?"}
{"text":"Geoengineering Watch Global Alert News, August 27, 2016 ( geoengineering..."}
{"text":"Why middle east hates Western countries especially US.."}
{"text":"The Shadow Brokers NSA Hack Claim Unlikely, Say Experts"}
{"text":"The Truth About the #Syrianboy Viral Photo. Its really a story of two boys. #OmranDaqneesh"}
{"text":"GCHQ, JTRIG Engaged in Online Propganda on Reddit. How they Manipulate, Deceive and Destroy Communications and Relationships."}
{"text":"Send them back: Bavarian minister wants to repatriate 1,000s of refugees within 3 years"}
{"text":"The only reason Einstein's relativity was invented was to explain away the Michelson-Morley experiment and maintain the atheistic dogmatic philosophical agenda of heliocentrism."}
{"text":"Trump's grandfather was a pimp and tax evader; his father a member of the KKK"}
{"text":"Un Hombre Se Divorci De Su Esposa Despus De Ver Esta Foto"}
{"text":"People Are Now Literally Dying While Playing Pokemon Go"}
{"text":"Money is now considered to be a club"}
{"text":"New conspiracy theory question: Is the air being sampled and analyzed to detect illegal activities and or detect anti-government activities."}
{"text":"Trump vs Clinton: Entertainment"}
{"text":"Mysterious death of prominent Dallas lawyer ruled homicide"}
{"text":"Sinn0h (YouTuber) exposed for view botting"}
{"text":"What would it take for you to agree to take part in a false flag operation?"}
{"text":"\"Goodbye America! President Obama Has Just Signed Over The Nation! Wait Until You See How!!!!\"."}
{"text":"Facebook Censors Video Exposing PBS Cutting Hillary\/TPP Criticism From Jill Stein Interview - Breitbart"}
{"text":"Which came first?"}
{"text":"Ex Pharma Sales Rep speaks the truth - Pharma doesn't want to cure you"}
{"text":"Order out of Chaos: A blog on the New World Order"}
{"text":"Fast &amp;amp; Furious Was Child's Play -- Pentagon \"Lost\" 700,000 Guns in Iraq and AfghanistanÂ"}
{"text":"How Monsanto Silences Dissent (Update!)"}
{"text":"They Are After Your Cash (And If This Happens They Will Get It)."}
{"text":"Opioid Epidemic Greatly Exaggerated? Because White Lives Matter."}
{"text":"Message to the Souljahs: Chasing Our Tails"}
{"text":"From r\/history \"This article argues that Pseudo-Dionysius the Areopagite was a persona adapted by Pagan Polytheists to preserve Neoplatonic ideas within Christianity so that someday pagan Neoplatonism could be resurrected in better times\""}
{"text":"Cheating posting Imran Hosein, but interesting piece running from Khazars, Crusades, Zionism, WW1. (Gog &amp; Magog thesis)"}
{"text":"George Soros: ‘I Am A God, I Created Everything, I Control America And Hillary Clinton’"}
{"text":"Propaganda: Screenshot from a kid's show (Amazing World of Gumball) showing a reptilian banker. \"It feeds on the blood of the common man.\""}
{"text":"Word Games: What the NSA Means by \"Targeted\" Surveillance Under Section 702"}
{"text":"You’re Likely Committing A Crime Right Now In “The Land Of The Free”"}
{"text":"Are Chevrolet’s “Real People, Not Actors” Car Commercials Fake?"}
{"text":"To all of the Hillary shills, I present my favorite pepe. • \/r\/The_Donald"}
{"text":"With Olympic Games Done, New Campaign Of ISIS \"Stories\" Emerges In Lead-up to 9\/11 Anniversary"}
{"text":"Hey guys come join the r\/Conspiracy Discord chat"}
{"text":"Unanswered questions for Steem.com whose answers might reveal deep-state backing"}
{"text":"Conspiracy people are doing the work for the NWO"}
{"text":"The Super-Entity That Controls Finance &amp; Commerce"}
{"text":"WikiLeaks: the origin of the Dangerous Donald Trump Narrative"}
{"text":"The EpiPen Scandal Is Worse Than You Think: What You're Not Being Told"}
{"text":"Iamjj12 im glad you posted this. I found one of these bills as well, except I live in Florida. Apparently the group is coast to coast. I couldnt find anything about it until this reddit. I havent decifered any other information. I am become death is a quote of robert oppenheimer"}
{"text":"David Duke vs fat dishonest shill"}
{"text":"Really out there. Bob Dylan is a time traveler."}
{"text":"The truth about 9\/11 finally revealed"}
{"text":"DCLeaks Website Down, Twitter Suspended After Releasing Soros Docs"}
{"text":"Governments\/Airlines Are Openly Spraying Passengers w\/ Pesticides On Planes"}
{"text":"\"Let us never tolerate outrageous conspiracy theories concerning the attacks of September 11th - malicious lies that attempt to shift blame away from the terrorists themselves, away from the guilty.\""}
{"text":"Reversal Language"}
{"text":"Report: Google Censors ‘Hillary Clinton Health Problems’ Search Results. Popular search engine accused of running cover for presidential nominee"}
{"text":"WELCOME TO TRUTH | Full Documentary 2014"}
{"text":"One trooper told the Underground that these stings were planned not for public safety but to fill the city coffers. Because drug stings cost a lot of money and they have to burn the drugs afterwards... But a soup upped racing car can be auctioned off easily."}
{"text":"The Whole Story Of Zionist Conspiracy"}
{"text":"Zionist Jew Bill Maher gets owned by Glenn Greenwald over religion and A..."}
{"text":"Blue Part Of The Eraser Isn't For Erasing Pen Marks.. This Is What It Is Used For"}
{"text":"China bans Muslims from checking in Hotels in Major cities"}
{"text":"The Frankfurt School - Western Subversion by Design (must watch)"}
{"text":"Hilary Clinton Using Green Screens for Fake Crowds and Fake Speeches"}
{"text":"Illuminati Symbols in Logos"}
{"text":"Howell refused to carry out a CIA terror attack on gay pride parade in Los Angeles. No word of his status 12 weeks later."}
{"text":"The Story of Your Enslavement"}
{"text":"Voices Of The Voiceless"}
{"text":"Word Games: What the NSA Means by “Targeted” Surveillance Under Section 702"}
{"text":"Just 90 companies are to blame for most climate change, this 'carbon accountant' says"}
{"text":"Amazing new photograph ‘shows’ rap superstar Tupac Shakur 20 years after he was gunned down"}
{"text":"Frederick County official spared jail time in Anne Arundel prostitution case"}
{"text":"Shreveport Police officer arrested"}
{"text":"Beware of propaganda whose aim is to discredit conspiracy theorist \"extremists\" by passing factitious BS around. Cannot confirm Hillary is out to stop websites: but Cass Sunstein and Obama are!"}
{"text":"Frontman Bono: How the U2 Entertainer's Celebrity Philanthropy Masks U.S. Imperialism and Corporate Agendas"}
{"text":"Genetic Fallacy: How Monsanto Silences Scientific Dissent"}
{"text":"Washington Moves Forward With Cannabis Research Intenionaly \"Sidestepping\" Federal Law"}
{"text":"Looking for information on corporations"}
{"text":"Did the U.S. Air Force just take a major step toward verifying that chemtrails are real?"}
{"text":"A WHAT IF Conspiracy"}
{"text":"TIL: Ronald Hamburger fire study excluded an explosive charge hypothesis when he found it was incompatible with the official story."}
{"text":"Face in my granola bar"}
{"text":"NASA Detects Huge \"Ringed Object on Collision Course\" With Earth! Ezeki..."}
{"text":"Resource for domain research + a few examples"}
{"text":"Media Network ADMITS Promoting Hillary &amp; Terminates Popular Show"}
{"text":"Bob Lazar"}
{"text":"Shocking Video Shows Cops Kick In Door, Assault, &amp;amp; Pepper Spray Innocent 84yo Grandma"}
{"text":"Ben Rich"}
{"text":"Area 51 Interview with EBE-3"}
{"text":"Could this theory gain traction...Hillary Clinton Foundation - used primarily to pay off electoral votes which in turn would benefit the foreign countries who \"invested\""}
{"text":"Harvard Study Finally Admits Drug Prices Are High Because Govt Grants Big Pharma A Monopoly"}
{"text":"Loch Raven Dam UFO"}
{"text":"A PHYSICIST\"S THOUGHTS on Sun Movement, Solar Simulator, Solar Sail and ..."}
{"text":"Loch Raven Dam UFO"}
{"text":"UFO Above Nuclear Facility in Veracruz, Mexico 5-11-2014"}
{"text":"Question about why no one has been talking about a Bernie comeback."}
{"text":"Optimistic conspiracy theorists declare that 9\/11 was an accident"}
{"text":"The Centurion Report 8 27 16 #Wildfires and #Hurricanes New Broadcast Everyday"}
{"text":"Is Trump a 21st century Hitler? This film sure does points to it."}
{"text":"Russian Military Leaders Go Underground - Dr William Mount"}
{"text":"NSA Whistleblowers: NSA Hack Was Likely An Inside Job"}
{"text":"Deep water horizon movie"}
{"text":"Download The CDC Autism\/MMR Files Released By Dr. William Thompson (via Vaxxedthemovie.com while you still can)"}
{"text":"Robert Hood, a security consultant and former warden of a Supermax prison said james Holmes did not turn up in a search of inmate databases for all 50 states. He called the gunman “the vanishing inmate.”"}
{"text":"[video] When a ex marine tells it the way it is! Ken o'keefe."}
{"text":"Google is Censoring Hillary's Health Problems Search Results - See For Yourself"}
{"text":"Ancient coin banned from eBay due to Nazi-like symbol"}
{"text":"Is This Hillary Clinton's Roadmap For America? | Zero Hedge"}
{"text":"Renter nation: The Shitcanning of the American Dream"}
{"text":"Hiduth Conspiracy Videos Volume: No1"}
{"text":"Snopes lies about Clinton are just absurd. Kenneth Starr, the Clinton friend who followed them around from scandal to scandal (including \"oral sex isn't sexual relations\" and Whitewater)? The reason his burying of Vince Fosters death isn't suspicious is \"WHY WOULD HE LIE?!\""}
{"text":"Sheriff arrested for allegedly having sex with prisoner"}
{"text":"Does anyone have any compilations of direct sources and Wikileaks leaks showing Hillary armed ISIS, is funded by Saudi Arabia and that the Clinton Foundation funnels it's money to the Clintons? Trying to refute a friend who's been linking to Wikipedia and Snopes as \"proof\" Hillary is innocent."}
{"text":"We found, remarkably, that the minority group was able to push their view to become the dominant opinion. By the end of the last rounds, everyone in the population was saying “white\/gold”"}
{"text":"The implications of this is beyond scary."}
{"text":"Journalist and Investigator “Barrett Brown Comments on His Early Release Date”"}
{"text":"An open letter to the extraterrestrials among us."}
{"text":"#PayToPlay: State Dept to reveal Clinton's meetings with possible donors only after election"}
{"text":"WAR = PROFIT [Documentary]"}
{"text":"Syria, the \"line in the sand,\" HRC, aiding and abetting, and poison gas [theory, speculative]"}
{"text":"How the illuminati works and maintains order among the psychopaths"}
{"text":"Clinton's Pay-to-Play Is The Natural Consequence Of Big Government | Zero Hedge"}
{"text":"Unless congress stops it, the FBI wants to mass-hack computers, especially targeting Tor and Bitcoin users"}
{"text":"We wanted to know if it would be possible to manipulate the dominant opinion. More importantly, we wanted to know if we could then use a small minority of people to mobilize an alternative opinion. Remarkably, we found that we could."}
{"text":"Frederick County official spared jail time in Anne Arundel prostitution case"}
{"text":"Trending items have always been selected by algorithms"}
{"text":"Everything You Need To Know About Medical Marijuana: Dr. David Casarett makes the case that the FDA, the medical community and even big pharma are all angling for their piece of the brownie."}
{"text":"Died trying to save a country that does'nt even want justice for him."}
{"text":"Veteran Suicides — A Hidden Epidemic: In 2014, more veterans died by their own hand than all the US soldiers killed in Iraq and Afghanistan to date. Politicians talk about helping veterans, but will they ever do more than talk?"}
{"text":"The disenfranchisement of felons has played a key role in the outcome of elections throughout the country. In 2000, it even decided the presidential race. What impact will this undemocratic practice have this year?"}
{"text":"In Reversal, Gov. Gary Johnson Now Supports Mandatory Vaccination"}
{"text":"Science says lasting relationships come down to 2 basic traits"}
{"text":"Did the U.S. Air Force just take a major step toward verifying that chemtrails are real?"}
{"text":"The Truth About the Syrian Boy Viral Photo"}
{"text":"Memory Erase and Forced Reincarnation.."}
{"text":"Israel's carefully carved brand – an oasis of democracy in an arid authoritarian desert – is crumbling. The Internet has made it impossible to sustain official propaganda. So it's resorting to ever more extreme crackdowns on civil rights activists who shine a light on its brutality"}
{"text":"Libertarianism Debunked."}
{"text":"False Karma, Memory Erase and Forced Reincarnation"}
{"text":"No TPP...this year: 'Good News,' Says Sanders, as McConnell Signals No Lame-Duck Vote on TPP"}
{"text":"Assange: Murdered DNC Staffer Seth Rich is 'Alleged' WikiLeaks Source"}
{"text":"Clinton &amp;amp; Media Collusion Tied to Drug Money, Iran-Contra Scandal"}
{"text":"The first Israeli settlements were built on a lie"}
{"text":"Well, what does \/r\/conspiracy think about this?"}
{"text":"Was the murder of America's Most Wanted host John Walsh's son a psy-op? I think it's quite possible Adam Walsh may still be alive."}
{"text":"The Mandela Effect"}
{"text":"Report from the Florida Zone: The Hand of Death cult and serial killers Ottis Toole and Henry Lee Lucas"}
{"text":"Bob's Burgers Louise theory"}
{"text":"Oculus, the Closed All-Seeing Eye at Ground Zero, to \"Open\" Each Year on 9\/11"}
{"text":"Remember Saddam's WMD? We knew he had them at one point. They were ours.We sold them to him. But he destroyed them in 1991."}
{"text":"Hillary Clinton's 2009 Ethics Agreement - link to cryptome"}
{"text":"Baltimore Police Deploy Surveillance Tech Designed for the Iraq War"}
{"text":"Larry Silverstein admits new WTC designed in 2000, long before he even owned the twin towers"}
{"text":"Aaron Russo: Rockefeller knew about 9\/11 well in advance"}
{"text":"World War 3"}
{"text":"jesus is hitler"}
{"text":"What is your all time favorite conspiracy?"}
{"text":"The Mellon Institute is the very same people that said Asbestos was healthy. While at the same time saying Sodium Fluoride was safe. WWII era it was used as rat poison. After noting the rats teeth appeared healthier research was launched by the Mellon Institute."}
{"text":"'To bomb and violate and destroy is not to liberate, it is to rape'"}
{"text":"New York Times columnist called America dumb for not understanding Russia invading Ukraine. But he's dumb because the US supported a violent coup in Ukraine."}
{"text":"The Fluoride Deception: How a Nuclear Waste Byproduct Made Its Way Into the Nation's Drinking Water"}
{"text":"[Conspiracy Theory] Japan is trying to trick ignorant young people into conceiving children by spreading misinformation about things like \"safe days\" and other poorly written concepts in adult media."}
{"text":"World War 3 Has Begun - What they don't want you to know"}
{"text":"Herman Cain Exposes Sick Truth Behind Epi-Pen Scandal"}
{"text":"My GOD is more powerful then yours....... Unless the CIA tried tio manipulate my shit? (highly unlikely) yea where is your God?"}
{"text":"Muslim Tries To Fake A “Hate Crime” By Sending Letter With White Powder To Mosque, Gets Caught And Not Only Implicates The Whole Mosque In The Conspiracy, But The Powder Was Actually A Chemical Used For Explosives"}
{"text":"George Carlin - Rats &amp; Squealers (you don't help the police)"}
{"text":"Apollo conspiracy theorists will tell you this was filmed in a giant vacuum chamber in Arizona."}
{"text":"It seems like the media is concentrating completely on Trump to let Obama and Hitlery get away with murder. Literally. Oder?"}
{"text":"In A Land Far Far Away"}
{"text":"[How Likely Is This] Pope Francis To Make UFO And Alien Disclosure, Proclaim The Antichrist At 2016 Mekudeshet Festival In Jerusalem, According To Conspiracy Theorists"}
{"text":"Chomsky has done more to keep the 9\/11 blood libel alive, and cause the murder of more than a million Muslims than any other single person."}
{"text":"Russian doping whistleblowers fear for their lives after cyber attack"}
{"text":"Did Cargill intend to dump 60 billion pounds of hazardous waste to earn $22 billion?"}
{"text":"New Virus Breaks The Rules Of Infection: A team at the U.S. Army Medical Research Institute of Infectious Diseases has found a mosquito virus that's broken up into pieces. And the mosquito needs to catch several of the pieces to get an infection."}
{"text":"Washington State Tells DEA to Shove It, Will Conduct Cannabis Research in Violation of the Law"}
{"text":"Project White Genocide: The Dark Agenda of Count Coudenhove-Kalergi"}
{"text":"Project White Genocide: The Dark Agenda of Count Coudenhove-Kalergi"}
{"text":"John Lear - \"Everything NASA Tells you Is a Lie.\" Aliens, Abductions, Inner Earth societies, and more"}
{"text":"German national TV's take on the Syrian conflict (political cabaret)"}
{"text":"Bill Uhouse: Area 51 Whistleblower"}
{"text":"Anonymous - Hillary Clinton: A Career Criminal"}
{"text":"Germany's economy minister, Sigmar Gabriel, says the Transatlantic Trade and Investment Partnership (TTIP) has \"failed\""}
{"text":"The US will accept its 10,000th Syrian refugee for resettlement this week"}
{"text":"EU Lies to Moscow: Official Reveals Sanctions Not Related to Ukraine Peace Deal"}
{"text":"Oligarchy in action. Billionaire donors Laura and John Arnold support far more in Maryland than aerial police surveillance."}