{"text":"San Francisco’s mayor won’t crack down on people using city as an outdoor toilet"}
{"text":"UK: Scores descend on Parliament Square over Labour antisemitism code"}
{"text":"Что такое истина?"}
{"text":"when did the intellectual zombie apocalypse begin? by Arch-Advocate | Arch Advocate"}
{"text":"Tucker on ridiculous NATO guarantee to protect tiny Montenegro: Seems like leftists always want us to \"have an altruistic obligation to act when it's NOT in our interest. They are very enthusiastic about wars, but never any wars that might benefit the US\""}
{"text":"The term \"Russian collusion\" has failed, so it's being rebranded as \"Russian intereference\". Keep an eye out."}
{"text":"After Attacking Conservatives, Disney Filmmaker’s Tweets Reveal Racism, Homophobia, And Incidents Of Sexual Assault Against Children"}
{"text":"The Trump impeachment proceeding should be continued?"}
{"text":"It's Happening"}
{"text":"Caught shareblue in the wild trying to make us look bad - sad!"}
{"text":"On this day in 1993, Deputy White House Counsel Vince Foster committed suicide in a park to avoid living with the shame he brought to the Clinton’s. RIP Vince."}
{"text":"Can you name a line the Muslims haven't crossed? They've killed comedians, innocent civilians, former muslims, critics of the religion, comic artists like Charlie Hebdo, children... They intentionally killed children when they bombed Ariana Granday's concert. They sentenced Tommy Robinson to death."}
{"text":"Early prevention is key. Know the signs."}
{"text":"Voter Fraud Database Tops 1,000 Proven Cases"}
{"text":"FOR THE \"PEOPLE\""}
{"text":"“Go against the tide and sell a product that noone else is selling.”"}
{"text":"FLASHBACK: 1\/14\/17: The Nobel Peace Prize Winning GOD of the Supposedly \"Peace-loving\" Democrats, after Drone-striking 7 simultaneous Countries Worth of Brown Children Topped off his Presidency With the Nation on the Very Brink of WWIII."}
{"text":"Tucker: \"Why are the people mad about foreign influence in Americans elections (Russians) encouraging foreign influence in American elections (illegals given right to vote in San Francisco)\". These people are full of shit. And you can't Cuck The Tuck."}
{"text":"Burn the idiot Bern"}
{"text":"Uh oh! Going against the MSM ideals? Can't have that. Time to start up the \"he is crazy\" stories"}
{"text":"Absolutely don't understand why POTUS doesn't fire Sessions, Rosenstein, and Wray today for not following the laws of our country."}
{"text":"The left thinks they are morally and ethically superior. They are Inverted Reality Morons with nothing valid to argue, so they throw temper tantrums like spoiled children."}
{"text":"Mad Max’s posse"}
{"text":"'For The People'...who hate America!"}
{"text":"I guess Whoopi thinks that the best way to prove you don’t have #TDS is to behave exactly like you do! 😂😂🥜 #TheView"}
{"text":"FLASHBACK: 1\/4\/17: The Nobel Peace Prize Winning GOD of the Supposedly \"Peace-loving\" Democrats, after Drone-striking 7 simultaneous Countries Worth of Brown Children in a non-stop 8 years of war, Topped off his Presidency With the Nation on the Very Brink of WWIII."}
{"text":"Find it a little out of Character to insult POTUS and BSA like this !"}
{"text":"We need to change the law in this country so that it is impossible to give full immunity to anyone for actions taken while holding an elected position, or any position directly confirmed by elected officials."}
{"text":"For the People"}
{"text":"These losers are two years behind this train never had any brakes. It's going to be another two years before they figure out everyone's #walkedaway. See you in 2024 losers"}
{"text":"Viral Video Bus Operator Will Halt Service to North Brussels After Attacks"}
{"text":"Tim Allen skewers TV network that dropped ‘Last Man Standing’ in teaser for show’s comeback."}
{"text":"Absolute savagery from James Woods."}
{"text":"Remember She-Ra Princess of Power ? That strong, sexy, feminine character from the 1980s, well get ready for Zhe-Ra the new gender confused version from Dreamworks coming soon to Netflix. AWW YEAH !"}
{"text":"Another #walkaway"}
{"text":"Hillary Clanton"}
{"text":"What are the Russian Military Hackers being accused of? I bet that there are no specific Hard Drive serial numbers that were supposedly hacked. Have any serial numbers been disclosed?"}
{"text":"Poll: Less Than 1 Percent of Americans Believe Russia Is a Top Problem"}
{"text":"Based actor lays the wood on Bernie Sanders"}
{"text":"A beautiful wall"}
{"text":"Berkeley High grad pleads guilty to helping ISIS, spoke of plan to kill 10,000 in Bay Area"}
{"text":"MAGA"}
{"text":"Struggle is real. Let's find a cure \"For The People\". Ask me about Trump Derangement Syndrome."}
{"text":"Tucker's finest: \"If you dont automatically accept the imprecise, non specific, never fully explained finding of shadowy intelligence agencies that have long track records of making serious mistakes, you've betrayed your country. They must be believed without question, or else. Think about that.\""}
{"text":"Trump Shirt Used for Baby Born at Chick-Fil-A! #MAGA"}
{"text":"Trump says he's 'ready' to put tariffs on all $505 billion of Chinese goods imported to the US"}
{"text":"Rabid leftists tries to attack Lauren Southern while screaming \"I love refugees!\""}
{"text":"This is adorable"}
{"text":"AFTER ATTACKING CONSERVATIVES, DISNEY FILMMAKER’S TWEETS REVEAL RACISM, HOMOPHOBIA AND ASSAULT AGAINST CHILDREN"}
{"text":"Outrage After Dutch Minister Says Multicultural Societies Breed Conflict"}
{"text":"GET THE F**K OUT!’: LAMEASS WHOOPI GOLDBERG UNLOADS ON JUDGE JEANINE OFF CAMERA"}
{"text":"FACT: EVERYONE HAS\/HAD 2 JOBS, BECAUSE EMPLOYERS, INSTEAD OF CLOSING SHOP, SAVED THE ONLY WAY THEY COULD. BY CUTTING WORKERS HOURS TO UNDER 30, WHEN OBAMACARE WAS FORCED UPON THEM."}
{"text":"LITERALLY HITLER - Found this on the front page this morning - posting here for the comment at the bottom."}
{"text":"Editor-in-chief of RT: \"My sources tell me that @JulianAssange will be handed over to the #UK in the next weeks or days. Like never before I wish that my sources are wrong."}
{"text":"This EU toilet stall has me feeling patriotic about ass gaskets. Where are they my cross the pond brothers?"}
{"text":"Commenters point out a double standard in media reporting in \/r\/news and are swiftly censored by moderators."}
{"text":"Maxine Supporters \"pulled an American flag from the truck and burned it on the ground, dancing around and chanting.\""}
{"text":"Found this in a Facebook Group"}
{"text":"James Woods wrecks Bernie Sanders"}
{"text":"Mueller grants pedo immunity"}
{"text":"Well, he's got a point."}
{"text":"You should do your job or you are the enemy of people. Fire is starting in this country."}
{"text":"Perhaps they use a different website?"}
{"text":"#walkaway from these evil lunatics ‼️‼️😡😡Maxine Waters supporters burn American flag outside California rep's office"}
{"text":"Swedish gov DENIES Armenian Genocide"}
{"text":"Dinner For Schmucks Sequel: Vlad's Buffoon."}
{"text":"‘Trump is a Russian plant’: birtherism for liberals"}
{"text":"Trump ready to put tariffs on $500 billion of Chinese imports"}
{"text":"Watch NBC confirm and validate nearly everything we've been saying for the past couple years."}
{"text":"It Wasn't Me with Shaggy as Trump and James Corden as Robert Mullah."}
{"text":"Trump threatens tariffs on $500 billion of Chinese imports: CNBC | Article [AMP]"}
{"text":"The boy who cried Russia"}
{"text":"ClearPoll Beta is out and already there are some home truths in the poll results. Mixed global users. Search \"election\" for a Hillary v Trump poll."}
{"text":"Trump: If things go bad with Putin, I'll be 'worst enemy he's ever had'"}
{"text":"Trump invites Putin to follow-up summit in Washington; Pompeo blasts 'absurd' Helsinki criticism"}
{"text":"Blue State Blues: Why America Hates CNN"}
{"text":"Saw this guy from a YouTube suggestion I am glad I watched. It's an honest in your face analysis of the dems and their manipulation of it's voting base to ensure widespread ignorance creating an easily controlled assurity to maintain power."}
{"text":"\"when did the intellectual zombie apocalypse begin?\" from Arch-Advocate by Pete Dobson on Apple Podcasts"}
{"text":"Do not allow this to be the norm"}
{"text":"Hitch rips the shit out of Clinton for 30+min while MSM tries to run defense. - Miss this dude so much, he and Andrew Breitbart would have loved this timeline!!!"}
{"text":"Mueller's chain of events that sent us into Iraq looking for WMDs that weren't there, after pushing false evidence from Colin Powell."}
{"text":"Amazing how much this botched robbery victims name still appears in the news. Set up a google alert for hos name. Almost daily."}
{"text":"ADOBE ILLUSTRATOR ADVANCED VECTOR ARTWORK"}
{"text":"Overhaul of sex education in England could elevate LGBT rights"}
{"text":"Do not let this be the new norm"}
{"text":"Reporters on Mission to 'Fracture Donald Trump’s Base' \/ NEVER Will Happen on The_Donald !!!"}
{"text":"Obama’s as a neo-Nazi??? HAHAHAHAHAHAHAHAHAHAHAHA"}
{"text":"They desecrated LT. Mike Murphy’s memorial in shithole Suffolk County."}
{"text":"They Broke YouTube"}
{"text":"It's a mental disorder."}
{"text":"At least 11 dead after duck boat capsizes in Missouri"}
{"text":"Dan Bongino Hits it Again! Mueller witch hunt against Trump is to protect Clinton lackey's. (Washington Examiner piece)"}
{"text":"Oath Keepers Cancelled Protest - LAPD said They Were On Their Own"}
{"text":"some people on reddit gamed the system to make searching idiot pop-up with pics of trump."}
{"text":"This is fine."}
{"text":"Mrs Strzok deep state also"}
{"text":"NotTheOnion: Disney villains get own themed kid ride."}
{"text":"In 1978 the BBC banned Johnny Rotten (of Sex Pistols fame) for telling the truth about Jimmy Savile. The BBC have always been propagandizing scum."}
{"text":"Sessions Isn’t ‘Sleepy Sessions’... It’s Very Deliberate... He’s ‘Swampy Sessions’"}
{"text":"Attention Patriots: Meet Your Civil War Opponents."}
{"text":"'PART &amp; PARCEL' of Sadiq the Kahn-land \/ Londoners Least Tolerant of Gay Couples"}
{"text":"'Russian Collusion' by Saul Alinsky. Alinsky actually counseled radical leftists to look in the mirror and whatever you see, blame the other guy for doing or being that exact same thing."}
{"text":"DONALD TRUMP SAYS 'HE COULDN'T CARE LESS' THAT HE'S NOT SUPPOSED TO INTERFERE WITH FEDERAL RESERVE POLIC"}
{"text":"Use as you see fit"}
{"text":"Senator Rand Paul Discusses Comrade Trump Derangement Syndrome…"}
{"text":"The optics on this are HORRIBLE! Another Democrat Scum given Immunity!"}
{"text":"Leftist father: \"I'd to see him ship out to Crimea.\""}
{"text":"Poor Whoopi. Her rage and contempt has made her blind to her own condition. Sad!"}
{"text":"Russia and division exists because WE, THE PEOPLE, made our choice and the establishment elite hates it! This is the official portrait of the 45th President Of The United States. He’s as American as apple pie"}
{"text":"'The Left Is LOSING It's Mind' - Tucker Carlson &amp; Dave Rubin Talk About Mob Mentality"}
{"text":"Man who was removed by ice 11 times tries to kill wife with chainsaw in front of their kids"}
{"text":"Flashback: Johnny Rotten defends Donald Trump, slams ‘left-wing media’"}
{"text":"Rate local and global companies based on policy-Stop haters"}
{"text":"Sleepless in Seattle !!! Gun Owners Must Place Firearms in 'Locked Container' Inside Their Homes"}
{"text":"Winning Volkswagon will be building its electric beetle in the U.S."}
{"text":"NFL Freezes Anthem Protest Policy Pending Negotiations with Union"}
{"text":"Seems like we’re being brigaded again boys. Time to man up and fight back with those orange arrows!"}
{"text":"\"The revolt against the masses\". Fred Siegel on the long history of liberal elitism."}
{"text":"German woman’s dog saves her from migrant knife attack, bites attacker"}
{"text":"Photo of the day (from White House email)"}
{"text":"It looks like Mueller is helping Podesta get off."}
{"text":"This is Hunter Avallone. He is a young internet personality who uses FACTS and LOGIC to support his opinions. Here is his most popular video on the stupidity of the 'Fat Acceptance' movement."}
{"text":"On this day in history -- July 20, 1969 -- Neil Armstrong walks on the \"moon.\""}
{"text":"13 Killed in Missouri as Duck boat capsizes on lake"}
{"text":"Updated - Clinton Associate Tony Podesta Offered Immunity By Mueller Team"}
{"text":"Am I doing it right? 😈"}
{"text":"FOR THE PEOPLE : Offer only valid for animals."}
{"text":"Frank Live | Lauren Southern is a $68,000 Nazi and Alt Lite Cuckoldry with Jewish Lesbian Batwoman"}
{"text":"News on FREE TOMMY (in comments)"}
{"text":"Tucker Carlson: MSNBC’s ‘Out-of-the-Closet Extremist’ John Brennan Still Has Top Security Clearance"}
{"text":"@realDonaldTrump: My deepest sympathies to the families and friends of those involved in the terrible boat accident which just took place in Missouri. Such a tragedy, such a great loss. May God be with you all!"}
{"text":"Trump Keeps on Ticking"}
{"text":"The Deep State Criminals Just Went ALL IN -- THIS IS WAR."}
{"text":"We are watching"}
{"text":"My deepest sympathies to the families and friends of those involved in the terrible boat accident which just took place in Missouri. Such a tragedy, such a great loss. May God be with you all!"}
{"text":"They're getting more and more insane every day!"}
{"text":"BREAKING: Unreleased Whoopi Goldberg Trump Derangement Syndrome Footage!"}
{"text":"“If you call it a riot, it sounds like it was just a bunch of crazy people who went out and did bad things for no reason. I maintain it was somewhat understandable, if not acceptable. So I call it a rebellion.” --- Maxine Waters"}
{"text":"Interpol. Another corrupt globalist organization. Did you know that Interpol accepts funding from private corporations? Did you know that the United Arab Emirates gave Interpol more money last year than all other countries put together? CROOKED!"}
{"text":"Iranian Migrant Jailed for Raping 12-Year-Old Boy in Glasgow Alley"}
{"text":"According to Mueller's Short Bus Counsel...It's official now. Bernie Sanders is tied into the Trump Russia Election Collusion now."}
{"text":"Tony Podesta Offered Immunity To Testify Against Paul Manafort. In other words, for a near identical crime, Bill and Hillary's friend could escape and emerge completely unscathed while Paul Manafort may rot in jail."}
{"text":"\"settled\""}
{"text":"The American Nadzi Party"}
{"text":"WAPO: God bless the ‘deep state.’"}
{"text":"James Gunn CAUGHT searching up old tweets. What an idiot!!!"}
{"text":"The Little King of London"}
{"text":"Hi Shills! Welcome to the_donald!"}
{"text":"This is fine...."}
{"text":"Amazingly beautiful Ivanka...."}
{"text":"Mentally ill Antifa (suppose that's redundant) tried to drive onto Lauren at her event, security took her away while she screamed \"I LOVE REFUGEES\" over and over"}
{"text":"McAlester, Oklahoma - Where MOABs are Born and They Are Very Proud of They're Little Babies"}
{"text":"Obama Attacks Wealthy For Big Houses Before Returning To His $8 Million Mansion"}
{"text":"KEEP IT UP LIBERALS - It won't go well for YOU - WILDFIRE - Mandolin Orange"}
{"text":"When Life Gives You Lemons"}
{"text":"@realDonaldTrump: China, the European Union and others have been manipulating their currencies and interest rates lower, while the U.S. is raising rates while the dollars gets stronger and stronger with each passing day - taking away our big competitive edge. As usual, not a level playing field..."}
{"text":"I love a Patriot! #BlueMidterms! (Reposted)"}
{"text":"Leftists protest California cafe owned by Trump supporter"}
{"text":"I love a good Patriot! #BlueMidterms"}
{"text":"Reason #346 why Liberals should not reproduce - 'Boy or girl?' Parents raising ‘theybies’ let kids decide"}
{"text":"China, the European Union and others have been manipulating their currencies and interest rates lower, while the U.S. is raising rates while the dollars gets stronger and stronger with each passing day - taking away our big competitive edge. As usual, not a level playing field..."}
{"text":"Mentally ill Antifa (suppose that's redundant) tried to dive onto Lauren at her event, security carried her off while she screamed \"I LOVE REFUGEES\" over and over"}
{"text":"🗣💯 🧓🏼"}
{"text":"Libya Accused of Sinking Migrant Ship, Casualties Confirmed"}
{"text":"Donald Trump: If things don't work out with Vladimir Putin, 'I'll be the worst enemy he's ever had'"}
{"text":"Burning flag, chants of 'America was never great' outside of Maxine Waters' Los Angeles office"}
{"text":"NFL kneeling during the national anthem"}
{"text":"WTF LIL MARCO, YOU LOSER!"}
{"text":"You Can't Ban Math: Crypto Unites to Call Out Clueless Democratic Congressman"}
{"text":"Waging a war we can’t lose. Trump: 'I'm ready' to escalate trade war with China"}
{"text":"Ex-CIA analyst Ray McGovern makes a statement in advance of his \"Russiagate and WikiLeaks\" panel at Left Forum 2018. Please share this video to social media."}
{"text":"REX on why we can CHILL about Podesta Immunity Deal"}
{"text":"Oh shit!"}
{"text":"What the actual fuck? Gamer says they could take Marines out anytime.."}
{"text":"\"The People don't need guns\""}
{"text":"Sirius XM Show Supporting Trump LIVE"}
{"text":"The Mainstream Media’s Coup Against President Trump!!!"}
{"text":"Media meltdown hits stupid levels as Trump and Putin hold first summit (EXTRA: detailed clarification of Crimea situation and \"meddling\/collusions @ 20:15)"}
{"text":"Hi everyone my name is Ana Navarro, a \"republican strategist\". I miss the days when the Republican party was a bunch of losers so I decided to jump on the anti-Trump bandwagon and become a sock puppet shill for the globalists and leftists. I do not like all of this winning"}
{"text":"Media meltdown hits stupid levels as Trump and Putin hold first summit (EXTRA: detailed clarification of Crimea situations and \"meddling\/collusions\" @ 20:15)"}
{"text":"President Trump: 'Not one' European country has been improved by a massive influx of immigrants and refugees"}
{"text":"Daily Bible Scripture: Ephesians 5:1-2"}
{"text":"When you see 2020 on the horizon and you already topped Reagans first term in your first two years."}
{"text":"Trump-Putin-Montenegro-NATO and Why They Matter"}
{"text":"@realDonaldTrump: ....The United States should not be penalized because we are doing so well. Tightening now hurts all that we have done. The U.S. should be allowed to recapture what was lost due to illegal currency manipulation and BAD Trade Deals. Debt coming due &amp; we are raising rates - Really?"}
{"text":"far-left Noam Chomsky's thoughts on \"Trump-Russia\". Some of your Bernie Bro friends might be persuaded by this"}
{"text":"The Defeat Of Sorosism"}
{"text":"The Lord's Prayer Michael W Smith with lyrics"}
{"text":"PUPPETS, PARTISANS, or FIGURE HEADS: Three Top FBI Cybersecurity Officials to Retire"}
{"text":"Director James Gunn (Guardians of the Galaxy) deleted a lot of highly creepy tweets last night..."}
{"text":"How dare the Jews can claim Israel as a Jewish State while there are ONLY 50 Muslim Countries in the world (soon to add France and Sweden)! How absolutely dare you sir REEEEEEEEE!"}
{"text":"Dear pedes, before you get thrilled that Obama said Dems shouldn't reject white guys, please note that Beta Panderer SJW In Chief Obama ALSO said this just 2 days ago! \"MEN HAVE BEEN GETTING ON MY NERVES LATELY, WHAT'S WRONG WITH US? WE'RE VIOLENT. WE'RE BULLYING.\""}
{"text":"GA Pedes. Anyone else see Cagles ad claiming Trumps endorsement and slamming Kemp, who Trump fully endorsed? Sad. Cagle is a swamp rat, always has been, no matter what little fist waving he did last year."}
{"text":"Irish Leader Threatens to Block British Planes over Ireland if UK Takes Back Fishing Rights"}
{"text":"THIS NEEDS TO GET TO TRUMP"}
{"text":"Do the do"}
{"text":"This is all they have? Losers go after Trump Hotel Liquor License due to supposed lack of “good, moral character”"}
{"text":"The Daily Show intro quickly flashes a TDS symbol.. very fitting."}
{"text":"A Song about Maxine Waters' District. April 26th, 1992. They NEVER recovered from these riots."}
{"text":"As if it's not already serious enough, pedes... Liberals now openly calling for conservatives to die a slow and agonizing death. \"I hope the land runs red with your families blood. . . the higher the death toll the better.\""}
{"text":"Here are two lobbyists that worked together. They both did the exact same thing. One has been raided, indicted, arrested and is currently in solitary confinement in prison. The other was allowed to quietly shut down his operation and has now be given immunity by Mueller."}
{"text":"@realDonaldTrump: Farmers have been on a downward trend for 15 years. The price of soybeans has fallen 50% since 5 years before the Election. A big reason is bad (terrible) Trade Deals with other countries. They put on massive Tariffs and Barriers. Canada charges 275% on Dairy. Farmers will WIN!"}
{"text":"For All the Moonbats that Want a War with Russia, Nobody's Standing in Your Way"}
{"text":"Elizabeth Warren Simply Can't Tell The Truth"}
{"text":"Alinsky actually counseled radical leftists to look in the mirror and whatever you see, blame the other guy for doing or being that exact same thing. So, if you’re a crook, blame the other guy for being a crook. If you’re a corrupt politician, call your opponent a corrupt politician."}
{"text":"That ain't no anti-American flag burning in Pakistan. That's a flag burning protest in support of Crazy Maxine Waters! And the Left wonders why they lost touch with middle America."}
{"text":"They aren't sending their best, folks!"}
{"text":"Why the hell is the Irish president meeting George Soros?"}
{"text":"$15\/hr FOR THE PEOPLE! Because \"low wages are violence\"!"}
{"text":"Trump calls Obama a \"patsy\" for Russia"}
{"text":"Based Man Lauren Southern: \"The Western world is collapsing … As soon as Western people become the minority, no longer will Western rules apply\""}
{"text":"Yeah baby!"}
{"text":"This is the face of the Democrat party. Maxine Waters supporters burning flags during a rally in front of her campaign headquarters."}
{"text":"Lockheed Martin CEO pledges over $100M in workforce training"}
{"text":"SAVED FROM SOCIALISM: U.S. Saves Baby Oliver After U.K. Doctors Said …"}
{"text":"Tom Elliott says Lauren Southern shouldn’t have to pay for the bad behaviour of potential protesters"}
{"text":"Dickless Mueller grants the Samsquanch immunity"}
{"text":"What limits does Mueller’s power have? Can he grant DACA amnesty? Can he start indicting Trump voters? Can he block the AT&amp;T merger? Will he investigate all future presidents? HE WON’T STOP UNTIL HE’S SHUT DOWN."}
{"text":"Logical proof that Hillary Clinton never intended to fix Black America - Tony Montaga Stream"}
{"text":"Hispanic-majority Chile imposes tough new immigration measures. WTF, are Hispanics racist now? Or maybe they've woken up from the False Song of Globalism!!!"}
{"text":"President Trump reveals what was discussed in his closed meeting with Putin"}
{"text":"Even Cucked News Can't Deny - Is Trump The Toughest Ever On Russia?"}
{"text":"After 18 months in office, #Trump has shown that he’s going to be one of the great US presidents, if not the greatest. Making peace with Russia, neutralising North Korea, getting rid of the Iranian mullahs, and bringing jobs and prosperity to the US. But he’s a traitor, right?"}
{"text":"Wow"}
{"text":"“Even though Twitter and Facebook have been trying a lot of things to rein in the use of fake accounts and bots, we actually found 38 countries used bots last year, compared with 17 in the year before,” Howard said. - BUT MUH RUSSIA"}
{"text":"Ireland Hiring 1,000 Customs and Veterinary Inspectors for Hard Brexit"}
{"text":"Liberalism is an abusive relationship"}
{"text":"It's been awhile since I've seen this based law man on the front page! Show your love for the rule of law!"}
{"text":"Who didn’t see this coming miles away?"}
{"text":"Crazy Maxine Waters Supporters Look like Fucking Morons to “Counter Protest” Oath Keepers"}
{"text":"Timeline: What led to the Trump-Putin summit"}
{"text":"Ocasio-Cortez Claimed Unemployment is Low Because \"Everyone Has Two Jobs\", But the Facts Show the Exact Opposite - Multiple Jobs and Hours Worked Are at an All-Time Low. And That's Not Even How Unemployment is Measured. Remember Folks, She Has a College Degree in Economics LOL"}
{"text":"Winning"}
{"text":"Winning"}
{"text":"Rand Paul slams Senate bill as ‘Trump derangement syndrome,’ and blocks it"}
{"text":"Expert Hunter Catching Fish By Hand Without Catching Net"}
{"text":"Kid dies in Australia. Media post that he is a racist."}
{"text":"The Schizophrenia of the Democrat Party"}
{"text":"John Brennan, Melting Down and Covering Up"}
{"text":"“Gee, I wonder what the comments are going to be like...” *backs away slowly*"}
{"text":"Trump Keeps on Ticking"}
{"text":"Just a reminder that Reddit highly upvoted and even gilded this post of Al Franken"}
{"text":"Remember when Whoopi Goldberg showed up to an event with a Ted Danson boyfriend in blackface? I do. Out out out. No coat for you. Doing a heck of a job Goldi."}
{"text":"What Trump burned while laughing hysterically , that was found left over in the WH # Unhinged !!! John O . Brennan ."}
{"text":"NFL halts anthem rule after Dolphins take heat for considering suspensions of players who protest"}
{"text":"10-Year-Old Somali Girl Dies After Female Genital Mutilation"}
{"text":"For the People. Just not the ones that got in our way."}
{"text":"Betting $1 this is a tranny"}
{"text":"Video: Animation: How Russian Trolls Operate"}
{"text":"Cultural Enrichment Just Occurred in Lübeck, Germany"}
{"text":"Let's start a GOFUNDme to Bring 20,000 people from all over the world to vote in CALIFORNIA!!!"}
{"text":"NFL caved and backed off it's new policy requiring players to stand."}
{"text":"I love this community, and mods, but Mueller giving pedo Podesta immunity... I have 100% lost faith in sleepy man, change my mind, please."}
{"text":"Wow"}
{"text":"BERKISTAN: Berkeley High grad pleads guilty to helping ISIS, spoke of plan to kill 10,000 in Bay Area"}
{"text":"Stalin would be Proud ! # Unhinged John O. Brennan ."}
{"text":"Pirro: Whoopi Goldberg treated me ‘like a dog’ after argument"}
{"text":"The Pulse Night Club shooting occurred on June 28th 2016. Two years later the hate mongers over at the Southern Poverty Law Center finally acknowledge the truth."}
{"text":"Hundreds of refugees make camps in French public park after being evicted from local house"}
{"text":"The Blue Wave is HERE !!! HAHAHA Actually it's more like a trickle .... IMPEACH 45 !!! lol ."}
{"text":"The only ones undermining the elections are Democrats who continue to empower Putin and the Russians by manufacturing a false hacking scheme."}
{"text":"Banned from r\/nba after being stalked"}
{"text":"Just a reminder that Reddit highly up voted and even gilded this post of Al Franken"}
{"text":"WE DID IT PEDES! 101K SIGNATURES TO GET RID OF MAD MAX!"}
{"text":"I don't see this business taking off real quick, alot still won't leave like they said."}
{"text":"HE BROKE ME !!!!! # Unhinged ."}
{"text":"FISA Memo Released, on POTUS's Desk Right Now, Can be Made Public in 5 Days"}
{"text":"Breaking News: Iranian man is in custody folllowing a mass stabbing in northern German"}
{"text":"How quickly do you think this is going to be censored?"}
{"text":"Jihadi attack in Germany"}
{"text":"Coming up on CNN: Outrage"}
{"text":"The only ones undermining the elections are Democrats who continue to empower Putin and the Russians by manufacturing a false hacking scheme."}
{"text":"Finding: Reduction of Stop and Frisk directly correlates to increased violence in Chicago. Again."}
{"text":"Tell the truth."}
{"text":"Chiraq update: While BLM protests killing of an armed man who drew on police, other deaths are ignored. Police account for less than 1% of black shootings in Chiraq."}
{"text":"Trump Derangement​ Syndrome as shown on \"The View\""}
{"text":"Patrick Buchanan: Trump Stands His Ground on Putin - \"Trump is threatening the entire U.S. foreign policy establishment with what it fears most — irrelevance.\""}
{"text":"Early Sunday Gunday edition - because old school Star Wars + guns mix = Awesome!"}
{"text":"Montgomery minor league baseball team has a millennial night. Of course it out rages millenials as it does poke fun at them."}
{"text":"They are creating a Power Team that they believe will demolish President Trump's National Security. WE THE PEOPLE will have to be the ones to unite and put a stop this shit, because congress clearly will not."}
{"text":"The two biggest opponents of ICE in America today are the Democratic Party and MS-13!"}
{"text":"The left are arming themselves!!! KeK"}
{"text":"It might be me but it feels as though we have been flanked and the attack keeps coming ,now the federal reserve"}
{"text":"James Woods fillets Bernie Sanders."}
{"text":"BREAKING: 'Several wounded' in stabbing on German bus .. \"currently a major police deployment\""}
{"text":"Let's not speculate though... 🙄"}
{"text":"Just A Picrure Of Piece Of Shit"}
{"text":"There Is a Trade War but the US Didn't Start It"}
{"text":"FCC Rejects Sinclair's 11th Hour Plan to Merge with Tribune, Orders Merger to Administrative Law Judge for Hearings"}
{"text":"Lola Astanova - classical pianist, friends with Trump - he supported her Carnegie Debut in 2012! She’s an awesome pianist btw..."}
{"text":"NBC news pushing liberal agenda child abuse. Sad."}
{"text":"Is Trump The Toughest Ever On Russia? Npr"}
{"text":"SURE LIBS !!! Those Poor 'Separated Families' .... DHS Nielsen Tells Migrants They Cannot Leave Their Children in the U.S."}
{"text":"Whoopi Goldberg “joked” that pushover RINO Bob Dole be castrated in 1994 for opposing Bill Clinton. The Left has always been this way."}
{"text":"The Democrat Party Just Lost 400,000 Voters (#BlueFlush)"}
{"text":"I think his opinion may have changed lol TRUMPism Friday July 20"}
{"text":"The Trash Spills Over *+*+*(remember to Recycle)"}
{"text":"Hi, I’m Joy Reid. I posted homophobic rants and lied about being hacked. Roseanne or Tim Allen would have been shot, but I still have my own show on MSNBC. It pays to be a radical leftist."}
{"text":"“ **dies in liberal** ”"}
{"text":"Liberals be like..."}
{"text":"What a genius"}
{"text":"John Brennan is proud of fanning the flames of the Russian Collusion Conspiracy."}
{"text":"TFW you took the bullet for the #MeToo movement to protect the #PedoGate cabal but James Gunn ruined it for you with his tweets"}
{"text":"This is literally the latest cover of Time magazine. I'm not joking."}
{"text":"I know this a little bit of old news but President Trump is eliminating a very racist policy and it needs recognition. Trump Administration to Rescind Obama Guidelines on Race in College Admissions"}
{"text":"1 TFW you took the bullet for the #MeToo movement to protect the #PedoGate cabal but James Gunn ruined it for you with his tweets"}
{"text":"TFW you took the bullet for the #MeToo movement to protect the #PedoGate cabal but James Gunn ruined it with his tweets"}
{"text":"Poopi Goldberg, how's the view?"}
{"text":"Everyone Is Smart Except Trump - Great article, big truths!"}
{"text":"National Right to Work Foundation Demands SEIU Refund $100 Million to CA State Workers"}
{"text":"Trumps CNBC interview."}
{"text":"This is how the left and right break down on China. The left think the USA is 'unfair' to fight in a war that the right acknowledges has been raging for 2 decades. (RealClearPolitics)"}
{"text":"Knifeman 'wounds at least 14 people in rampage on bus in Germany'"}
{"text":"What Chinese Housing Bubble? Trump “the real estate developer” knows."}
{"text":"Indictment: Russians also tried to help Bernie Sanders, Jill Stein presidential campaigns"}
{"text":"With Democrats now running Socialist Candidates on a Democratic Socialist platform, with David Hogg leading other young socialists to disarm the country, and with Democrats now chanting USA! USA!, they have officially become Nadzis."}
{"text":"Sanctions law behind Putin’s request to Trump for former U.S. officials"}
{"text":"I think most people missed the significance of what this article was pointing out"}
{"text":"Anyone see Richard Sherman get in a heated argument with Judge Jeanine on the View yesterday?"}
{"text":"Hahaha, I guess if you by won you mean lose"}
{"text":"Inside WikiLeaks: Working with the Publisher that Changed the World"}
{"text":"The Very Unhinged John Brennan | Zero Hedge"}
{"text":"Mueller's chain of events that sent us into Iraq looking for WMDs that weren't there, after pushing false evidence from Colin Powell. He now puts us under threat of doing the same with Russia."}
{"text":"DNC is so broke their members are trying new ways to raise money"}
{"text":"How can a publishing company pay Obummer 65M for a one book so he can buy his 8M house? Here's who is behind the 5 big publishing houses. Want to really piss them off and never Buy a book again? Library card = free books and FREE downloadable books via (Abby\/Overdrive)."}
{"text":"Bahahaha- lib rag Guardian headline - Democrsts less inclined to cheat than Republicans. Guess they weren’t sampling Bill Clinton, Robert Menendez, Peter Strzok, Harvey Weinstein, etc, etc"}
{"text":"Ecuador to hand over Assange to UK ‘in coming weeks or days,’ own sources tell RT's editor-in chief"}
{"text":"FTC Operation Donate with Honor targets phony veterans charities"}
{"text":"There are only TWO logical conclusions one can draw from Trump’s stance globally."}
{"text":"Did you know the legal definition of a word is not the real definition? Mr. Trump's actions didn't meet the definition of treason, but it's still treasonous? The Trump Derangement Syndrome is real. I just found this highly upvoted comment on the front page."}
{"text":"Retired Four Star ⭐️ ⭐️ ⭐️ ⭐️ Teenage Girl..."}
{"text":"Welcome to Paris, my friends"}
{"text":"According to DC democrats, wanting to have better relationship with Russia and supporting President Trump equals \"acting as an unregistered agent\". More links inside."}
{"text":"WHOOPI is an insane Cu**....just saying. Don’t ever spit on our JUDGE JEANINE."}
{"text":"This is what happens when your platform is built on manufactured scandals and bad ideas that already failed. No refunds."}
{"text":"I just see a man standing in front of an old woman. What exactly is the problem here?"}
{"text":"Barack Obama doesn't Understand 'TWO SCOOPS' on a single 'Cone'"}
{"text":"Trump 'ready' to tax all Chinese imports - BBC News"}
{"text":"Before they were famous: Lisa Page"}
{"text":"LOL, the left is trying to MEME now"}
{"text":"As the Economy Booms, It’s Time for a Pledge to America’s Workers - I'm tearing up Pedes, this man loves America! #MAGA"}
{"text":"THANK YOU KENTUCKY!!!"}
{"text":"Rush Limbaugh laughs at Dems’ midterm motto favored by ‘personal injury law firm...lol"}
{"text":"Berkeley High grad pleads guilty to helping ISIS, spoke of plan to kill 10,000 in Bay Area"}
{"text":"New California State Flag"}
{"text":"Watch: Whoopie Loses her Shit in Under 5 Minutes on The View Talking to Judge Jeanine Pirro"}
{"text":"Timeline to Help you Redpill the Unbelievers"}
{"text":"Meanwhile in Europe..."}
{"text":"Just a reminder, if the IC releases a statement that undermines diplomacy efforts abroad that is called subversion. Our foreign policy is set by POTUS. It is not the IC’s role to influence public opinion away from supporting US foreign policy. The IC is out of control."}
{"text":"Occupy Democrats can’t meme so they outsource it"}
{"text":"Germany bus incident: At least 14 injured in suspected knife attack in Lubeck"}
{"text":"Germany bus Terror: At least 14 injured in suspected knife attack in Lubeck"}
{"text":"Thanks Time, Very Cool!"}
{"text":"Just wanted to remind everyone of literally the BEST video to come out after Trump's election. LITERALLY THE BEST! (Could be the next Rick-roll)"}
{"text":"ingenious"}
{"text":"This is what liberals count as \"humor\". And they wonder why the left can't meme!"}
{"text":"BREAKING: Maxine Waters supports and encourages USA flag burning. She asked protesters to show up and burn America"}
{"text":"THIS IS THE ENTITLED ILLEGAL ALIEN SCUM WE'RE UP AGAINST!"}
{"text":"Whenever I hear the fake news media say:"}
{"text":"Thank You Time, Very Cool!"}
{"text":"Next Level IQ"}
{"text":"Make America Manufacture Again!!"}
{"text":"ABSOLUTE MUST READ&gt; Who Is Betraying America?"}
{"text":"You guys are all fucking idiots"}
{"text":"Spy opperation of Natascha Bangsalot uncovered and nuclear armageddon. -Scott Adams."}
{"text":"Germany, reset that clock!..."}
{"text":"\"Up to 14 people have reportedly been injured in a knife attack in the northern German city of Luebek, local media reports. Police have confirmed the incident, adding that a large operation is underway.\""}
{"text":"Conspiracy theorists say stars with black eyes are part of ILLUMINATI | Daily Mail Online"}
{"text":"Anyone else wondering WHY THE FUCK this administration hasn't gone on the offensive yet? What are we waiting on? Fire these 2 ASAP."}
{"text":"Mr. President takes on the Fed! REPEAL THE FEDERAL RESERVE ACT"}
{"text":"The Tariffs China Actually Imposes on Every Country Including the US"}
{"text":"This is their False Flag!"}
{"text":"Peaceful refugee uses peace knife on peace bus to peacefully stab 14 people in peaceful Germany."}
{"text":"Saw a Trump hottie and looked through her comment history and posted a simple comment in a post she had in another sub I've never been in before. That got me banned in two other subs. Can someone explain if this is normal or some anti-Trump fuckery going on? Thanks, love you pedes!"}
{"text":"The Left’s new dirty tactic: staging fake racist situations (mysteriously perfectly on camera) then publishing daily articles on them to fan the flames of fake news."}
{"text":"Make liberals cry again!!"}
{"text":"The Moment When Theresa May Finally Understands Trump"}
{"text":"LEGAL 2A stops shooter on a killing spree, suspect dead."}
{"text":"Mossad said to have thwarted Iranian plot to bomb opposition rally in France"}
{"text":"SHITHOLE SEATTLE - ANOTHER MAGA HAT TEEN ATTACKED: While walking down street, being verbally abused by several people, Green Haired “Non-Binary” Leftist Assaults Teen President Trump Supporter For Wearing MAGA Hat"}
{"text":"THIS is the shit that We The People need to be putting a stop to and I mean right now! Why the hell are We The People so complacent and lack conviction?!?!"}
{"text":"Maxine Waters backers burn stolen American flag"}
{"text":"\"Attack the Right\": The EU is Fighting Israel's Government through Israeli NGO's"}
{"text":"POOPi Goldberg. Oracle of the Liberal C*nt Society."}
{"text":"Based James Woods: Soap-on-a-rope!"}
{"text":"I wrote a little bit of Civil War fiction about what it might be like if the Commies ever took up arms against Trump voters. Thoughts?"}
{"text":"Roseanne explains the Valerie Jarrett tweet"}
{"text":"FBI Director Warns China is America's Most Significant Intelligence Threat"}
{"text":"SHITHOLE SEATTLE - ANOTHER MAGA HAT TEEN ATTACKED: While walking down street, being verbally abused by several people, Green Haired “Non-Binary” Leftist Assaults Teen President Trump Supporter For Wearing MAGA Hat"}
{"text":"Should We Petition The White House to Fire Sleepy Jeff?"}
{"text":"1 former NYPD\/SS agent, and 1 former C_A agent, both highly respected, both publicly agree that the Mueller probe is an abomination and a total scam. Please wake up America."}
{"text":"MUH Russia... Always a Good Rewatch!"}
{"text":"With the midterms just around the corner, I feel a very sharp and sudden uptick in this kind of \"journalism\""}
{"text":"... So what would their explanation be?"}
{"text":"James Gunn tries to defend himself on 4chan"}
{"text":"Maxine Waters supporters burn American flag outside California rep's office"}
{"text":"Hey European Space agency is looking for a name of their Mars Rover.... Can T_D help?"}
{"text":"Scott Adams Reveals Trump's reasoning and strategy on Russia!! - The Potential Good News About Russia - This is a must watch to fully understand what's happening and to redpill others, 'pedes! Schedule 30 minutes this weekend to watch it!"}
{"text":"Some light trolling last night and this morning yielded some nice gems. TREEEEEEEASON"}
{"text":"FLASHBACK FRIDAY: Huffington Post shares that 538 election forecasting statisticians should be fired, that Clinton’s possibility of winning should be closer to 99% while 538 was reporting 65%"}
{"text":"And his name was Barack Obama"}
{"text":"A Marines Letter To The NFL"}
{"text":"Germany bus Terror: At least 14 injured in suspected knife attack in Lubeck"}
{"text":"Why wasn't this in the Hamilton play?"}
{"text":"Ecuador to hand over Assange to UK ‘in coming weeks or days,’ own sources tell RT's editor-in chief"}
{"text":"\"When They Go Low, We Go High\" - Mike Obama"}
{"text":"Ecuador to hand over Assange to UK ‘in coming weeks or days,’ own sources tell RT's editor-in chief — RT World News"}
{"text":"No one to really tell: I have applied to 200 jobs... gotta keep going."}
{"text":"German and Croatia"}
{"text":"Angela Merkel defends Trump's plan to have Putin at the White House"}
{"text":"Pedo hollywooder James Gunn actually goes on to 4chan to defend himself, gets caught saying me (Freudian slip), and has also deleted his post on 4 chan trying to defend himself. You can't make this up!"}
{"text":"The Rats are Jumping Ship"}
{"text":"Paramount TV chief fired over inappropriate comments"}
{"text":"Ecuador to hand over Assange to UK ‘in coming weeks or days’"}
{"text":"Brennan and the 2016 Spy Scandal"}
{"text":"[ BREAKING ] --- \"Ecuador to hand over Assange to UK in coming weeks or days\""}
{"text":"Democrat Foreign Policy 2018 (colorized)"}
{"text":"HAHAHAHAHAHAHAHAHA!!!!!"}
{"text":"So let me get this straight: DOJ can't make a case against Manafort without the Super Dem Podesta Bros and then use the Podestas to throw Manafort into solitary confinement via \"witness tampering\"? Sounds legit!"}
{"text":"George Soros: The Beast Slain?"}
{"text":"DISNEY WILL CENSOR FOX NEWS! Liberal Media Takeover!"}
{"text":"USA Today Drops Columnist Cheri Jacobus After Tweet About Convicted Pedophile Jeffrey Epstein. 🤣"}
{"text":"For a laugh you can watch pedophile James Gun deleting his tweets in real time!"}
{"text":"Donald Trump creates new workers’ council to promote job retraining - MAGA"}
{"text":"What democrats taught l me: Everyone who doubted the Benghazi investigation was committing treason"}
{"text":"Muslim converts to Pope Francis: ‘If Islam is a good religion…as you seem to teach, why did we become Catholic?"}
{"text":"Liberalism scientifically proven to be a virus!"}
{"text":"Trade wars and game theory"}
{"text":"@SecPompeo is the MAN!!"}
{"text":"Father of 2 Parkland shooting survivors slain after store robbery"}
{"text":"Kimberly Guilfoyle out at Fox News per Donald Trump Jr.'s spokesperson. She'll be focusing her efforts in campaigning with Donald Trump Jr. on the trail instead. Next question for Fox News fans: Who replaces her on The Five? And does she return after the midterms? Stay tuned"}
{"text":"DNC’s latest (bad) plan, which is really the exact same as their previous plan: “pander to the black women demographic more”"}
{"text":"They really just have no idea \"name one lie the media has told about the President\""}
{"text":"Ahhhh turns out this species is extinct!"}
{"text":"History Explains Eastern European Hostility to Islam"}
{"text":"Roseanne Barr: \" I thought the bitch was white\"."}
{"text":"So let me get this straight: DOJ can't make a case against Manafort without the Super Dem Podesta Bros and then use the Podestas to throw Manafort into solitary confinement via \"witness tampering\"? Sounds legit!"}
{"text":"Remember the FISA Memo: Full Text"}
{"text":"“I was amazed. I really was. I didn’t say anything to anybody. I just watched-the Republicans were out there-they were having a great time. They were laughing, they were waving the American flag, they were egging them on, and I thought that was outrageous behavior. I really did.” - Mad Maxine Waters"}
{"text":"Democrats and Fake Media devise sinister Trump Derangement Syndrome weapon!"}
{"text":"The dead narrative."}
{"text":"YouTube is now pushing mainstream media channels like CNN in all news-related searches in an attempt to suppress the alternative media channels that made the site so special."}
{"text":"Tucker: Former CIA director John Brennan still has top security access and has history of dishonesty and is now a partisan talking head for a cable news network. Brennan is not alone, and Sen. Rand Paul finds this 'alarming.'"}
{"text":"Smh"}
{"text":"Asian American vs. Asian British. Who has the BEST ASIANs pedes ? :D"}
{"text":"LEAKED FOOTAGE: Antifa Training Camp"}
{"text":"Russia Russia Russia"}
{"text":"MSNBC \"Debunks\" #QAnon &amp;amp; Pizza \"Conspiracy Theory, Nonsence\""}
{"text":"If Mueller was in charge of the Iraq war"}
{"text":"Asian American vs. Asian British"}
{"text":"Magnitsky act, behind the scenes. This documentary is hard to find on the net."}
{"text":"Pedes: We Must Stop Jeff Sessions before our country is destroyed. Sign Petition to Remove Jeff Sessions as U.S. Attorney General"}
{"text":"McConnell issues Supreme Court ultimatum--McConnell showing some stones, where has this side been hiding Mitch?"}
{"text":"Google is working to suppress ideas they dislike. That means Conservatives, and they wont stop until you're gone."}
{"text":"UK: Rape and domestic violence victims at risk as police fail to record crimes"}
{"text":"They try to make anti-Trump memes and end up making him look like a badass in every one. I call this \"I'm not playing your fucking games anymore.\""}
{"text":"Whompie, the Face of TDS."}
{"text":"This is great"}
{"text":"Tony Podesta INSIDER TRADING pharmacy stocks email EVIDENCE !!! why is this swamp crook off the hook? what trades did he make on the info being passed to him from his brother? who else was he giving this info to!?"}
{"text":"Roseanne Barr on Valerie Jarrett tweet: ‘I thought the b#tch was white’"}
{"text":"when did the intellectual zombie apocalypse begin?"}
{"text":"Ever notice that all the trump haters are sexual deviants and pedophiles?"}
{"text":"Christian Woman Has Baby At Chick-Fil-A. Husband Uses Trump Shirt For Towel For Baby."}
{"text":"Democratic policies have left minorities so dumb and poor they cannot even get to the DMV to buy an ID #WalkAway"}
{"text":"Michael Savage: 'You're Asleep' if You Think Communism Can't Happen in U.S."}
{"text":"Hundreds of years of tradition broken, so a feminist can seek attention..."}
{"text":"Rep Morgan Griffith, VA: Trump is playing 3D chess and no one can know the scope of his tactics off a single press conference."}
{"text":"Roseanne Barr On Valerie Jarrett Tweet: ‘I Thought The B**** Was White!’"}
{"text":"Asian American vs. Asian British"}
{"text":"卍 We 卍 found 卍 a 卍 loophole 卍"}
{"text":"High energy folks! This is why people for Donald Trump."}
{"text":"Donald Trump: China and European Union ‘Manipulating Their Currencies’"}
{"text":"Someone explain THIS to me *+*+*+*+*+*"}
{"text":"High energy folks! This is why people voted for Donald Trump."}
{"text":"Ooooookaaayyyy?"}
{"text":"Congratulations Germany!! You won the diversity lottery.....again!!! Frau Merkel, please come forward to accept your award!"}
{"text":"Rand paul destroys communist voter John Brennan for being a partisan, bigoted unelected hack."}
{"text":"Melanija Knavs, 16 just dreaming about being the best FLOTUS the world has ever seen"}
{"text":"The disingenuous CNN folks a “Republican”. Hurd “I never endorsed Donald Trump, and I cannot in good conscience support or vote for a man who degrades women, insults minorities, and has no clear path to keep our country safe. He should step aside for a true conservative to defeat Hillary Clinton.\""}
{"text":"You remember what happens to people who flip on me, right?"}
{"text":"FBI’s National Security Branch Chief Abruptly Quits; Assistant Director Ghattas Described as McCabe’s “Right Hand Man”"}
{"text":"\"The American people will never knowingly adopt socialism.\" — I wonder if that's true anymore..."}
{"text":"Podesta Insider Trading Evidence --- but Manafort is being charged with 'financial crimes'"}
{"text":"No, Mark Zuckerberg Isn't a Free Speech Fan for Refusing to Ban People for Ideology"}
{"text":"Lmao GEOTUS retweeted his Crooked Hillary tweet"}
{"text":"Yet Another Case of TDS"}
{"text":"This thing is bragging about assaulting a 17 year old Trump supporter! These people are insane."}
{"text":"Liberals are walking a dangerous line. This petition could have adverse effects not anticipated."}
{"text":"Reddit showed me a Democrat subreddit. First post is them complaining about voter ID memes. First comment is them admitting Republicans start winning when you have to be legal to vote."}
{"text":"The solution to achieve cheaper healthcare is alternative providers. Not alternative medicine, but alternative providers not locked into the highly controlled AMA and educational and big pharma and Hospital systems. Allow AI medicine to go around those legacy providers instead of through them."}
{"text":"Did you know that Robert Mueller was the head of the FBI during the terrorist attacks of 9\/11?"}
{"text":"They say the Blue Wave ain't over until the Fat Liberals Sing..."}
{"text":"Democrats Have Already Jumped the Shark on Judge Kavanaugh"}
{"text":"Irish government trying to clampdown free speech on social media"}
{"text":"Disney Director James Gunn Exposed: Disturbing History of Child Rape 'Jokes' (Disney Owns Marvel and ABC, Will They Fire Him Like They Did Roseanne?)"}
{"text":"So many fucked up things to investigate Skippy and his brother for... link your favorite thing about the Podestas in the comments. I’ll start..."}
{"text":"TEXTBOOK CASE OF TRUMP DERANGEMENT SYNDROME"}
{"text":"WATCH: Antifa Tries To Attack Activist Lauren Southern, Gets Clobbered By Security Instead"}
{"text":"liev schreiber is another creep."}
{"text":"Proud Boy 🇺🇸Rufio Panman 🇺🇸 Interview"}
{"text":"Loophole"}
{"text":"Reddit default sub mods save the day again from dangerous wrong think"}
{"text":"New W.Va. Poll: if Manchin (Dem Senator) votes to confirm Kavanaugh he wins selection easily. If he votes against the race is tied"}
{"text":"Whoopi Goldberg Gets Into a Screaming Match with Fox News' Judge Jeanine Pirro on The View"}
{"text":"McCabe’s FBI right hand man resigns."}
{"text":"For Some It is Not So Easy..."}
{"text":"May Exposed: Barnier Confirms Chequers Brexit Plan Leaves EU Court in Control"}
{"text":"SO BRAVE!"}
{"text":"https:\/\/www.archives.gov\/federal-register\/electoral-college\/about.html"}
{"text":"They Got him! Authorities have arrested a 14 y\/o for the destruction of a memorial in New York For Navy seal and Medal of honor winner Lt. Michael P. Murphy, who gave his life for this country in 2005. Governer Cuomo said on Friday that the state will cover the repairs. See previous Post for details"}
{"text":"One of my favorite deep cuts. Remember when a Muslim terrorist shot up a gay night club and University of Missouri students showed up to protest the vigil because it didn't prioritize BLM?"}
{"text":"Jim “Just Business” Mattis."}
{"text":"New Ben Garrison. Fourth in the Drain the Swamp Series"}
{"text":"Video report: Knife crime on the rise in London"}
{"text":"So funny opening the front page and seeing trending posts from the Mueller"}
{"text":"McDonald's eliminating cashiers in all US stores. So much for that $15 an hour wage hike...."}
{"text":"German bus attack: 'Bloodbath' in Luebeck after at least 14 injured in knife attack - Part and Parcel Edition"}
{"text":"President Trump's poll numbers have gone up in the days after the Putin summit."}
{"text":"Rand Paul blocks Sanders's Russia resolution, calls it 'crazy hatred' against Trump"}
{"text":"Breaking News: Insurance Underwriters for ABC Now Requiring a Zookeeper With Tranquilizer Gun Standby During Tapings of \"The View\""}
{"text":"Italy threatens to block ships from EU's Mediterranean migrant mission"}
{"text":"If you had it to do all over again, whom would you vote for? Obama or McCain?"}
{"text":"A question was asked if a best man can start a speech with \"welcome back\" in his buddies second wedding. Found this comment and just couldn't reeeeeesist."}
{"text":"Guccifer 2.0 Had Claimed That Seth Rich Was His Source"}
{"text":"Chance, whose real name is Chancelor Bennett, is the son of a Democratic political aid who worked for future president Barack Obama. B-b-but I thought he “struggled” they always leave this out from his “hometown” articles 🤔"}
{"text":"Never change, Democrats. Never change"}
{"text":"Tiffany Appreciation Day!!!"}
{"text":"Breaking! China has decided to procure its petrochemical needs from Saudi Arabia, ending such imports from Iran"}
{"text":"Kenneth Vogel from NYT tweets out a disgusting cartoon about Trump"}
{"text":"Time Machine: If you had it to do all over again, what would you do?"}
{"text":"When you realize “free market” America has a central bank and the President we elected can’t stop its rate hikes"}
{"text":"Three top FBI officials quit as US cybersecurity threats mount The mass exodus has been labeled \"highly unusual\"."}
{"text":"Incumbent first elected in 1974 says he's been in office about 25 years, time for #TermLimits! Vote for Trump Republican Spencer Zimmerman August 14th Wisconsin!"}
{"text":"Hollywood continues to devour it's own in the name of political correctness: Alyssa Milano Combats 'Fat Shaming' Backlash Over 'Insatiable': 'We Are Addressing the Damage'"}
{"text":"How miserable can you be?"}
{"text":"“I had some of these fools from the media saying, ‘Why didn’t you stand there, look him in the face, walk over to him and start shouting at him?’ I said, ‘Are these people crazy? I want to make a deal.’”"}
{"text":"I just realized the common ground of Republicans and Democrats."}
{"text":"'Open Borders Is Not a Winning Policy': 18 Dems Break Party Lines to Support ICE"}
{"text":"Electoral College worked precisely as intended: prevented Hillary Clinton’s 6-million-vote victory in CA and NY from cancelling her 3-million-vote loss in 48 states"}
{"text":"It’s been awhile since our 45th president has made it to the front page. Let’s get him there!"}
{"text":"They're fooling fewer people by the day."}
{"text":"This breaks the r\/politics."}
{"text":"#LibtardQuiz: Which event was more triggering?"}
{"text":"Illegal aliens voting in our elections should be considered election meddling by the countries those aliens are from, looking at you Mexico; the easiest way to solve this would be consequences, such as sanctions, for those same countries."}
{"text":"Everyone is smart except Donald J. Trump. That’s why they all are billionaires and all got elected President. Only Trump does not know what he is doing. Only Trump does not know how to negotiate with Vladimir Putin. Anderson Cooper knows how to stand up to Putin. All the journalists do."}
{"text":"Incumbent first elected in 1974 says he's been in office about 25 years... do the math... is it still 1999? Time for term limits Wisconsin! Vote for Trump Republican Spencer Zimmerman August 14th!"}
{"text":"Made a vector image of Trump, hope this sun likes!"}
{"text":"Facebook is literally a danger to herself and others at this point."}
{"text":"If Whoopi was invited on Hannity.........."}
{"text":"This article has been posted, copy pasted, but doesn't seem to have gotten much traction on T_D. Perfect summation of the left's implosion."}
{"text":"Yesterday, the \"abolish ICE\" protest in my town had to be shut down by police citing issues with their handling of human waste. They were becoming a public health concern. Gross."}
{"text":"Why does Reddit allow most of the political subs on here to be libtard shitholes? Fucking cucks, modthesenuts."}
{"text":"[THE VIEW] Imagine if Meghan McCain treated, say, Rachel Maddow the way Whoopie treated Judge Jeanine?"}
{"text":"How to Fight Back against the Resistance - we should pick a day and every single one of wears our MAGA hats and Trump shirts. Overwhelm them with our numbers."}
{"text":"\"cyber 9\/11\" is in the works, don't you dare disrespect our intelligence community!"}
{"text":"With their embrace of Democratic Socialism they are now officially the Nadzi Party."}
{"text":"Loophole Spotted"}
{"text":"Just think: If we all vote Democrat we can live in literal shitholes like San Francisco."}
{"text":"Vladimir Putin should make a stop at San Francisco to register as a \"non-citizen voter\" to appease the Democrats"}
{"text":"Kys pls"}
{"text":"More Trump Derangement Syndrome! DC commissioners attempting to revoke Trump Hotel liquor license on \"Morals\" grounds! These people are INSANE! This nonsense has got to stop!"}
{"text":"The Lone Star State leads the nation in job creation over the year. Texas added 27,200 new jobs in June for 24 consecutive months of job growth. #TexasBests"}
{"text":"Teen arrested after memorial honoring hero Navy SEAL vandalized"}
{"text":"Someone is gonna get the curse soon...."}
{"text":"Netflix show about \"teen who's bullied, loses weight, becomes hot &amp; attractive and decides to get revenge on he tormentors\"......is considered fat shaming. You can't win."}
{"text":"Good Point, Well Made"}
{"text":"Ben Garrison is always on point #DeepStateHydra"}
{"text":"HEY DEMOCRATS, I just found a solution for you to beat Russian meddling!!! Surely this will finish Drumpf!!"}
{"text":"Wish List Item"}
{"text":"I know too much."}
{"text":"Oh Brother! Here Comes the Next Media Hysteria. Michael Cohen Secretly Taped Trump Discussing Payment to Playboy Model"}
{"text":"❌❌❌❌FOLLOW THE MONEY 💰 💰 💰 ALWAYS RULE NUMBER ONE❌❌❌ Allow me to walk you through some oddness with Ken Bensinger, Fusion GPS and Orbis Business Intelligence. 2:21 AM · Jul 18, 2018"}
{"text":"Someone is gonna get the curse soon..."}
{"text":"#ImWithHer #LetHerRun #Future3TimeLoser #KeepAmericaGreat"}
{"text":"Probably a repost but saw this on the 4chan sub. Lol."}
{"text":"Where are the hats made?"}
{"text":"This is the future"}
{"text":"Trump Curse Strikes Again!!! Buh Bye Cheri Jacobus"}
{"text":"Good Point, Well Made"}
{"text":"New \"racist\" Pokémon episode banned... Ash was imitating a Passimian and NOT a person of color..."}
{"text":"Obama Praises White Genocide South African Government"}
{"text":"Your Semi-Daily T_D Update on the Current State of the Mueller Investigation."}
{"text":"How has Online Gaming Communities changed over the years?"}
{"text":"James Gunn and Mark Hamil"}
{"text":"I just want the BS to end!!"}
{"text":"Friday Midday MAGAthread! - 07\/20\/2018 - President Trump Trolls the Media with Putin Invite."}
{"text":"Socialism"}
{"text":"Balloons"}
{"text":"The Resistance's Displacement-Projection Syndrome"}
{"text":"James Gunn's birthday cake.."}
{"text":"Just got back from Melbourne Lauren and Stefan."}
{"text":"Sens. Rubio and Scott tanked Trump nominee for criticizing multi-culti PC in college. They’re ridiculous."}
{"text":"WILL DISNEY\/MARVEL FIRE JAMES GUNN FOR PEDOPHILIA COMMENTS? THEY BETTER.. THEY FIRED ROSEANNE FOR MUCH LESS!"}
{"text":"Gallup recently did a poll of what Americans say is the most important problem facing the country. One finding: the percentage of Americans saying “Situation with Russia” is the most important problem is literally too small to represent with a number."}
{"text":"The \"Swampstablisment' Opens New Restaurant in D.C."}
{"text":"Jimmy Comet's instagram revealed alot before he made it private."}
{"text":"Ecuador Reportedly Preparing To Hand Assange To UK In \"Coming Weeks Or Days\""}
{"text":"How are things gonna play out in the US when they really try impeach Trump?"}
{"text":"Lol suck it Dem cocksuckers"}
{"text":"I wonder who could do such a thing; surely the peaceful, tolerant, America loving Liberals would never do such a thing"}
{"text":"MSNBC Front-Running QAnon and Pizzagate? Tries To Debunk The Two Popular 'Conspiracy Theories'."}
{"text":"Obama Praises South Africa's White Genocide Government"}
{"text":"Yuuuuuge: Kimberly Guilfoyle leaving Fox News to campaign with Donald Trump Jr."}
{"text":"We have the best neighbors, don't we folks?"}
{"text":"OW MY SIDES. AHAHHAHA. DNC Steals new slogan from Ontario Canada's Progressive Conservative party. AHAHHAHAHA."}
{"text":"They hate us because they ain't us."}
{"text":"FBI has ‘tape’ of Trump talking Playboy model payoff with Cohen -- Does anybody think this is OK? That the FBI can raid your lawyer's office and then leak private info to the press?"}
{"text":"The Babylon Bee Has the Best Satires, Doesn't It Folks? \"Ben Shapiro Responds to Question So Rapidly That Audience Members Start Bidding\" HAHAHA"}
{"text":"THIEF PODESTA INSIDER TRADING... yet manafort is guilty of financial crimes??"}
{"text":"Search the following on duckduckgo images: Jimmy Gunn Comet Ping Pong. For some reason this brings up the worst results."}
{"text":"Deep State Hydra Attacks- Weaponized Ben Garrison Cartoon"}
{"text":"Dorcas Fixed It."}
{"text":"The MSM and the Deep State Lose Their Minds in Helsinki - Coach &amp; Benway Podcast"}
{"text":"Vice btfo"}
{"text":"LIBERAL VALUES ??? 'WE The People' ain't a gonna decide My Morality !!!"}
{"text":"MAGA Baby delivered in Chik-Fil-A bathroom, swaddled in Trump 2020 t-shirt"}
{"text":"The left's idea of a meme is just out right begging for upvotes."}
{"text":"Made a song nearly 10 years ago - FREE MONEY. [2:51]"}
{"text":"7 new images added to the ol' Fake News folder"}
{"text":"New Jersey state senator fears 'sex toy oils with marijuana' after pot is legal"}
{"text":"According to the Treasury Department's monthly statement, our government collected a record $1.305 trillion in individual income taxes through the first nine months of fiscal 2018. Washington still ran a deficit of $607 billion over the same nine months. SPENDING IS THE PROBLEM!"}
{"text":"Rand Paul stands by Trump because both defy the foreign policy establishment"}
{"text":"Mad Maxine &amp; Unhinged Demorcats Support Violence... Occupy Movement Is Rebranded As ANTIFA!!!"}
{"text":"Marine Vet Looks to Defeat Establishment Republican in Wis. Senate Primary"}
{"text":"Black lives matter mob attacks reporter because he is white, yes for real"}
{"text":"Tucker: Why Do 'Reckless Partisans' Like John Brennan Still Have Top-Secret Security Clearances?"}
{"text":"When I hear that Mueller gave Podesta immunity to testify"}
{"text":"McCarthy - Keep An Open Mind Or Else (ANTIFA Prophecy?)"}
{"text":"Left-wing media is the same everywhere in the world. Here's their reaction to India cracking down on illegals"}
{"text":"My family received back this totally wonderful letter from OUR GREATEST EVER President DONALD TRUMP!!!"}
{"text":"PIERS: Trump might not be mad or a blackmail victim, he might just be RIGHT about Russia. Piers has some pretty profound things to say here kids, it's worth a read. Even if it is the Daily Fail."}
{"text":"Lisa Page revealed under oath that there was no basis for Mueller's appointment"}
{"text":"\"If the freedom of speech is taken away then dumb and silent we may be led, like sheep to the slaughter.\" - George Washington"}
{"text":"14 Injured, Some Seriously in Mass-Stabbing on German Bus | Breitbart"}
{"text":"The Rise of Alt Tech ft. Youtube's Encyclopedia Thing"}
{"text":"The Government Fears REAL NEWS. The Deep State is Real, and Assange is the Biggest Threat to it's Existence. They Will Stop at No Distance to Preserve Their Corruption! #FreeAssange"}
{"text":"THEYRE BACK TO STORMY DANIELS FOLKS. Still awaiting her comments from Ohio Jail"}
{"text":"Time for a religious message from Ms. Ocasio-Cortez"}
{"text":"The Bias of Peter Strzok (July 20, 2018)"}
{"text":"I just want the BS to end! NYT: Michael Cohen secretly taped Donald Trump in 2016"}
{"text":"Every time the Fake News Media targets Trump with another boring \"scandal\""}
{"text":"Who here is celebrating when GDP hits 4%?!"}
{"text":"Twitter Bans Legendary Troll Godfrey Elfwick for Ridiculing Leftists"}
{"text":"Welp...looks like \"Muh Russia\" cycle didn't stick (again)...I guess the DNC is using the old \"Misogynist\" attack (again)...Whatever will we do (again)?"}
{"text":"President Donald Trump: China and European Union ‘Manipulating Their Currencies’"}
{"text":"From McCain to Brennan, Deep State soft coup against Trump picks up steam"}
{"text":"Dem Candidate Donated Millions to Groups That Advocate Taxing Families for 'Irresponsible Breeding' You PA Pedes Know What To Do...Look At Republican Incumbent Rep. Brian Fitzpatrick In Pennsylvania's 1st Congressional District"}
{"text":"The President of the United States seriously considered sending Americans to Russia so they could be interrogated about phony crimes by the KGB. That is unacceptable."}
{"text":"Best strategy"}
{"text":"Nazi-Themed Wrestler Under Investigation By School Where He Teaches"}
{"text":"Feminism in Action: Wamenz loving snail trails and welcome mats! (Sugartits guest video)"}
{"text":"The tale of 2 Asians"}
{"text":"When your political ideology promotes paying a living wage to burger flippers but you pay someone significantly less that has skills."}
{"text":"SICK: Judge Jeanine Says Whoopi SPIT On Her, Said 'Get The F**k Out' After Heated Segment"}
{"text":"This is not \"LOCK HER UP\" its the exact opposite and we all want \"LOCK HER UP\". Something fishy is happening."}
{"text":"Instagram Censors Conservatives, But This Trump Lynching T-Shirt Is Totally OK"}
{"text":"Don't Let The TDS Victims Get U Down #\/LionStrong"}
{"text":"Hi I’m Doug. As a centrist, this sub is the only place I’m welcomed on Reddit"}
{"text":"Found a loophole"}
{"text":"Cancer fundraising march mistaken for neo-Nazi rally; dozens injured"}
{"text":"Trump means Triumph"}
{"text":"MEET KEVIN - Nicholson for Senate"}
{"text":"Judge Jeanine Pirro! The based woman who wrote a book and broke The View!"}
{"text":"Fake news CNN has graphic orgasm as discovery of playa Trump is well hung."}
{"text":"Just A Heads-Up On What The Nothing Burger TDS Media Will Be Harping About: \"Michael Cohen Secretly Taped Trump Discussing Playboy Model Payoff\""}
{"text":"HOLLYWOOD ELITE LIBERAL DARLING LLOYD KAUFMAN ADMITS TO PEDOPHILIA AND IMPLICATES DISNEY DIRECTOR IN THE PROCESS. THIS TWEET FROM 2010 PUTS BIEBER’S AGE AT 16 YEARS OLD."}
{"text":"'Open Borders Is Not a Winning Policy': 18 Dems Break Party Lines to Support ICE"}
{"text":"Left's Best Strategy? Spam Text Messages"}
{"text":"Liberal 9th Circuit surprises with pro-2nd Amendment decision blocking California ammo ban"}
{"text":"I have been a lifelong Dolphins fan and I fully support their new rule to enforce everyone to stand during the anthem. Wondering how y'all feel about this? Do you think the rest of the NFL should follow in their footsteps?"}
{"text":"Lena Dunham Reports Flight Attendants for Saying 'Transness Is Gross'"}
{"text":"An Open Letter To John Brennan From A Former CIA Operative : SIR, STOP PRETENDING..."}
{"text":"Will a Sadiq Khan balloon be allowed to fly to counter-protest the Baby Trump stunt?"}
{"text":"Disney Director James Gunn about video with \"100 Pubescent Girls\": \"I just came all over my own face!\""}
{"text":"Trump Voters Give Birth to Baby in Chick Fil A"}
{"text":"Great News FBI Chief Threatens To Quit If Trump Invites Russian Agents To US (VIDEO) – True Pundit"}
{"text":"THEY NEVER LEARN"}
{"text":"Who did this?"}
{"text":"Panicked Democrats Invoke Obscure House Rule to Force Action on Mueller Protection Bill"}
{"text":"Suspect charged with sex trafficking after woman says she was 'forced to participate as a prostitute' in Myrtle Beach"}
{"text":"BREAKING: President Trump Recognizes The Preborn Have A Right To Life In New Statement"}
{"text":"But it's O.K. to throttle Conservative content? Assholes! Randi Zuckerberg defends brother's decision on Holocaust denier posts. Yep you guys are all about the 1st Amendment."}
{"text":"DISNEY FIRES ROSANNE FOR HAVING “INCONSISTENT VIEWS”. DISNEY HAPPY EMPLOYS DIRECTOR AND PEDOPHILE JAMES GUNN WHO OPENLY BRAGS ON TWITTER TO MOLESTING CHILDREN. HEY DISNEY, TELLS US MORE ABOUT YOUR “VIEWS”!"}
{"text":"Deep State is the real life equivalent of \"HYDRA\". Having learned from NAZISM that overt force cannot achieve world domination, they are subversive operatives within our governments pursuing similar goals. We demand more be done to route Deep State Mr. President."}
{"text":"Ancestry.com report for Hillary Clinton"}
{"text":"Gloria Alvarez - Socialism Doesn't Work"}
{"text":"ANTIFA tried to rush Lauren Southern on stage. Gets BTFO by security and then rants like a nut."}
{"text":"What difference, at this point, does it make???"}
{"text":"Trifecta: Baby born in Chic-Fil-A bathroom swaddled in Trump 2020 shirt! ( We’ve got the best parents don’t we folks! )"}
{"text":"Trump does it right"}
{"text":"SJW Mob eats their own..."}
{"text":"New Jersey (D) state senator fears 'sex toy oils with marijuana' after pot is legal"}
{"text":"Brutal Communist Dictator catches weak US President. Media fawns"}
{"text":"Night of the Living Dead (remake)"}
{"text":"Ladies and Gentlemen, it has been an honor serving with you all, but this is finally the end of our campaign"}
{"text":"James Gunn has a pedo smile"}
{"text":"DISNEY FIRED ROSANNE FOR HAVING “INCONSISTENT VIEWS”. DISNEY HAPPILY EMPLOYS A PEDOPHILE DIRECTOR WHO OPENLY BRAGS ABOUT LITTLE BOYS. TELL US MORE ABOUT YOUR “VIEWS” DISNEY!"}
{"text":"Donald trump has a smell pee pee"}
{"text":"Retired Navy Petty Officer Generald Wilson sings 'God Bless America' [2013] -- USA!! USA!! USA!!"}
{"text":"Just A Picture Of A Piece Of Shit"}
{"text":"My response when I log into T_D and see the shills are downvoting..."}
{"text":"So ... Y'all Wanna Play The Balloon Game ???"}
{"text":"Lmao SJW support group skit... did BBC actually make this?"}
{"text":"TDS James Gunn Everyone, This is NOT Normal!!!"}
{"text":"The Constitutional Crisis of Rejecting Election Losses. Democrats always deem as illegitimate those who defeat them. This is nothing new."}
{"text":"The perfect loophole"}
{"text":"I just can't get over people on the Left defending this sick F$#@!"}
{"text":"Just a picture of a guy saluting our flag. Happy Neil and Buzz Day!"}
{"text":"Hillary wouldn't come up with this"}
{"text":"HOLLYWOOD ELITE LIBERAL DARLING LLOYD KAUFMAN THANKS PEDOPHILE DISNEY DIRECTOR FOR NOT OUTING HIM AT THE 2010 PEDOPHILE CONVENTION"}
{"text":"Liars, Leakers, and Liberals becomes a #1 best seller on Amazon"}
{"text":"TIL MS-13 originated in Los Angeles in the 1980s. It was formed by refugees from El Salvador who fled to the United States. BUILD. THAT. WALL."}
{"text":"Trump: 'The Point Of A Trade War Isn't Who Wins Or Loses—It's Having A Good Time.' (SATIRE)"}
{"text":"FITTON:Clinton crony Podesta getting immunity to testify against Manafort? Outrageous. Judicial Watch found docs showing Podesta Group worked Clinton State Dept!"}
{"text":"About 98% of women and girls in the Horn of Africa nation undergo female genital mutilation, according to the United Nations. While Somalia’s constitution prohibits the practice, Mohamed said no laws have been enacted to ensure that those who perform the circumcisions are punished. #OPENBORDERS 🆘🆘"}
{"text":"Benghazi Hero Kris Paronto Goes NUCLEAR on Crooked Hillary After She Accuses Trump WH of Not Defending Ambassador"}
{"text":"MSNBC Wants #Qanon \"Conspiracy Theory\" BANNED"}
{"text":"FUCKING NYT: Cohen Secretly Taped Trump – Is it just me or is this making everyone just HATE Legacy Media + Leftist CRIMINALS MORE THAN EVER??? These BASTARDS ARE BREAKING EVERY FUCKING LAW THEY WANT AND REVEL IN IT PUBLICLY!"}
{"text":"Should we be worried? Michael Cohen secretly taped Donald Trump in 2016"}
{"text":"New Chairman of the Inflation Factory aka the Federal Reserve"}
{"text":"\"White genocide is good, and I did my part by choosing a non-white sperm donor!\". The liberal dream everybody"}
{"text":"Disney Director James Gunn Exposed: Disturbing History of Child Rape 'Jokes'"}
{"text":"The TDS Addiction Network"}
{"text":"Pretty much."}
{"text":"T is for Trump"}
{"text":"I had instructions."}
{"text":"James Gunn believes that 'Mmm Bop' a song that was sung by three children is a song about \"sucking off your brother\" because \"someone just told him\". What kind of people is he associating with?"}
{"text":"We'll always remember THIS, Whoopi... always."}
{"text":"Delicious"}
{"text":"Google to Host Racist Anti-White Talk on ‘White Fragility’"}
{"text":"Analysis | Dutch foreign minister says multicultural societies breed violence"}
{"text":"I Wanted To Share An Uplifting Comment Of Racial Reconciliation From One Of My Videos"}
{"text":"New Trump pornstar payment tape out today, I wonder what they are trying to distract from?"}
{"text":"The state of political discourse in 2018"}
{"text":"Last Month Marvel Director James Gunn said Trump ‘Wakes Up Every Morning Hoping More Kids Are Murdered By Immigrants’. Today the Trump curse caught up with him."}
{"text":"Magnitsky act is BULLSHIT pedes! More cucked bullshit to make libs happy."}
{"text":"The Absolute State of the Left: Lt. Michael \"Murph\" Murphy Memorial Destroyed"}
{"text":"New music video about Chicago gun violence"}
{"text":"Hmmmmmm"}
{"text":"Blue Wave Cartoon Democrats James Comey by Maria Grasmick"}
{"text":"ALLCON: Don't let this slide. Do your part. #PatriotsFight"}
{"text":"When a Dem finally stops REEEing and tells you what's wrong"}
{"text":"GG folks, we will lose the civil war"}
{"text":"FISA Treason"}
{"text":"Feeling, and Being... are two very different things."}
{"text":"Dammit boys, pack it up, Putin has won!"}
{"text":"L o o p h o l e"}
{"text":"Feminist Dismisses Bible As 'Godsplaining' (SATIRE)"}
{"text":"‘Occupy Democrats’ Facebook Page Is Hiring a ‘Meme Designer’"}
{"text":"Philly principals get an education on keeping LGBT kids safe"}
{"text":"Democrats are trying to elect candidates WHO DON'T EVEN LIVE IN THE STATES THEY'RE RUNNING IN!"}
{"text":"Looks like Putin is more and more of an American spy by the day"}
{"text":"Remember when Putin's agents downed a Malaysian airliner over Ukraine during Obama's watcg and Western leaders and media did nothing, then promptly forgot about it?"}
{"text":"Constructive Criticism"}
{"text":"Cohen taped discussion with Trump about possible payment to Playboy model"}
{"text":"I feel had I laughed so hard at this."}
{"text":"The CIA is operating as a parallel government with its own judiciary, financial instruments, executive and military complete with ministry of propaganda. They have ZERO CHECKS AND BALANCES and those who work for them have foregone their own rights and sworn to secrecy."}
{"text":"Further proof that the left has no sense of humor, and thus is incapable of producing dank, effective and powerful memes."}
{"text":"Ha ha Drumpf will be impeached!!"}
{"text":"New national holiday?"}
{"text":"Let the hate flow through you."}
{"text":"I think YT might be trying to push some content on me"}
{"text":"Hungover Hillary circa 2018 (colorized)"}
{"text":"Disney Director James Gunn Deletes 10,000 Tweets and Blogs After Rape &amp; Paedophilia Content Resurfaces"}
{"text":"RNC chooses Charlotte to host 2020 convention"}
{"text":"The left has to hire people to meme for them."}
{"text":"Oh no you guys! Presidency is over. President Trump had consensual sex with one of the hottest women alive when he was single. Damn they finally got us!"}
{"text":"Cognitive Dissonance: noun. “The psychological experience of a person who simultaneously holds two or more contradictory beliefs, ideas, or values.”"}
{"text":"the most accurate biography of the president"}
{"text":"Claire McCaskill staffer \"She doesn't give a shit about Missouri\"."}
{"text":"They got him now, Pedes. In peach mints incoming!!!"}
{"text":"Ask Agatha # 14 – I Tried to Follow in My Husband's Footsteps | The Continental Telegraph"}
{"text":"And you are doing an excellent job! Keep it up!"}
{"text":"During Obama's watch Putin's agents downed a Malaysian airliner over Ukraine. Western leaders did nothing, Media promptly forgot about it. Remind them."}
{"text":"This is sheer genius"}
{"text":"CLASSIC: Christian Woman Has Baby At Chick-Fil-A. Husband Uses Trump Shirt For Towel For Baby."}
{"text":"Make America great again"}
{"text":"Roseanne got memory holed for one joke about a black person (and supporting Trump). James Gunn made dozens of “jokes” about abhorrent sexual abuses children over the course of multiple years and not a fucking peep. #PizzaGate #Moloch"}
{"text":"I dropped this in an online discussion and was told I was factually misleading. Where am I wrong?"}
{"text":"Come on CNN, incomplete sentences? That’s just lazy."}
{"text":"The ultimate loophole???"}
{"text":"Every media outlet right now."}
{"text":"Fool-proof plan"}
{"text":"It's Happening, Folks. Kim Dotcom Is Starting an Anti-Censorship Tweeter Replacement! We Also Need a YT Replacement (And Anything Google, For That Matter)"}
{"text":"That was fast"}
{"text":"WHEN WILL THEY REALIZE, WE DON'T GIVE A FUCK ABOUT THE CONSTANT LIES FROM THE MSM, DOJ, FBI, &amp; EVERY OTHER CORRUPT ASS. EVERYDAY ITS THE NEW APOCALYPSE, YOU LOST, AND YOU CONTINUE TO LOSE, BECAUSE YOU DON'T GET IT. WE KNOW YOU'RE ALL FULL OF SHIT!"}
{"text":"Democrats Have Already Jumped the Shark on Judge Kavanaugh"}
{"text":"What do y'all pedes make of this? Cohen recorded Trump?"}
{"text":"In real world terms, this makes r\/The_Donald worth $14.4 TRILLION this year. That’s almost as high as Trump’s GDP."}
{"text":"200 IQ"}
{"text":"This meme circulated before James Gunn got exposed. It's aging quite well."}
{"text":"Fox News' Kimberly Guilfoyle leaving the network to hit campaign trail with DJT Jr."}
{"text":"Anon finds a loophole"}
{"text":"Far leftists are so insane they're calling each other (Bernie and non-Bernie leftists) Republicans. You can't make this up!"}
{"text":"JW: Foreign Interference in 2016 -- 1.1 Million Aliens Illegally Voted for Hillary Clinton?"}
{"text":"Trump scandals keep coming!"}
{"text":"TDS - Helsinki Strain"}
{"text":"Pedophile actor James Gunn has been caught trying to do damage control on 4chan."}
{"text":"We will never lose👏👏👏"}
{"text":"Pedophile director James Gunn has been caught trying to do damage control on 4chan pretending to defend himself."}
{"text":"IT SUDDENLY DAWNED ON ME: \"Immunity\" deals are deep state's method of protecting the swamp!!!"}
{"text":"Tons of comments like this in Marvels sub reddit. Good to see Marvel fans are pissed about Pedo Gunn."}
{"text":"Russian bots? How about media bots? The amount of ignorant programmed people in the U.S. is a problem."}
{"text":"Looks like the Russia hysteria didn't move the polls, so the MSM is back to sex stuff. Next week it will be immigration again. Then gun grabbing or something. Then back to Russia."}
{"text":"REVEALED: #Hillary2020 Campaign Poster... So that's what's under her Communist coats!! #KeepAmericaGreat"}
{"text":"Zuckerberg will be forced to apologize in 3...2...1..."}
{"text":"What Happened to the “GOD EMPEROR” Tag?"}
{"text":"A Lesson for Those Who Think America is a 'Democracy'"}
{"text":"Cohen"}
{"text":"First 50 families of farmers from South Africa may soon resettle in Russia"}
{"text":"CBS Reporter Wants a Wall After Witnessing Illegals Crossing and Intimidating Him \"We were scared\""}
{"text":"Disney releases James Gunns original Rocket Racoon sketches"}
{"text":"TFW you realize that T_D has it's gaze upon your twitter history and you're screwed..."}
{"text":"Incels"}
{"text":"Everyone who supports Trump is Hitler ... but guess who isn't a racist ... the actual Hitler!"}
{"text":"Let this be real"}
{"text":"Invincible!"}
{"text":"The Left is trying to smear #WalkAway movement"}
{"text":"Babies are Victims too."}
{"text":"Michael Cohen Secretly Taped Trump Discussing Payment to Playboy Model"}
{"text":"Trump Wins"}
{"text":"In every way this new \"red flag\" law violates our rights. How can some say \"I feel threatened\" without any evidence or psychological analysis to say legal gun owners are a threat?! Bruce Rauner needs to go!!!"}
{"text":"Impeach"}
{"text":"Texas 'pede doing my part!"}
{"text":"Voter purge frenzy after federal protections lifted, new report says"}
{"text":"Michael Cohen Secretly Taped Trump Discussing Payment to Playboy Model"}
{"text":"The tolerant left..."}
{"text":"Hillary ‘Benghazi’ Clinton Has Gall to Accuse Trump White House of Not Defending Ambassador"}
{"text":"MAGA Baby Born in Chick-Fil-A!"}
{"text":"US President refuses to denounce Russian meddling"}
{"text":"Trump being given the Ellis Island Award in 1989 for contributing to the conditions of inner city black youths, standing alongside Muhammad Ali and Rosa Parks. Funny, why doesn’t the media remember this?"}
{"text":"Presidency Loophole"}
{"text":"Another disgusting pedo in Hollyweird. Fucking gross."}
{"text":"Trudeau appointed member of parliament Bill Blair, Minister of Irregular Migration &amp; Border Security &amp; Organized Crime Reduction."}
{"text":"There's always a Loophole"}
{"text":"Loophole"}
{"text":"Thanks for the advice"}
{"text":"Chances ICE follows up on tip on employer for knowingly hiring undocumented workers?"}
{"text":"JW: NEW Podesta Emails Reveal Lobbying w\/ Pro-Russian Entities in Ukraine"}
{"text":"Weekly debate with liberal relative"}
{"text":"Time to choose, America. Choose wisely. It's your fate, your future, and the fate and future of your children and your children's children..."}
{"text":"\"I want you dead. I want your families dead. I want your wives, husbands children and grandchildren dead. Torturous cancers. Burning alive in a fire. Drownings. Wives and daughters brutally raped first.\" Liberal reveals utter HATRED for conservatives. So much for being \"For the People\"..."}
{"text":"Taken from r\/greentext"}
{"text":"The left can't meme."}
{"text":"White Helmets to be evacuated, sent to UK\/Germany\/Canada"}
{"text":"To fellow WoW players! Join T_D community on WoW today!"}
{"text":"Another nothing burger to rile up the TDS. Giuliani: “he (Trump) directed Cohen to write a check instead of cash so it would be properly documented.”"}
{"text":"What a genius"}
{"text":"More Universities Adopt 'Anti-Oppression Guide'"}
{"text":"Remember when j.k.r. said that trumps right to free speech protected her own, but now the uk are arresting people for free speech? Free Tommy."}
{"text":"Isn't this the equivalent of oppressing real women?"}
{"text":"If this isn't proof that liberalism is a disease, I don't know what will convince you. They are now licking toilets..."}
{"text":"GOLDBERG sisters, Loopie ans Poopie......"}
{"text":"Sounds like a great idea to me!"}
{"text":"GOLDBERG sisters, Loopie and Poopie......"}
{"text":"Found on r\/greentext"}
{"text":"I'm a 40 year old trump supporter"}
{"text":"Now This could be the one time I would actually watch- @RealCandaceO:I think the ladies of @TheView should invite me on for a little chit-chat. @MeghanMcCain, I’m curious if you have anything to say about how @JudgeJeanine was treated yesterday?"}
{"text":"💰FOLLOW THE MONEY💰 Deep digging showing how *The Dossier* connects, and the dear folks at FUSION GPS‼️"}
{"text":"He FBI totally didnt leak this or anything like thag"}
{"text":"Before and after photos of Whoopi Goldberg when she hears someone praising President Trump."}
{"text":"YALE: \"Hide Immigrants from ICE\" – Yale professor encouraging people to break the law, to hide immigrants - saying we have unleashed something \"evil\" in the USA with rounding up immigrants – Aiding &amp; Harboring fugitives is illegal!"}
{"text":"Mueller isn't offering blanket immunity to Podesta. He's Offering a kind called \"Use Immunity\"."}
{"text":"About that poll that says 51% think trump committed treason"}
{"text":"Soy boy admits dead cops are good. This is what we are dealing with, folks."}
{"text":"The Fake News Media is going Crazy! They make up stories without any backup, sources or proof. Many of the stories written about me, and the good people surrounding me, are total fiction. Problem is, when you complain you just give them more publicity. But I’ll complain anyway! - @realDonaldTrump"}
{"text":"Mike Pompeo: ‘Incredibly valuable’ for Putin and Trump to meet again"}
{"text":"Mickey Mouse's replacement at Disney being unveiled."}
{"text":"Chinese police removed after row in Zambia"}
{"text":"WHOOPIE!! Judge Jeanine Pirro's Book, \"Liars, Leakers and, Liberals\" is now #1 Bestseller on Amazon.com!"}
{"text":"The Democrats have a death wish, in more ways than one – they actually want to abolish ICE. This should cost them heavily in the Midterms. Yesterday, the Republicans overwhelmingly passed a bill supporting ICE! - @realDonaldTrump"}
{"text":"\"I did not have sexual relations with that woman\""}
{"text":"The Washington ComPost has made it official."}
{"text":"Iranian man wounds several people in stabbing spree on bus in Germany"}
{"text":"The greatest plan"}
{"text":"💰FOLLOW THE MONEY 💰 More info found about FUSION GPS and *The Dossier*...and Georgie Soros"}
{"text":"Liberals BTFO -- SCIENCE proves they don't find meaning or purpose in their lives."}
{"text":"Every Time You See A Story About Millions Of Americans Receiving Raises And Bonuses Due To The Trump Tax Cut, Remember This: Democrats Are Suing To Stop It"}
{"text":"Just a photo of James Gunn and his buddy Mark Hamill"}
{"text":"Diversity, I am a philosipherizator, Ive read 4 chapters of plato and now completely grasp philosophy 😂😂"}
{"text":"Tucker Eviscerates John Brennan On Security Clearance — ‘Not A Stable Man’"}
{"text":"Amazon has locked reviews of the #1 bestselling book on their site (Judge Jeanine). You cannot leave a review, for the #1 best seller."}
{"text":"Report: Lisa Page revealed under oath that there was no basis for Mueller's appointment"}
{"text":"Who Does it better?"}
{"text":"Trump Derangement Syndrome"}
{"text":"Open Letter to Clapper: \"Fuck You\" Template available in stores now."}
{"text":"Just got harassed at supermarket (satire)"}
{"text":"Maxine Waters supporters chant 'black power,' burn American flag outside her office"}
{"text":"The loophole we were waiting for"}
{"text":"President Trump threatens to be Putin's \"worst enemy\" if the the two countries can't get along. HuffPo, MSNBC, CNN don't think this is newsworthy. They are FAKE NEWS"}
{"text":"University Could Fire Staffers, Punish Students for Using Wrong Pronouns -- WELCOME TO CANADA, er MINNESOTA!"}
{"text":"Michael Cohen Secretly Taped Trump Discussing Payment to Playboy Model"}
{"text":"Rules for thee not for me"}
{"text":"James Gunn birthday cake."}
{"text":"Does Kimberly G. Trump sound good?"}
{"text":"The Bolt Report | Lauren Southern receives $68,000 bill from Victoria Police Australia"}
{"text":"Mueller be like . . ."}
{"text":"This Tape Story is a Nothing Burger"}
{"text":"Let’s Make a Deal!!!!"}
{"text":"Guys this is still happening &amp; we need to try to get a handle on it before mid-terms because it is not in our favor. Fraction Magic, and election fraud. Who really won the popular vote?"}
{"text":"Whoopee"}
{"text":"FISA Treason"}
{"text":"Just a reminder that this self-proclaimed \"House N-word\" named his production company after raping underaged children ... neither phased HBO and he is still gainfully employed by them."}
{"text":"Ireland’s PM has been branded ‘mad’ for threatening to stop British planes flying over Ireland as revenge for Brexit"}
{"text":"MAGA christian dad delivers a baby in Chick-fil-A bathroom in a Trump shirt. ‘Little nugget’ gets free nuggets for life."}
{"text":"They Broke YouTube. This is unbelievable. They have out Orwwllianed Orwell"}
{"text":"Judge Jeanie triggers whoopie and a little about me!"}
{"text":"So let me get this straight, President Trump is called a traitor because he doesn’t trust his Intel Committee? The same IC that has had numerous misinformation given to multiple presidents, one of which is the reason we’re in the Middle East?"}
{"text":"ALEX JONES! THE JUSTIN BIEBLERS RANT!"}
{"text":"Trump forever!"}
{"text":"Foreign Interference in 2016 Election Uncovered! Spicey..."}
{"text":"Let's send copies of Jeanine Pirro's book to The View studio! (info inside)"}
{"text":"WHOOPIE!! Judge Jeanine Pirro's Book, \"Liars, Leakers and, Liberals\" is now #1 Bestseller on Amazon.com!"}
{"text":"THE POPCORN NEEDED WHEN COHENS TAPES PROVE TRUMP INNOCENT AND LIBERALS CRAP THEIR BRAINS"}
{"text":"Anon finds a loophole"}
{"text":"Michael Cohen Supposedly Recorded a Conversation Between Him and GEOTUS Re: Hush Payment"}
{"text":"Ecuador to hand over Assange to UK ‘in coming weeks or days,’ own sources tell RT's editor-in chief"}
{"text":"House panel sets vote on $5 billion border wall bill"}
{"text":"The memory of a goldfish."}
{"text":"French couple beaten up by 'Algerians' for shouting 'Vive la France' after World Cup final"}
{"text":"BREAKING: Trump was banging Playboy models"}
{"text":"Google the word 'Idiot,' get pics of Donald Trump The result is linked to Redditors gaming Google's search algorithm by upvoting a picture of Trump with word \"idiot\". Here is the post go downvote it https:\/\/www.reddit.com\/r\/The_Mueller\/comments\/8on76n\/the_first_picture_that_comes_up_when_you_google\/"}
{"text":"Something doesn't seem right here."}
{"text":"HOT MIC CATCHES WHAT MARINE WHISPERS TO TRUMP AT WHITE HOUSE EVENT"}
{"text":"Trump-Putin-Montenegro-NATO and Why They Matter"}
{"text":"I wonder when the left will finally get it..."}
{"text":"I just want to give a shout out to this truly selfless individual. He owns a small mechanic shop in La Junta, CO where I grew up. I've known him since I was a kid, over 20 years, and has always been a stand up individual. He went above and beyond with this. Salute to you Gilbert!!"}
{"text":"Admins Are Cool With This."}
{"text":"As if we needed any more evidence that the left can't meme"}
{"text":"French ambassador to the US to Trevor Noah: \"Unlike in the United States of America, France does not refer to its citizens based on race, religion or origin. To us, there is no hyphenated identity, roots are an individual reality.\" • r\/europe"}
{"text":"DNC\/Marxist desire this enrichment: NO GO ZONE Utopia - The Flixbus inter-city bus company plans to cancel its service to a station in Brussels North, citing frequent attacks on passengers and threats to drivers."}
{"text":"Remake NATO into OTO. \"Oceanic Treaty Org\". Include Japan,Phili,Korea,Aus,NZ. Europe needs to help contain China as US helps them contain Russia."}
{"text":"Berkeley High grad Amer Sinan Alhaggagi pleads guilty to helping ISIS, spoke of plan to kill 10,000 in Bay Area"}
{"text":"END THE FUCKING FED"}
{"text":"disney's pedophile.. the children deserve safety, protection and justice.. #patriotsfight"}
{"text":"World class. Trump dated her. Be outraged!"}
{"text":"ReLiGiOn Of PeAcE"}
{"text":"So much Redpilling in Comments on this Yahoo article, of all places"}
{"text":"Hungary Quits UN Migration Pact, Calls it a 'Threat to the World'"}
{"text":"WOW! HERE COMES THE RACE CARD! Whoopi: In Front Of The Audience Jeanine Pirro Called Everybody A Name I Cannot Repeat On TV ..."}
{"text":"Tucker: Somehow It's Not Treason When Democrats Encourage Non-Citizens To Vote In The US"}
{"text":"Violent Left: Supporters of Crazy Maxine Waters steal American flag, burn it outside her office"}
{"text":"THE ALMIGHTY DONALD TRUMP AND HIS APOSTLE MIKE PENCE"}
{"text":"People on the left full on support assaulting people with MAGA hats, they even boast and brag about it!"}
{"text":"🚨 CHICAGO GUN FREE ZONE🚨Police said the 5,170 illegal guns removed from city streets 🔫 THIS YEAR 🔫 equate to one Police said the 5,170 illegal guns removed from city streets equate to one illegal gun seized every hour of the day–more than the New York and Los Angeles Police Departments"}
{"text":"BREAKING: Following the US\/North Korea summit, Singapore health database hacked -- 1.5 million people affected, including the Prime Minister. Looks like Xi is more butthurt over the summit than we originally thought."}
{"text":"Why has the left abandoned the children????"}
{"text":"Glorious"}
{"text":"Hungary Quits UN Migration Pact, Calls it a 'Threat to the World'"}
{"text":"Loopholes"}
{"text":"WOW!! Whoopi: In Front Of The Audience Judge Jeanine Pirro Called Everybody A Name I Cannot Repeat On TV ..."}
{"text":"Behold the destroyer...."}
{"text":"Is it too late to fire Bob Mueller?"}
{"text":"Here’s one expat who left the US to avoid the chaos of the Trump presidency."}
{"text":"Loophole"}
{"text":"Gavin and guests discuss: Who's the BEST gay? - NotGayJared: “Barrack Obama... he calls his wife Michael”"}
{"text":"Nazi Germany - Wikipedia • r\/europe - Wikipedia article with a Nazi flag thambnail banned on the European subreddit because it's banned in Germany"}
{"text":"Dropping Red Pills on one of the pro-pedo literary subs got my comment chain nuked."}
{"text":"The louder the outrage, the more I KNOW he is literally saving our country."}
{"text":"Kimberley Strassel: John Brennan, Obama's CIA director, admits egging on the FBI's probe of Trump and Russia"}
{"text":"Disney Director James Gunn Exposed: Disturbing History of Child Rape 'Jokes'"}
{"text":"UK Government Fights 'Alternative News' Websites, Promotes 'Facts'"}
{"text":"A young Jewish man was violently assaulted after leaving a synagogue in Vienna by a man who shouted angrily in German and Arabic"}
{"text":"ESPN: destroyed, Star Wars: destroyed, ABC cancels Roseanne and Last Man Standing- now destroyed by Whoopi Goldsteinism. Why is Disney deliberately destroying all its brands? For SJW, globalist nonsense?"}
{"text":"Twitter Updates Its Logo to Better Reflect Company’s Brand\/Objective."}
{"text":"CHURCHILL &amp; TRUMP"}
{"text":"Trump, The Mighty, Commanding Authority"}
{"text":"Lost in the news cycle?"}
{"text":"Who wants to know?"}
{"text":"An app to deal with all the negative covfefe"}
{"text":"when the left hears Trump is meeting with Putin Alone"}
{"text":"The compassionate Left."}
{"text":"Ecuador will hand over Julian Assange to the UK authorities \"within days or weeks\"."}
{"text":"Beto O’Rourke Understands How Impeachment Works—and That’s Why He Supports Impeaching Trump"}
{"text":"Another Example Of Why 'Gun Free Zones' Actually Aren't"}
{"text":"Smirking Taliban bomb-maker who plotted knife attack in Westminster but was caught outside Downing Street with bag full of knives after his mother called 999 is jailed for 40 years"}
{"text":"As usual Rosanne cuts through the bullshit in EPIC Rant &amp; gets to the point in defense of Tweet about Valerie Jarrett that cost her her show. Nice blond hairdo &amp; tan Rosanne."}
{"text":"On michael cohens secret tapes"}
{"text":"A Picture of Some of Our Favorite Ladies or a Test of Your Self Control? You're Welcome!"}
{"text":"This is a \"job seeker's market\" as we experience record low unemployment"}
{"text":"There's one quote in True Detective where Cohle says he'll never turn away, not again. Errol = Weinstein. There's more to this series, the coast and religious backgrounds were changed, but it's all too real. Art imitating life?"}
{"text":"\"Non-Citizens Should Be Allowed to Vote?!\" Tucker vs Harvard Socialist Professor"}
{"text":"disneys pedophile janes gunn... he needs corrected. #patriotsfight"}
{"text":"Theresa May blasted for soaring crime as the number of police officers hits a 36-YEAR low"}
{"text":"Love my POTUS - I’m a God fearing heterosexual man who forgives the POTUS for any porn star accusations the media is throwing at him. Respect that he wasn’t a secret homosexual like Barry Soetoro and his husband Michael."}
{"text":"Oldie-House committee on Government and Reform - includes list of donors to Clinton Foundation over a million. Notice any overlap in ones Trump is being investigated for? Pinchuk gave Trump $150,000 for video appearance at conference, and over $1,000,000 to Clinton Foundation."}
{"text":"Marvels newest super hero"}
{"text":"Dems are “For the People”…Well, except conservatives, especially conservative minorities, white men, Christians, heterosexuals, gun owners, flyover states, US citizens, anyone in Walmart, or deplorables, or cops, or military… Face it SPLC, you and the Dems ARE another hate group."}
{"text":"[End the FED.] End \"illegal currency manipulation\" - Trump"}
{"text":"Lauren Southern destroys the concept of Multiculturalism"}
{"text":"\"Royals\""}
{"text":"These comments in r\/pol just shows how much of an echo chamber the left really resides in that they have no clue what we are all about. To even doubt our love for the USA? Are you serious!?"}
{"text":"Hungary Protecting Persecuted Christians Around the World!!!"}
{"text":"We Must Ban Fully Automatic Semi-Aquatic Vehicles!"}
{"text":"FBI Investigating Chinese Espionage in All 50 States"}
{"text":"CrossFit acknowledges that guns plan no significant role in the American mortality rate."}
{"text":"Man, Trump was out there hittin supermodels, pornstars, playmates,"}
{"text":"Zinke Is Shipping The Headquarters Of The Largest Land-Owning Agency Out Of DC"}
{"text":"Hey, pedes! I have some time on my hands over the next few months and want to give back to military vets\/their families in my area (NYC). Anyone know of any good organizations or resources?"}
{"text":"Move Over Iraq and Iran, Texas is Taking Over as the World's No. 3 Oil Producer"}